[
   {
      "dtend":"20120716T123000",
      "dtstart":"20120716T090000",
      "dtstamp":"20120724T225507",
      "location":"Portland 251",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23871",
      "uid":"http://oscon.com/--s2012-07-16-09:00--23871",
      "summary":"HTML5 Workshop (SOLD OUT)",
      "description":"Presented by Nathaniel Schutta (ntschutta.com). Interested in HTML5? Want a chance to play around with the latest and greatest in web app development? This workshop is for you! We'll cover feature detection, web forms, the new HTML elements, take a spin around the canvas, and we'll finish up with offline/local storage.",
      "id":1
   },
   {
      "dtend":"20120716T170000",
      "dtstart":"20120716T133000",
      "dtstamp":"20120728T234516",
      "location":"Portland 251",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23658",
      "uid":"http://oscon.com/--s2012-07-16-13:30--23658",
      "summary":"HTML 5 Canvas Deep Dive (SOLD OUT)",
      "description":"Presented by Joshua Marinacci (Nokia). The Canvas element is one of the most exciting features added to HTML since the marquee tag.  You can draw 2D graphics, implement special effects, edit photos at the pixel level, and bring rich animation to both desktop and mobile browsers alike; no plugins required. By the end of this workshop you will have good running code. New for 2012: adv. audio, WebGL, and mobile canvas support.",
      "id":2
   },
   {
      "dtend":"20120717T123000",
      "dtstart":"20120717T090000",
      "dtstamp":"20120730T101213",
      "location":"Portland 251",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23120",
      "uid":"http://oscon.com/--s2012-07-17-09:00--23120",
      "summary":"jQuery - Captain's Log",
      "description":"Presented by Gregg Pollack (Envy Labs), Olivier Lacan (Envy Labs), Christopher Green (Envy Labs), Tyler Hunt (Envy Labs). So you know the basics of jQuery and Selectors, but you want to solidify your knowledge with jQuery events, ajax, effects, and code organization. This course picks up where Intro to jQuery 1 left off, jumping straight into the most useful jQuery techniques. We'll cover Events, AJAX, Effects, and Code Organization in detail, utilizing the Code School engine so you can code in the browser.",
      "id":3
   },
   {
      "dtend":"20120717T170000",
      "dtstart":"20120717T133000",
      "dtstamp":"20120730T101225",
      "location":"Portland 251",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23876",
      "uid":"http://oscon.com/--s2012-07-17-13:30--23876",
      "summary":"jQuery Mobile Workshop",
      "description":"Presented by Nathaniel Schutta (ntschutta.com). The word just came down from the VP - you need a mobile app and you need it yesterday. It needs to be polished and have that design stuff too. Oh and it needs to be on all the major platforms in time for the big marketing push next month. After a moment of panic, you wonder if it's too late to become a plumber...",
      "id":4
   },
   {
      "dtend":"20120718T112000",
      "dtstart":"20120718T104000",
      "dtstamp":"20120731T202828",
      "location":"Portland 251",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24184",
      "uid":"http://oscon.com/--s2012-07-18-10:40--24184",
      "summary":"Mind-blowing apps with HTML5 Canvas",
      "description":"Presented by David Geary (Clarity Training, Inc.). This talk is a demo-fueled, fast-paced introduction to HTML5 Canvas.",
      "id":5
   },
   {
      "dtend":"20120718T121000",
      "dtstart":"20120718T113000",
      "dtstamp":"20120726T163344",
      "location":"Portland 251",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23874",
      "uid":"http://oscon.com/--s2012-07-18-11:30--23874",
      "summary":"JavaScript Libraries You Aren't Using...Yet",
      "description":"Presented by Nathaniel Schutta (ntschutta.com). Believe it or not, the JavaScript party hasn't stopped. What other libraries are out there? What do they offer? This talk will survey the field of modern JavaScript libraries getting you up to speed on what's new.",
      "id":6
   },
   {
      "dtend":"20120718T142000",
      "dtstart":"20120718T134000",
      "dtstamp":"20120724T230306",
      "location":"Portland 251",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23995",
      "uid":"http://oscon.com/--s2012-07-18-13:40--23995",
      "summary":"You Ain't SPDY",
      "description":"Presented by Chris Strom (EEE Computes). You package your assets. You use CSS sprites. You serve up everything with gzip compression. You obsess over Yslow recommendations. But you are still not SPDY. Fundamental limitations in HTTP and TCP/IP still add up to 60% overhead to your site. Find out how to reclaim that lost bandwidth and increase the robustness of your sites at the same time.",
      "id":7
   },
   {
      "dtend":"20120718T151000",
      "dtstart":"20120718T143000",
      "dtstamp":"20120723T171914",
      "location":"Portland 251",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23573",
      "uid":"http://oscon.com/--s2012-07-18-14:30--23573",
      "summary":"Test Driven UI Development",
      "description":"Presented by Joakim Recht (Tradeshift). Testing HTML UIs - can it be done? Most people instinctively say no, but it doesn't have to be like that. Using technologies like Webdriver, Selenium, and Geb, it actually becomes possible, and we'll take a look at how.",
      "id":8
   },
   {
      "dtend":"20120718T165000",
      "dtstart":"20120718T161000",
      "dtstamp":"20120727T160215",
      "location":"Portland 251",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24369",
      "uid":"http://oscon.com/--s2012-07-18-16:10--24369",
      "summary":"What's Up with HTML5 Video?",
      "description":"Presented by Scott Davis (ThirstyHead.com). If you are flummoxed with HTML5 video—browers, codecs, and containers—this is your talk. In a plain-spoken, easy to understand style, Scott Davis will help you cut through the hype and the hope and add video to your website.",
      "id":9
   },
   {
      "dtend":"20120718T174000",
      "dtstart":"20120718T170000",
      "dtstamp":"20120727T160245",
      "location":"Portland 251",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24337",
      "uid":"http://oscon.com/--s2012-07-18-17:00--24337",
      "summary":"WebRTC and the Future of Video Communications",
      "description":"Presented by Ben Strong (vline). WebRTC is a new web standard for HD video calling and conferencing that will be supported in Chrome and Firefox this summer. We'll give an overview of the APIs and protocol stack and explore how it will change the way people communicate.",
      "id":10
   },
   {
      "dtend":"20120719T112000",
      "dtstart":"20120719T104000",
      "dtstamp":"20120724T225918",
      "location":"Portland 251",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24227",
      "uid":"http://oscon.com/--s2012-07-19-10:40--24227",
      "summary":"Essential Node.js for Web Developers",
      "description":"Presented by Mike Amundsen (Layer 7 Technologies). Unlike some introductions to Node.js that spend time explaining event loops and web sockets, this session start with a typical “Hello, Node” demo and quickly moves to short, fully-functional pps that show how to deal with static files, POST forms, mashups from other servers, file manipulation, data-handling, and even supporting HTTP Authentication.",
      "id":11
   },
   {
      "dtend":"20120719T121000",
      "dtstart":"20120719T113000",
      "dtstamp":"20120724T225934",
      "location":"Portland 251",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23864",
      "uid":"http://oscon.com/--s2012-07-19-11:30--23864",
      "summary":"Node.js in Production: Postmortem Debugging and Performance Analysis",
      "description":"Presented by David Pacheco (Joyent). While dynamic languages are extremely popular for rapid development, they're notoriously difficult to debug in production. Despite being a relative newcomer, Node.js has already developed sophisticated tools for both postmortem and runtime analysis that exceed those of many popular languages. We will discuss our work building and deploying such tools, including real-world production experiences.",
      "id":12
   },
   {
      "dtend":"20120719T142000",
      "dtstart":"20120719T134000",
      "dtstamp":"20120725T175348",
      "location":"Portland 251",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24045",
      "uid":"http://oscon.com/--s2012-07-19-13:40--24045",
      "summary":"Location, Location, Location: Mastering HTML 5 Geolocation",
      "description":"Presented by Andy Gup (Esri). This session takes you through an in-depth look at the HTML 5 Geolocation API. We'll nail down what it is and how to use it effectively. Our tips and tricks will save you a ton of time. We'll demonstrate those key concepts through real-world demos that will also take you to the next step and show you several ways to analyze and make sense of the data.",
      "id":13
   },
   {
      "dtend":"20120719T151000",
      "dtstart":"20120719T143000",
      "dtstamp":"20120725T175408",
      "location":"Portland 251",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24461",
      "uid":"http://oscon.com/--s2012-07-19-14:30--24461",
      "summary":"Web Application Accessibility",
      "description":"Presented by Alice Boxhall (Google). There are millions of software users with disabilities worldwide, yet many web application developers aren't aware of the techniques which can be used to make their software accessible. This talk will give an overview of what accessibility means and why it's important to you, a run-down of the technology and techniques for achieving it, and a look at how browsers provide accessibility support.",
      "id":14
   },
   {
      "dtend":"20120719T165000",
      "dtstart":"20120719T161000",
      "dtstamp":"20120726T211235",
      "location":"Portland 251",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23029",
      "uid":"http://oscon.com/--s2012-07-19-16:10--23029",
      "summary":"Mashing up JavaScript – Advanced techniques for modern web applications",
      "description":"Presented by Bastian Hofmann (ResearchGate GmbH). Nowadays many modern web applications are solely relying on JavaScript to render their frontend. But if you want to create mashups, load data from many different places or include external widgets into your site, you are quickly running into boundaries because of browser and security restrictions. In this presentation I will talk about techniques helping you with such problems.",
      "id":15
   },
   {
      "dtend":"20120719T174000",
      "dtstart":"20120719T170000",
      "dtstamp":"20120704T003755",
      "location":"Portland 251",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24409",
      "uid":"http://oscon.com/--s2012-07-19-17:00--24409",
      "summary":"Wikipedia's Next Billion Users with WebFonts",
      "description":"Presented by Alolita Sharma (Wikimedia Foundation). For the first time in Wikipedia's 11 year history, it rolled out open source WebFonts in January to make open knowledge more accessible to billions of readers in 14 major Indic languages. Learn more about how open source internationalization tools such as WebFonts, Narayam and language support are helping make valuable content on the Web more accessible.",
      "id":16
   },
   {
      "dtend":"20120720T104000",
      "dtstart":"20120720T100000",
      "dtstamp":"20120723T173801",
      "location":"Portland 251",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23471",
      "uid":"http://oscon.com/--s2012-07-20-10:00--23471",
      "summary":"Declarative web data visualization using ClojureScript",
      "description":"Presented by Kevin Lynagh (Keming Labs). Excellent statistical graphics first and foremost *show the data*. Likewise, the tools for making such graphics should emphasize essential data-visual mappings and hide implementation details. We describe a D3-like language for visualizing data on the web using declarative, constraint-based layout, implemented in ClojureScript.",
      "id":17
   },
   {
      "dtend":"20120720T114000",
      "dtstart":"20120720T110000",
      "dtstamp":"20120801T221534",
      "location":"Portland 251",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24209",
      "uid":"http://oscon.com/--s2012-07-20-11:00--24209",
      "summary":"Building Big Apps with Node.JS",
      "description":"Presented by Rik Arends (Cloud9 IDE Inc). Are you building a big app, and wondering why NodeJS backends scale so well for applications? At Cloud9 we have built our entire backend in Node.JS, and it has taught us a lot of lessons. In this presentation i want to go through what we learned at Cloud9 IDE also want to give attention to common pitfalls and tracing bugs.",
      "id":18
   },
   {
      "dtend":"20120720T123000",
      "dtstart":"20120720T115000",
      "dtstamp":"20120720T235200",
      "location":"Portland 251",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24028",
      "uid":"http://oscon.com/--s2012-07-20-11:50--24028",
      "summary":"node.js and ql.io - Build Your Own HTTP APIs for Agility and Scale",
      "description":"Presented by Subbu Allamaraju (eBay Inc.), Jonathan LeBlanc (PayPal). Today's web and mobile apps ever more personalized with increased reliance on server side APIs. But data retrieval from servers slows down developers and users due to code complexity, latency, low-resiliency, and bandwidth use. In this talk we'll show how ql.io, a node.js based HTTP gateway from eBay, can accelerate HTTP API programming to boost performance and user experience.",
      "id":19
   },
   {
      "dtend":"20120716T123000",
      "dtstart":"20120716T090000",
      "dtstamp":"20120725T030549",
      "location":"Portland 252",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23907",
      "uid":"http://oscon.com/--s2012-07-16-09:00--23907",
      "summary":"Get Better at Git",
      "description":"Presented by Matthew McCullough (GitHub, Inc.), Tim Berglund (August Technology Group, LLC). Matthew McCullough, trainer for GitHub.com, and Tim Berglund, co-presenter of the O'Reilly Git Master Class videos and Mastering Advanced Git videos, will guide you through the fundamentals and a few intermediate elements of Git in three hours of lecture, discussion, and hands-on exercises.",
      "id":20
   },
   {
      "dtend":"20120716T170000",
      "dtstart":"20120716T133000",
      "dtstamp":"20120723T020031",
      "location":"Portland 252",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24077",
      "uid":"http://oscon.com/--s2012-07-16-13:30--24077",
      "summary":"MySQL Cluster and NoSQL",
      "description":"Presented by John David Duncan (Oracle Corp.), Craig L Russell (Oracle Corporation). A tutorial on setting up MySQL Cluster 7.2 and developing hybrid SQL/NoSQL applications using the Cluster/J and Memcached APIs.",
      "id":21
   },
   {
      "dtend":"20120717T123000",
      "dtstart":"20120717T090000",
      "dtstamp":"20120725T202804",
      "location":"Portland 252",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23301",
      "uid":"http://oscon.com/--s2012-07-17-09:00--23301",
      "summary":"CSS: Go from Good to Great",
      "description":"Presented by Estelle Weyl (Standardista.com). Web development without Photoshop, IDs or classes?  Improve your development time, reduced maintenance costs, SEO, accessibility and site performance with CSS. This skills-based workshop will cover including selectors, specificity, media queries, backgrounds,  gradients, animations, browser quirks, debugging and basic to advanced best practices.",
      "id":22
   },
   {
      "dtend":"20120717T170000",
      "dtstart":"20120717T133000",
      "dtstamp":"20120808T233121",
      "location":"Portland 252",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23774",
      "uid":"http://oscon.com/--s2012-07-17-13:30--23774",
      "summary":"Introduction to Android Testing",
      "description":"Presented by Diego Torres Milano (N/A). Organizations and individuals seriously involved in Android development should consider testing as a pillar in their strategy. In this session we will analyze the components available in the Android platform to support unit testing, Test Driven Development, performance tests, test automation, code coverage analysis and Continuous Integration.",
      "id":23
   },
   {
      "dtend":"20120718T112000",
      "dtstart":"20120718T104000",
      "dtstamp":"20120722T005227",
      "location":"Portland 252",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23769",
      "uid":"http://oscon.com/--s2012-07-18-10:40--23769",
      "summary":"Apache Hadoop - The Future is Now",
      "description":"Presented by Arun Murthy (Hortonworks Inc.). The Apache Hadoop project is becoming the de-facto big-data platform. The community is gearing up the first major release of Hadoop in over 2 years. This talk will cover the major highlights of the release and also the mechanics of what it takes to deliver a major Hadoop release. Arun C Murthy is VP, Apache Hadoop at ASF and the Release Manager for this release.",
      "id":24
   },
   {
      "dtend":"20120718T121000",
      "dtstart":"20120718T113000",
      "dtstamp":"20120820T220450",
      "location":"Portland 252",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24054",
      "uid":"http://oscon.com/--s2012-07-18-11:30--24054",
      "summary":"Storm: distributed and fault-tolerant realtime computation",
      "description":"Presented by Nathan Marz (Twitter). Storm is an open-source realtime computation system relied upon by Twitter for much of its analytics. Storm does for realtime computation what Hadoop did for batch computation. It has a huge range of applications and combines ease of use with a robust foundation. Since being open-sourced, Storm has been adopted by over 25 companies.",
      "id":25
   },
   {
      "dtend":"20120718T142000",
      "dtstart":"20120718T134000",
      "dtstamp":"20120808T155201",
      "location":"Portland 252",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24145",
      "uid":"http://oscon.com/--s2012-07-18-13:40--24145",
      "summary":"Scaling near-realtime analytics with Kafka and HBase",
      "description":"Presented by Dave Revell (Urban Airship), Nate Putnam (Urban Airship ). Turning billions of events into near-realtime analytics is hard. Urban Airship collects events from hundreds of millions of mobile apps and turns them into meaningful analytics using open source technology like Hadoop, Kafka and HBase. We’ll cover near-realtime big data scaling techniques from the architectural level to the operational level.",
      "id":26
   },
   {
      "dtend":"20120718T151000",
      "dtstart":"20120718T143000",
      "dtstamp":"20121116T142712",
      "location":"Portland 252",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23966",
      "uid":"http://oscon.com/--s2012-07-18-14:30--23966",
      "summary":"Sensor Network Data Collection and Storage",
      "description":"Presented by Charles Bell (Oracle). Building sensor networks, while challenging, can be a data rich endeavor. But what do you do with all of the data you collect? How do you store and make sense of the results? Where do you store the information? This session explores the options available and demonstrates how to store the data in a database system for easy retrieval.",
      "id":27
   },
   {
      "dtend":"20120718T165000",
      "dtstart":"20120718T161000",
      "dtstamp":"20120722T204752",
      "location":"Portland 252",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23360",
      "uid":"http://oscon.com/--s2012-07-18-16:10--23360",
      "summary":"Hybrid Applications with MongoDB and RDBMS",
      "description":"Presented by Steve Francia (10gen). It is common to use multiple systems as part of the infrastructure of an application, but it’s sometimes unclear to developers when to use MongoDB alongside a relational database and what the best practices are. This presentation will introduce MongoDB, make the case for hybrid applications, and outline several real-world examples of such applications.",
      "id":28
   },
   {
      "dtend":"20120718T174000",
      "dtstart":"20120718T170000",
      "dtstamp":"20120719T224229",
      "location":"Portland 252",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23693",
      "uid":"http://oscon.com/--s2012-07-18-17:00--23693",
      "summary":"Integrating Apache Cassandra with test-driven Development",
      "description":"Presented by Nate McCall (Apigee). Integrating a distributed database with standard test-driven development techniques can be next to impossible, especially the breadth and complexity of failure scenarios that need to be created. This Session, led by Nate McCall of DataStax, will show attendees how to make the best of the open source utilities and projects available for integrating Apache Cassandra with your testing environment.",
      "id":29
   },
   {
      "dtend":"20120719T112000",
      "dtstart":"20120719T104000",
      "dtstamp":"20120724T064224",
      "location":"Portland 252",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24150",
      "uid":"http://oscon.com/--s2012-07-19-10:40--24150",
      "summary":"Digging into Open Data",
      "description":"Presented by Kim Rees (Periscopic). Data, data everywhere, but not a structured bit. Open data is all the rage, but often this data is poorly formatted or not very accessible. This session will discuss various ways to pry open the oyster of public data.",
      "id":30
   },
   {
      "dtend":"20120719T121000",
      "dtstart":"20120719T113000",
      "dtstamp":"20120724T140511",
      "location":"Portland 252",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24051",
      "uid":"http://oscon.com/--s2012-07-19-11:30--24051",
      "summary":"Google Government Public Data: Finding and delivering the world’s government, tabular data",
      "description":"Presented by Christopher Swenson (Simple). The web consists of free-form links, and Google has excelled at quickly searching through this information. But, finding structured data, such as databases, spreadsheets, and tables is hard: they contain few links into and out of these documents. This talk discusses some of our efforts to find and present this data (focusing on government-generated), making it universally accessible and useful.",
      "id":31
   },
   {
      "dtend":"20120719T142000",
      "dtstart":"20120719T134000",
      "dtstamp":"20120808T160000",
      "location":"Portland 252",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24321",
      "uid":"http://oscon.com/--s2012-07-19-13:40--24321",
      "summary":"InnoDB: Status, Architecture, and Latest Enhancements",
      "description":"Presented by Calvin Sun (Twitter). This is a general session on InnoDB; give a brief overall of InnoDB architecture and its main features; Discuss the current state of InnoDB; also covers InnoDB roadmap.",
      "id":32
   },
   {
      "dtend":"20120719T151000",
      "dtstart":"20120719T143000",
      "dtstamp":"20120719T235422",
      "location":"Portland 252",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23994",
      "uid":"http://oscon.com/--s2012-07-19-14:30--23994",
      "summary":"Advanced MySQL Replication Architectures",
      "description":"Presented by Luís Soares (Oracle). This session presents how can MySQL replication be used in advanced setups for aggregating data from multiple masters, scaling out to hundreds of servers or even to integrate data into more esoteric slaves like non-relational stores.",
      "id":33
   },
   {
      "dtend":"20120719T165000",
      "dtstart":"20120719T161000",
      "dtstamp":"20120725T175418",
      "location":"Portland 252",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23622",
      "uid":"http://oscon.com/--s2012-07-19-16:10--23622",
      "summary":"PostgreSQL's place in the new world order",
      "description":"Presented by Matthew Soldo (Heroku, Inc). Recent shifts in the tech world - including PaaS, cloud-services, and NoSQL - have dramatically altered the manner in which software is written, deployed, and run. This talk will discuss how PostgreSQL fits into - and can potentially take advantage of - this world.",
      "id":34
   },
   {
      "dtend":"20120719T174000",
      "dtstart":"20120719T170000",
      "dtstamp":"20120724T164202",
      "location":"Portland 252",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24033",
      "uid":"http://oscon.com/--s2012-07-19-17:00--24033",
      "summary":"Unlocking Proprietary Data with PostgreSQL Foreign Data Wrappers",
      "description":"Presented by Pat Patterson (Salesforce.com). This session provides an overview of PostgreSQL 9.1 Foreign Data Wrappers, a mechanism for retrieving data from remote data sources. We will contrast the native C interface with the Python interface provided via the Multicorn project. A real-world example will retrieve business data from salesforce.com and combine it with data held in native PostgreSQL tables using a simple SQL JOIN.",
      "id":35
   },
   {
      "dtend":"20120720T104000",
      "dtstart":"20120720T100000",
      "dtstamp":"20120819T133217",
      "location":"Portland 252",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24445",
      "uid":"http://oscon.com/--s2012-07-20-10:00--24445",
      "summary":"Optimizing MySQL Configuration",
      "description":"Presented by Peter Zaitsev (Percona Inc). MySQL's configuration file is often the focus of too much attention, and too much tweaking of variables that make no difference -- or worse, have the potential to negatively impact performance. The sample default configuration files that come with MySQL are unfortunately not very helpful or good, either.  We'll looking in creating a better one in this session.",
      "id":36
   },
   {
      "dtend":"20120720T114000",
      "dtstart":"20120720T110000",
      "dtstamp":"20120729T200713",
      "location":"Portland 252",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24305",
      "uid":"http://oscon.com/--s2012-07-20-11:00--24305",
      "summary":"Explaining the Postgres Query Optimizer",
      "description":"Presented by Bruce Momjian (EnterpriseDB). The optimizer is the \"brain\" of the database, interpreting SQL queries and determining the fastest method of execution. This talk uses the explain command to show how the optimizer interprets queries and determines optimal execution.",
      "id":37
   },
   {
      "dtend":"20120720T123000",
      "dtstart":"20120720T115000",
      "dtstamp":"20120803T120111",
      "location":"Portland 252",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24219",
      "uid":"http://oscon.com/--s2012-07-20-11:50--24219",
      "summary":"The Past, Present and Future of NoSQL",
      "description":"Presented by Andreas Kollegger (Neo Technology). In this session, Andreas Kollegger will take you on a whirlwind tour of the current NoSQL landscape. He'll give a crash course overview of the four main categories of NoSQL databases, and discuss what's currently lacking to make the enterprise adopt NoSQL, and how to solve it.",
      "id":38
   },
   {
      "dtend":"20120719T210000",
      "dtstart":"20120719T190000",
      "dtstamp":"20120728T194754",
      "location":"Portland 252",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23902",
      "uid":"http://oscon.com/--s2012-07-19-19:00--23902",
      "summary":"State of the Onion & Perl Lightning Talks",
      "description":"Presented by Jim Brandt (Best Practical Solutions), Larry Wall (The Wall Nuthouse). Join us for the annual State of the Onion address with Larry Wall and the ever popular Perl Lightning Talks.",
      "id":39
   },
   {
      "dtend":"20120716T123000",
      "dtstart":"20120716T090000",
      "dtstamp":"20120724T140616",
      "location":"Portland 255",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24187",
      "uid":"http://oscon.com/--s2012-07-16-09:00--24187",
      "summary":"Building applications with MongoDB: An introduction",
      "description":"Presented by Steve Francia (10gen). This hands-on session will introduce the audience to building applications with MongoDB - the open source document-oriented NoSQL database. The tutorial will take the user through building a simple location-based (like foursquare) from start to finish. Attendees will finish the session with a working application they use to check into locations around Portland from any HTML5 enabled phone!",
      "id":40
   },
   {
      "dtend":"20120716T170000",
      "dtstart":"20120716T133000",
      "dtstamp":"20120721T085311",
      "location":"Portland 255",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23224",
      "uid":"http://oscon.com/--s2012-07-16-13:30--23224",
      "summary":"Moose is Perl: A Guide to the New Revolution",
      "description":"Presented by Ricardo Signes (Pobox.com). Moose continues to emerge as the new standard for writing OO libraries in Perl.  It provides a powerful, consistent API for building classes with a minimum of code. It can be customized with reusable components, making it easier to refactor your code as you go. This tutorial will explain what Moose is, how its parts work together, and how to start using Moose today to get more done with less.",
      "id":41
   },
   {
      "dtend":"20120717T123000",
      "dtstart":"20120717T090000",
      "dtstamp":"20120808T232724",
      "location":"Portland 255",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24288",
      "uid":"http://oscon.com/--s2012-07-17-09:00--24288",
      "summary":"Android-Fu: Awesome Apps for Ice Cream Sandwich and Beyond",
      "description":"Presented by Paris Buttfield-Addison (Secret Lab Pty. Ltd.), Christopher Neugebauer (chris.neugebauer.id.au), Jonathon Manning (Secret Lab Pty. Ltd.). In this session you'll learn why you can't consider UX and design an optional extra when designing mobile apps for Android, how to tell an awesome app from a terrible app, and the basics of both designing and coding for the latest and greatest Android platform (Android 4.0 and beyond). Stylish apps aren't just for that other mobile platform, and Android is surprisingly easy to get started with.",
      "id":42
   },
   {
      "dtend":"20120717T170000",
      "dtstart":"20120717T133000",
      "dtstamp":"20120724T222001",
      "location":"Portland 255",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24257",
      "uid":"http://oscon.com/--s2012-07-17-13:30--24257",
      "summary":"Mastering Perl",
      "description":"Presented by Randal L. Schwartz (Stonehenge Consulting Services, Inc.), Peter Scott (Pacific Systems Design Technologies). In this tutorial, brian d foy will cover aspects of his latest book, Mastering Perl, which is practical advice for working programmers on creating enterprise-quality Perl programs",
      "id":43
   },
   {
      "dtend":"20120718T112000",
      "dtstart":"20120718T104000",
      "dtstamp":"20120726T040115",
      "location":"Portland 255",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24206",
      "uid":"http://oscon.com/--s2012-07-18-10:40--24206",
      "summary":"The Java EE 7 Platform: Developing for the Cloud",
      "description":"Presented by Arun Gupta (Oracle). This talk introduces the Java EE 7 platform, the latest revision of the Java platform for the enterprise.",
      "id":44
   },
   {
      "dtend":"20120718T121000",
      "dtstart":"20120718T113000",
      "dtstamp":"20120724T222758",
      "location":"Portland 255",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23939",
      "uid":"http://oscon.com/--s2012-07-18-11:30--23939",
      "summary":"Exploring Java 8 Technology",
      "description":"Presented by Martijn Verburg (jClarity), Ben Evans (jClarity). The speakers recently stumbled across a time machine containing a system built in Java 8 technology which has fallen back in time. This talk will explain some of the advanced features and future code archeology of this amazing find!",
      "id":45
   },
   {
      "dtend":"20120718T142000",
      "dtstart":"20120718T134000",
      "dtstamp":"20120731T202924",
      "location":"Portland 255",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23019",
      "uid":"http://oscon.com/--s2012-07-18-13:40--23019",
      "summary":"Above the Clouds: Introducing Akka",
      "description":"Presented by Jonas Bonér (Typesafe). This talk introduces the Akka platform. Akka is the platform for the next generation of event-driven, scalable and fault-tolerant architectures on the JVM.",
      "id":46
   },
   {
      "dtend":"20120718T151000",
      "dtstart":"20120718T143000",
      "dtstamp":"20120720T003753",
      "location":"Portland 255",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23361",
      "uid":"http://oscon.com/--s2012-07-18-14:30--23361",
      "summary":"Lightweight Web Apps with Ratpack",
      "description":"Presented by Tim Berglund (August Technology Group, LLC). Ratpack is a Groovy-based web framework inspired by Sinatra. This talk is an overview of Ratpack development paradigms, build idioms, and deployment options.",
      "id":47
   },
   {
      "dtend":"20120718T165000",
      "dtstart":"20120718T161000",
      "dtstamp":"20121009T111939",
      "location":"Portland 255",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24441",
      "uid":"http://oscon.com/--s2012-07-18-16:10--24441",
      "summary":"Concurrent Programming Using The Disruptor",
      "description":"Presented by Trisha Gee (10gen). The Disruptor is an open source concurrency framework developed by LMAX, a London financial exchange.  While it’s fashionable to use languages to hide away multithreading, the Disruptor does the opposite - enables developers to parallelize their architecture easily. In this session, Trisha Gee will show how to use the Disruptor, proving that concurrent programming doesn't have to be complicated.",
      "id":48
   },
   {
      "dtend":"20120718T174000",
      "dtstart":"20120718T170000",
      "dtstamp":"20120423T183300",
      "location":"Portland 255",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23434",
      "uid":"http://oscon.com/--s2012-07-18-17:00--23434",
      "summary":"Aparapi: An Open Source tool for extending the Java promise of ‘Write Once Run Anywhere’ to include the GPU",
      "description":"Presented by Gary Frost (AMD). Aparapi provides an API for expressing data parallel workloads in Java and a runtime capable of converting Java bytecode into OpenCL for execution on a GPU. For some data-parallel algorithms, executing on the GPU can offer substantial performance gains.   We will introduce Aparapi, demonstrate key features as well as discuss lessons learned during the transition from closed to open-source.",
      "id":49
   },
   {
      "dtend":"20120719T121000",
      "dtstart":"20120719T113000",
      "dtstamp":"20120725T175352",
      "location":"Portland 255",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24531",
      "uid":"http://oscon.com/--s2012-07-19-11:30--24531",
      "summary":"The Art of Metaprogramming in Java",
      "description":"Presented by Abdelmonaim Remani (The NorCal Java User Group). Metaprograming is the dirty little secret behind the success of many Java frameworks such as Spring and Struts2, and constitutes the backbone of many of the most fundamental APIs across the JEE technology stack. This session aims introduce the topic and highlight with code examples the different mechanisms and techniques to take advantage of this underused feature of the Java Programming Language.",
      "id":50
   },
   {
      "dtend":"20120719T142000",
      "dtstart":"20120719T134000",
      "dtstamp":"20120723T021209",
      "location":"Portland 255",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23505",
      "uid":"http://oscon.com/--s2012-07-19-13:40--23505",
      "summary":"Jython Concurrency: Leveraging the Java Platform with Python",
      "description":"Presented by Jim Baker (Canonical). Jython is arguably the best Python implementation to target concurrent code. Jython has no GIL, it leverages the Java platform to provide robust support for concurrency in its runtime, and it enables access to a set of high-level abstractions from Java. This talk will walk through a series of motivating examples that emphasize Java integration.",
      "id":51
   },
   {
      "dtend":"20120719T151000",
      "dtstart":"20120719T143000",
      "dtstamp":"20120721T170253",
      "location":"Portland 255",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23159",
      "uid":"http://oscon.com/--s2012-07-19-14:30--23159",
      "summary":"Threads & JRuby, the Simple Alternative to Evented",
      "description":"Presented by David Copeland (LivingSocial). Handling concurrency using events is getting a lot of focus  these days, however it's not without its tradeoffs.  By using powerful threading and concurrency libraries from the JVM, and the simple elegance of Ruby, developers can solve problems easily with maintainable and understandable code",
      "id":52
   },
   {
      "dtend":"20120719T165000",
      "dtstart":"20120719T161000",
      "dtstamp":"20120726T180111",
      "location":"Portland 255",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24513",
      "uid":"http://oscon.com/--s2012-07-19-16:10--24513",
      "summary":"Performance Tuning with Poor Tools and Cheap Drink",
      "description":"Presented by Kirk Pepperdine (Independent). After a brief introduction to a methodology to performance tune Java applications, the audience will guide me through the steps needed to tune an application using a number of \"poor\" (open source) tools that will be instrumental in helping you, the audience,  diagnose and repair these problems.",
      "id":53
   },
   {
      "dtend":"20120719T174000",
      "dtstart":"20120719T170000",
      "dtstamp":"20120725T051925",
      "location":"Portland 255",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23087",
      "uid":"http://oscon.com/--s2012-07-19-17:00--23087",
      "summary":"Troubleshooting Slow or Hung Java Applications",
      "description":"Presented by William Au (CBS Interactive). This session demonstrates how to troubleshoot the common problems that lead to hung and slow Java applications by going through case studies derived from actual problems we have seen on our production systems. Each case study is accompanied by a live demo of the tool best suited for troubleshooting that particular problem.",
      "id":54
   },
   {
      "dtend":"20120720T104000",
      "dtstart":"20120720T100000",
      "dtstamp":"20120724T222923",
      "location":"Portland 255",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23963",
      "uid":"http://oscon.com/--s2012-07-20-10:00--23963",
      "summary":"Kotlin: A Good Citizen on the Java Platform",
      "description":"Presented by Hadi Hariri (JetBrains). In this talk we demonstrate how easy it is to integrate Java and Kotlin in the same code base. You can keep all your java code and switch to Kotlin in the parts where you need conciseness, null-safety and enhanced APIs. We will cover Kotlin’s core features and enhancements to Java SDK: convenient (yet compatible) collection utilities, IO, String processing and much more.",
      "id":55
   },
   {
      "dtend":"20120720T114000",
      "dtstart":"20120720T110000",
      "dtstamp":"20121009T061624",
      "location":"Portland 255",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23187",
      "uid":"http://oscon.com/--s2012-07-20-11:00--23187",
      "summary":"Client/Server Apps with HTML5 and Java",
      "description":"Presented by James Ward (Typesafe). This session will teach you how to pull together jQuery, LESS, Twitter Bootstrap, Java, and Play Framework to build the Client/Server web app.  You will also learn how to deploy Client/Server web apps on the cloud using a Content Delivery Network (Amazon CloudFront) for the Client and a Cloud Application Provider (Heroku) for the Server.",
      "id":56
   },
   {
      "dtend":"20120720T123000",
      "dtstart":"20120720T115000",
      "dtstamp":"20120724T065625",
      "location":"Portland 255",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24329",
      "uid":"http://oscon.com/--s2012-07-20-11:50--24329",
      "summary":"Reducing Technical Debt in OpenJDK -- The Legacy and the Burden",
      "description":"Presented by Stuart Marks (Oracle). Like many projects, OpenJDK has technical debt. OpenJDK, being an implementation of the Java platform, bears a greater burden: evolving the platform makes its own implementation go out of date. It's an enormous effort to keep the JDK up to date with Java. This talk examines this kind of technical debt in OpenJDK and presents some paths toward mitigating it.",
      "id":57
   },
   {
      "dtend":"20120716T123000",
      "dtstart":"20120716T090000",
      "dtstamp":"20120728T194703",
      "location":"Portland 256",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23935",
      "uid":"http://oscon.com/--s2012-07-16-09:00--23935",
      "summary":"The Well-Grounded Java Developer",
      "description":"Presented by Martijn Verburg (jClarity), Ben Evans (jClarity). Based off the popular title 'The Well-Grounded Java Developer', this tutorial covers four major themes (Java 7, Functional programming, polyglot programming and modern concurrency) which we believe that all Well-Grounded Java developers should be aware of, and start practising to stay ahead of the game in 2012 and beyond.",
      "id":58
   },
   {
      "dtend":"20120716T170000",
      "dtstart":"20120716T133000",
      "dtstamp":"20120723T005008",
      "location":"Portland 256",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23410",
      "uid":"http://oscon.com/--s2012-07-16-13:30--23410",
      "summary":"Erlang Kung Fu in Three Hours",
      "description":"Presented by Garrett Smith (CloudBees). In the Matrix, the hero Neo learns Kung Fu in 30 seconds. But in the real world, it takes a three hour OSCON tutorial to master such a skill! In this tutorial, you'll learn what makes Erlang so powerful and how to use it to build your own scalable, fault tolerant distributed systems. At the end, you you'll wake up, turn to your friends and say, \"I know Erlang\".",
      "id":59
   },
   {
      "dtend":"20120717T123000",
      "dtstart":"20120717T090000",
      "dtstamp":"20120725T173810",
      "location":"Portland 256",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24214",
      "uid":"http://oscon.com/--s2012-07-17-09:00--24214",
      "summary":"An Introduction To Evented IO Programming In Node.JS , From The Experts",
      "description":"Presented by Rik Arends (Cloud9 IDE Inc), Bert Belder. Want to write Node.JS applications and want someone to show you the ropes? In this workshop we will go through a quick paced introduction to node.JS, and will introduce the basic principles of writing evented IO applications. For the more advanced developers it will be interactive on the depth of certain subjects.",
      "id":60
   },
   {
      "dtend":"20120717T170000",
      "dtstart":"20120717T133000",
      "dtstamp":"20120729T165707",
      "location":"Portland 256",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24084",
      "uid":"http://oscon.com/--s2012-07-17-13:30--24084",
      "summary":"State of the Art Web Mapping with Open Source",
      "description":"Presented by Dane Springmeyer (MapBox / Development Seed). Learn how to make beautiful, fast, and interactive maps for web and mobile using the latest open source tools. Technologies discussed will include Node.js, Mapnik, TileMill, MapBox, CartoDB, and TileStache. TileMill wil be the central tool used for hands-on learning. We will showcase how both technical and non-technical users can turn raw data into hosted and embeddable maps.",
      "id":61
   },
   {
      "dtend":"20120718T112000",
      "dtstart":"20120718T104000",
      "dtstamp":"20120808T154900",
      "location":"Portland 256",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23906",
      "uid":"http://oscon.com/--s2012-07-18-10:40--23906",
      "summary":"The Path to Go 1",
      "description":"Presented by Andrew Gerrand (Google), Rob Pike (Google, Inc.). Go 1 is a stable version of the Go Programming Language that will be supported for years to come. In this talk, Rob Pike and Andrew Gerrand outline the major highlights of the release and discuss the details behind some specific libraries and tools. They show that Go is not just a language, but a cohesive programming environment for producing high quality software.",
      "id":62
   },
   {
      "dtend":"20120718T121000",
      "dtstart":"20120718T113000",
      "dtstamp":"20120722T190516",
      "location":"Portland 256",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24069",
      "uid":"http://oscon.com/--s2012-07-18-11:30--24069",
      "summary":"C++11 as a new language",
      "description":"Presented by Thiago Macieira (Intel). The past 15 years have seen many languages be created to solve problems that languages before it couldn't solve or had not solved properly. In 2011, our old and familiar C and C++ languages received an upgrade: C11 and C++11. The changes to C++11 are so important it is almost a new language. This talk will present some of the most interesting changes aimed at making a developer's life easier.",
      "id":63
   },
   {
      "dtend":"20120718T142000",
      "dtstart":"20120718T134000",
      "dtstamp":"20120801T131225",
      "location":"Portland 256",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24243",
      "uid":"http://oscon.com/--s2012-07-18-13:40--24243",
      "summary":"Effective Code Review",
      "description":"Presented by Dan Menard (Netflix). Why don't more companies practice code review? We all know how beneficial it is, and we've all seen it's successes in open source. What's so hard about bringing it over to the world of commercial software development? Nothing! This is a success story about adopting code review from the open source community and applying it to commercial development. It worked for us. It can work for you too.",
      "id":64
   },
   {
      "dtend":"20120718T151000",
      "dtstart":"20120718T143000",
      "dtstamp":"20120801T131408",
      "location":"Portland 256",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23938",
      "uid":"http://oscon.com/--s2012-07-18-14:30--23938",
      "summary":"Modern Software Development Anti-patterns",
      "description":"Presented by Martijn Verburg (jClarity), Ben Evans (jClarity). Following on from a popular OSCON 2011 Ignite talk, the Diabolical Developer and Ben Evans (the voice of reason) returns with a full length presentation full of controversy and thought provoking material. In short, this session provides a wealth of tips and tricks to free you from the chains of so call 'modern software development best practices'.",
      "id":65
   },
   {
      "dtend":"20120718T165000",
      "dtstart":"20120718T161000",
      "dtstamp":"20120722T011758",
      "location":"Portland 256",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24042",
      "uid":"http://oscon.com/--s2012-07-18-16:10--24042",
      "summary":"Designing Hypermedia APIs",
      "description":"Presented by Steve Klabnik (Jumpstart Lab). In this talk, Steve will explain how to design your APIs so that they truly embrace the web and HTTP. Just as there's an impedance mismatch between our databases, our ORMs, and our models, there's an equal mismatch between our applications, our APIs, and our clients. Pros and cons of this approach will be discussed, as well as why more people aren't building APIs this way yet.",
      "id":66
   },
   {
      "dtend":"20120718T174000",
      "dtstart":"20120718T170000",
      "dtstamp":"20120801T172657",
      "location":"Portland 256",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23811",
      "uid":"http://oscon.com/--s2012-07-18-17:00--23811",
      "summary":"What Makes a Great Open API?",
      "description":"Presented by John Musser (ProgrammableWeb). If open APIs and open data are the new open source, then what makes a good API into a great API? This session is a deep-dive on helping you build better APIs. And designing an open API is a lot harder than it looks: protocols, data formats, optimizations, security, abstractions, and more.  This session draws on our experience at ProgrammableWeb where we've looked at over 5,000 different open APIs.",
      "id":67
   },
   {
      "dtend":"20120719T112000",
      "dtstart":"20120719T104000",
      "dtstamp":"20120727T160327",
      "location":"Portland 256",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24262",
      "uid":"http://oscon.com/--s2012-07-19-10:40--24262",
      "summary":"Dart: Google's evil plot to make it easier for you to build web apps",
      "description":"Presented by Bob Nystrom (Google). Creating a new programming language, especially one for the browser is crazy! Is this a nefarious plot to break the open web and take over the world? Come see what we're doing and I'll show you how Dart can make it easier and more fun to build apps that play nice with JS and the web.",
      "id":68
   },
   {
      "dtend":"20120719T121000",
      "dtstart":"20120719T113000",
      "dtstamp":"20120904T153044",
      "location":"Portland 256",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24203",
      "uid":"http://oscon.com/--s2012-07-19-11:30--24203",
      "summary":"Efficient Web Applications with Erlang and Cowboy",
      "description":"Presented by Loïc Hoguin (Nine Nines). Modern web services are expected to be capable of providing realtime services to a large number of concurrent connections from web browsers, and web API clients. Distributed systems are common. The fine grained concurrency, message oriented programming model and transparent distribution capabilities make Erlang well suited for these types of systems. Cowboy brings Erlang's power to the web.",
      "id":69
   },
   {
      "dtend":"20120719T142000",
      "dtstart":"20120719T134000",
      "dtstamp":"20120801T215255",
      "location":"Portland 256",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/25944",
      "uid":"http://oscon.com/--s2012-07-19-13:40--25944",
      "summary":"Behind The Mirror - the birth of Light Table.",
      "description":"Presented by Chris Granger (Kodowa). At Microsoft I had the unique opportunity to sit behind a one way mirror and watch people try to solve problems. Behind that mirror I learned we've done so very little to enable us to realize our creations and that our tools often cause us to stumble instead of propel us forward. In my talk we'll deconstruct what I learned to see how Light Table might be the future of tools.",
      "id":70
   },
   {
      "dtend":"20120719T151000",
      "dtstart":"20120719T143000",
      "dtstamp":"20120725T204145",
      "location":"Portland 256",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24097",
      "uid":"http://oscon.com/--s2012-07-19-14:30--24097",
      "summary":"On The Economics of Technical Debt",
      "description":"Presented by Abigail - (Booking.com). We will look into when it make sense to reduce technical debt, and when it does not.",
      "id":71
   },
   {
      "dtend":"20120719T165000",
      "dtstart":"20120719T161000",
      "dtstamp":"20120723T171511",
      "location":"Portland 256",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24849",
      "uid":"http://oscon.com/--s2012-07-19-16:10--24849",
      "summary":"Analyzing How Developers Learn Online For Fun and Profit",
      "description":"Presented by Keith Fahlgren (Safari Books Online). Modern developers use an ever-expanding set of online tools to help them solve problems, develop skills, and get their work done. Analyzing the usage data from one of these tools reveals a surprising amount about emerging technologies and how some developers are learning more effectively.",
      "id":72
   },
   {
      "dtend":"20120719T174000",
      "dtstart":"20120719T170000",
      "dtstamp":"20120724T224017",
      "location":"Portland 256",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23888",
      "uid":"http://oscon.com/--s2012-07-19-17:00--23888",
      "summary":"Generic Programming Galore using D",
      "description":"Presented by Andrei Alexandrescu (Facebook). The promises of generic programming – ultimate reuse, unprecedented flexibility, and low abstraction penalties - have been difficult to fulfill. This talk explores how a few difficult generic programming tasks can be realized in the D programming language.",
      "id":73
   },
   {
      "dtend":"20120720T104000",
      "dtstart":"20120720T100000",
      "dtstamp":"20120730T101427",
      "location":"Portland 256",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24404",
      "uid":"http://oscon.com/--s2012-07-20-10:00--24404",
      "summary":"Stop Mocking, Start Testing",
      "description":"Presented by Nathaniel Manista (Google), Augie Fackler (Google). Have you ever wished you could know early in a project's development which choices you were making that would later harm the project as it grows in longevity, scale, and complexity? We'll share with you how thanks to software architectural principles and testing discipline, and we'll share with you a few laughs as we relate the bumpy road we took on our way to finding out how ourselves.",
      "id":74
   },
   {
      "dtend":"20120720T114000",
      "dtstart":"20120720T110000",
      "dtstamp":"20120723T225702",
      "location":"Portland 256",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23899",
      "uid":"http://oscon.com/--s2012-07-20-11:00--23899",
      "summary":"Your Own Metric System",
      "description":"Presented by Ian Dees (Tektronix). Code metrics describe the properties of your source code: the patterns of test coverage, the complexity of individual parts, and so on. When used properly, they can shine a light into your project and help you make informed decisions. When abused, they can kill quality and teamwork. This talk discusses how to pragmatically apply common and ad-hoc measurements.",
      "id":75
   },
   {
      "dtend":"20120720T123000",
      "dtstart":"20120720T115000",
      "dtstamp":"20120720T192059",
      "location":"Portland 256",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24216",
      "uid":"http://oscon.com/--s2012-07-20-11:50--24216",
      "summary":"Learn Functional Programming by Implementing SQL with Underscore.js",
      "description":"Presented by Kris Jordan (New Media Campaigns). Have you tried learning functional programming but failed to find practical uses? In this session we will apply our knowledge of SQL to illuminate valuable uses of functional programming. Using underscore.js as a foundation, we will write a SQL DSL for querying arrays of objects. You will unearth ideas you've long known about functional programming and thoughts you've never considered about SQL.",
      "id":76
   },
   {
      "dtend":"20120716T123000",
      "dtstart":"20120716T090000",
      "dtstamp":"20120720T213617",
      "location":"D135",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24107",
      "uid":"http://oscon.com/--s2012-07-16-09:00--24107",
      "summary":"How to Organize and Fund Free Culture Projects",
      "description":"Presented by Kevin Shockey (Mis Tribus). With an infinite marketplace, every product must compete for resources and attention. Most projects turn into a resource management issue; how much do you have and how what do you use it on? One of the most successful ways to get the resources you need is to secure your own financing. This tutorial examines popular alternatives and gives free culture case-studies to identify best practices.",
      "id":77
   },
   {
      "dtend":"20120716T170000",
      "dtstart":"20120716T133000",
      "dtstamp":"20120817T190329",
      "location":"D135",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24368",
      "uid":"http://oscon.com/--s2012-07-16-13:30--24368",
      "summary":"Event Planning for Geeks",
      "description":"Presented by Christie Koehler (Mozilla / Stumptown Syndicate), Audrey Eschright (Elevated Code / Stumptown Syndicate), Sherri Montgomery (Open Source Bridge / Ignite Portland / Mentor Graphics). A fun, comprehensive tutorial on how to host a successful code sprint, hackathon, (un)conference or workshop.",
      "id":78
   },
   {
      "dtend":"20120717T123000",
      "dtstart":"20120717T090000",
      "dtstamp":"20120718T213937",
      "location":"D135",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23255",
      "uid":"http://oscon.com/--s2012-07-17-09:00--23255",
      "summary":"Blender: a 3D introduction",
      "description":"Presented by Oscar Baechler (Baechler Creative, LLC). Blender is a 3D animation suite that excels at every part of the animation pipeline, and has found its way into Hollywood blockbusters and AAA game titles. This introductory presentation will teach you 3D pipeline in a nutshell, followed by a hands-on demo where attendees can model, sculpt and render their first 3D project.",
      "id":79
   },
   {
      "dtend":"20120717T170000",
      "dtstart":"20120717T133000",
      "dtstamp":"20120718T064714",
      "location":"D135",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24217",
      "uid":"http://oscon.com/--s2012-07-17-13:30--24217",
      "summary":"Build Social and Personal Data Apps using the Open Source Singly Platform",
      "description":"Presented by Jeremie Miller (Singly), Thomas Muldowney (Singly). Learn how to build apps on a unified open source API combining data from Facebook, Twitter, Google, Github, Foursquare, Instagram, Tumblr, Linkedin, Fitbit, Wordpress, Runkeeper, Dropbox, and more, includes hands-on hack time to get a working dev environment up and running.",
      "id":80
   },
   {
      "dtend":"20120718T112000",
      "dtstart":"20120718T104000",
      "dtstamp":"20120729T190044",
      "location":"D135",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24393",
      "uid":"http://oscon.com/--s2012-07-18-10:40--24393",
      "summary":"Python 3: the Next Generation (is here already)",
      "description":"Presented by wesley chun (Google). An update from last year's well-received public service talk, we'll discuss the evolution of Python & answer common FAQs. There are those who worry that Python 3 is backwards-incompatible to Python 2. We address that issue, discuss what the main differences are, mention migration, the roles of 2.6/2.7 & other transition tools, and conclude with an update on what has been & yet needs to be ported.",
      "id":81
   },
   {
      "dtend":"20120718T121000",
      "dtstart":"20120718T113000",
      "dtstamp":"20120719T002646",
      "location":"D135",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24076",
      "uid":"http://oscon.com/--s2012-07-18-11:30--24076",
      "summary":"Writing a Django e-Commerce Framework",
      "description":"Presented by David Winterbottom (Tangent Labs). This talk details the challenges, frustations, horror and ultimately joy, of writing an open-source e-commerce framework in Django.",
      "id":82
   },
   {
      "dtend":"20120718T142000",
      "dtstart":"20120718T134000",
      "dtstamp":"20120728T042947",
      "location":"D135",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23369",
      "uid":"http://oscon.com/--s2012-07-18-13:40--23369",
      "summary":"Permission or Forgiveness?",
      "description":"Presented by Alex Martelli (Google), Anna Martelli Ravenscroft (Self). Grace Murray Hopper's famous motto, \"It's easier to ask forgiveness than permission\", has many useful applications -- in Python, in concurrency, in networking, as well of course as in real life. However, it's not universally valid. This talk explores both useful and damaging applications of this principle.",
      "id":83
   },
   {
      "dtend":"20120718T151000",
      "dtstart":"20120718T143000",
      "dtstamp":"20120720T213057",
      "location":"D135",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24245",
      "uid":"http://oscon.com/--s2012-07-18-14:30--24245",
      "summary":"Using Python to Solve Computationally Hard Problems",
      "description":"Presented by Rachael Madsen (Optimal Design Software LLC). The Traveling Salesman Problem is a classic example of an NP-Complete task that is much more difficult than it seems on the surface.  There are a number of algorithms available for solving it.  In this session, we will look at different options for implementing complex mathematics within Python.  We will evaluate the different options in relation to the specific algorithms used.",
      "id":84
   },
   {
      "dtend":"20120718T165000",
      "dtstart":"20120718T161000",
      "dtstamp":"20120727T043023",
      "location":"D135",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24332",
      "uid":"http://oscon.com/--s2012-07-18-16:10--24332",
      "summary":"Bootstrapping Django with Ease",
      "description":"Presented by Mike Biglan (Concentric Sky), M Wiggins (Concentric Sky), Josh Bothun (Concentric Sky). The underlying bootstrapping (i.e. \"startproject\") and environmental setup process in Django has remained mostly unchanged for many years. Djenesis decouples bootstrapping from Django while allowing a user to choose their template or setup an existing project. Just as important, it also sets beginners up with a smoother learning-curve and simplifies environmental setup.",
      "id":85
   },
   {
      "dtend":"20120718T174000",
      "dtstart":"20120718T170000",
      "dtstamp":"20120729T190903",
      "location":"D135",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24358",
      "uid":"http://oscon.com/--s2012-07-18-17:00--24358",
      "summary":"Moving from Apps to Services",
      "description":"Presented by Craig Kerstiens (Heroku). Django's unique app structure enables developers to break their application into functional units from the start of a project. The next step is to move from many Django apps in a single project to many services that talk across defined contracts and API's. We'll walk through practices for doing this and how Django enables it easily, but also the places it introduces complexities.",
      "id":86
   },
   {
      "dtend":"20120719T112000",
      "dtstart":"20120719T104000",
      "dtstamp":"20120728T043542",
      "location":"D135",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24030",
      "uid":"http://oscon.com/--s2012-07-19-10:40--24030",
      "summary":"Django doesn't scale! (And what you can do about it.)",
      "description":"Presented by Jacob Kaplan-Moss (Revolution Systems, LLC). You'll often hear that some web framework \"doesn't scale\". Well, it's true! Django, like all web frameworks. offers a ton of shortcuts for common cases, but as sites grow these shortcuts come at the cost of performance. However, you don't have to throw the baby out with the bathwater; come to this talk to hear how you can win back performance while hanging on to the framework you love.",
      "id":87
   },
   {
      "dtend":"20120719T121000",
      "dtstart":"20120719T113000",
      "dtstamp":"20120723T220549",
      "location":"D135",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24099",
      "uid":"http://oscon.com/--s2012-07-19-11:30--24099",
      "summary":"Large Django sites at Mozilla",
      "description":"Presented by Andy McKay (Mozilla). Mozilla's add-ons site serves a few billion hits a day through Python. This talk covers how the site is built, how it scales, the fun we had on the way and tools that you can use from it.",
      "id":88
   },
   {
      "dtend":"20120719T142000",
      "dtstart":"20120719T134000",
      "dtstamp":"20120722T131923",
      "location":"D135",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24058",
      "uid":"http://oscon.com/--s2012-07-19-13:40--24058",
      "summary":"Python += Women: Increasing Engagement",
      "description":"Presented by Lynn Root (PyLadies SF). Are you a woman wanting to break into the engineering field?  Or do you know any women wanting to learn how to code, but don't know how to help them?  Perhaps our nerdy ladies are a bit shy to ask for help. That's okay!  I'll give you some tools to nudge you in the right direction.",
      "id":89
   },
   {
      "dtend":"20120719T151000",
      "dtstart":"20120719T143000",
      "dtstamp":"20120729T233701",
      "location":"D135",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24416",
      "uid":"http://oscon.com/--s2012-07-19-14:30--24416",
      "summary":"Connecting to Twitter & Google+ using Python",
      "description":"Presented by wesley chun (Google). Twitter and Google+ are examples of the highly active and popular social media scene today. Using Python, you can easily execute searches on both. All you need is a client library (easily found), and you can get going without a lot of effort!",
      "id":90
   },
   {
      "dtend":"20120719T165000",
      "dtstart":"20120719T161000",
      "dtstamp":"20120724T064358",
      "location":"D135",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24328",
      "uid":"http://oscon.com/--s2012-07-19-16:10--24328",
      "summary":"Demystifying Python Metaclasses",
      "description":"Presented by Eric Wills (University of Oregon/Vizme). Metaclasses are a commonly misunderstood and misrepresented topic in Python. This session will introduce metaclasses, explore the added functionality they provide, and look at some real world examples of metaclasses as we use them in server-side web development at Vizme.",
      "id":91
   },
   {
      "dtend":"20120719T174000",
      "dtstart":"20120719T170000",
      "dtstamp":"20120729T192615",
      "location":"D135",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24387",
      "uid":"http://oscon.com/--s2012-07-19-17:00--24387",
      "summary":"Inside Python",
      "description":"Presented by Thomas Lee (New Relic). Ever wondered how you might experiment with your own syntax changes to the Python programming language? Learn about the internals of Python as I dissect the steps required to introduce a new keyword to the language.",
      "id":92
   },
   {
      "dtend":"20120720T104000",
      "dtstart":"20120720T100000",
      "dtstamp":"20120724T140448",
      "location":"D135",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23851",
      "uid":"http://oscon.com/--s2012-07-20-10:00--23851",
      "summary":"Does Crime Pay? Tackling Organized Crime With Big Data and Algorithms",
      "description":"Presented by Bill Fox J.D., M.A.  (LexisNexis), Jo Prichard (LexisNexis Risk Solutions). In this session, two case studies will be presented on leveraging Big Data and an open source Big Data processing platform to detect relationships at levels not previously detected. This session will give a behind-the-scenes look at how to program rapid data delivery queries with Big Data to solve real world problems along with anecdotal examples from the field.",
      "id":93
   },
   {
      "dtend":"20120720T114000",
      "dtstart":"20120720T110000",
      "dtstamp":"20120404T213936",
      "location":"D135",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23987",
      "uid":"http://oscon.com/--s2012-07-20-11:00--23987",
      "summary":"GNU MediaGoblin for a beautiful media hosting future on the web",
      "description":"Presented by Christopher Webber (Creative Commons). MediaGoblin is a decentralized, extensible, and forward-looking free software media hosting system (and includes cool features like HTML5 video hosting).  Hear about the state of the project, why decentralized media hosting matters, lessons learned from organizing the community, and why this is an important direction for the GNU project and free and open source software to head.",
      "id":94
   },
   {
      "dtend":"20120720T123000",
      "dtstart":"20120720T115000",
      "dtstamp":"20120727T155305",
      "location":"D135",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26469",
      "uid":"http://oscon.com/--s2012-07-20-11:50--26469",
      "summary":"OSCON Town Hall",
      "description":"Presented by Edd Dumbill (Silicon Valley Data Science), Sarah Novotny (Meteor Entertainment), Gina Blaber (O'Reilly Media, Inc.). OSCON belongs to its attendees, and we want to hear what you think of this year’s show. Join the organizers to talk about what you loved and hated about OSCON, and what you’d like to see next year.",
      "id":95
   },
   {
      "dtend":"20120718T200000",
      "dtstart":"20120718T190000",
      "dtstamp":"20120723T045947",
      "location":"D135",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/25096",
      "uid":"http://oscon.com/--s2012-07-18-19:00--25096",
      "summary":"PostgreSQL",
      "description":"Meet and greet members of the Portland PostgreSQL Users Group, and also talk about PostgreSQL.",
      "id":96
   },
   {
      "dtend":"20120719T200000",
      "dtstart":"20120719T190000",
      "dtstamp":"20120729T233713",
      "location":"D135",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/25806",
      "uid":"http://oscon.com/--s2012-07-19-19:00--25806",
      "summary":"SourceForge: Apache Allura (Incubating) and the future of SourceForge",
      "description":"With Allura, our forge software, entering the Apache Incubator, we're excited about the future. Come see what we're excited about.",
      "id":97
   },
   {
      "dtend":"20120716T200000",
      "dtstart":"20120716T190000",
      "dtstamp":"20120718T212414",
      "location":"D135",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26248",
      "uid":"http://oscon.com/--s2012-07-16-19:00--26248",
      "summary":"Google Summer of Code BoF",
      "description":"Birds of a Feather session for Google Summer of Code alumni, students, mentors, org admins, and just those interested in the program!",
      "id":98
   },
   {
      "dtend":"20120718T210000",
      "dtstart":"20120718T200000",
      "dtstamp":"20120719T155535",
      "location":"D135",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26505",
      "uid":"http://oscon.com/--s2012-07-18-20:00--26505",
      "summary":"HFOSS @ OSCON",
      "description":"Meet and brain with the Humanitarian Free Open Source Software (HFOSS) community at OSCON. We are a growing, diverse global network of of communities, organizations and companies that aim to use technology for social good.",
      "id":99
   },
   {
      "dtend":"20120719T210000",
      "dtstart":"20120719T200000",
      "dtstamp":"20120713T005813",
      "location":"D135",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26527",
      "uid":"http://oscon.com/--s2012-07-19-20:00--26527",
      "summary":"MariaDB BoF",
      "description":"MariaDB has been regularly touted as the New M in LAMP. An offshoot of the popular MySQL database, made by the same person that brought you MySQL, come see the successes and new features that MariaDB has brought in the last 2+ years, and help define the future roadmap. It is worth noting that no MariaDB BoF is complete without some black vodka!",
      "id":100
   },
   {
      "dtend":"20120716T123000",
      "dtstart":"20120716T090000",
      "dtstamp":"20120821T001507",
      "location":"D136",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23117",
      "uid":"http://oscon.com/--s2012-07-16-09:00--23117",
      "summary":"A Sip of CoffeeScript",
      "description":"Presented by Gregg Pollack (Envy Labs), Carlos Souza (Envy Labs). If you enjoy writing JavaScript then you'll really enjoy CoffeeScript, a new language which transcompiles into CoffeeScript. Inspired by languages like Ruby, Python, and Haskell, it allows you to write less code to get more done. In this course students will learn the basics of CoffeeScript using the Code School in-browser challenge engine.",
      "id":101
   },
   {
      "dtend":"20120716T170000",
      "dtstart":"20120716T133000",
      "dtstamp":"20120801T204910",
      "location":"D136",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23276",
      "uid":"http://oscon.com/--s2012-07-16-13:30--23276",
      "summary":"Presentation Aikido",
      "description":"Presented by Damian Conway (Thoughtstream). The class explores seven basic principles of good presentation, covering preparation, content selection, delivery techniques, and handling questions (or the lack thereof). It also explores a dozen simple and practical techniques for making your slides not suck.",
      "id":102
   },
   {
      "dtend":"20120717T123000",
      "dtstart":"20120717T090000",
      "dtstamp":"20120731T202657",
      "location":"D136",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24005",
      "uid":"http://oscon.com/--s2012-07-17-09:00--24005",
      "summary":"Computing with Clojure",
      "description":"Presented by Alan Dipert (Relevance, Inc.), Clinton N. Dreisbach (Relevance, Inc.). Clojure is a general-purpose language with direct support for Java, a modern Lisp dialect, and support in both the language and data structures for functional programming. Learn Clojure and you'll become a better all-around programmer. You'll also be able to write applications that have the beauty and elegance of a good scripting language and the power and reach of the JVM.",
      "id":103
   },
   {
      "dtend":"20120717T170000",
      "dtstart":"20120717T133000",
      "dtstamp":"20120721T002516",
      "location":"D136",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24799",
      "uid":"http://oscon.com/--s2012-07-17-13:30--24799",
      "summary":"Build A Better Team With Improv",
      "description":"Presented by Wade Minter (TeamSnap), Mark Cornick (TeamSnap), Emily Dobervich (TeamSnap). Getting everyone in your company or development team on the same page can be a challenge. Back for a second year, this on-your-feet workshop will teach fast, fun improv techniques for helping your group to bond as a team. Learn the secrets of improv-based team building from two professionals who have decades of experience working in open source, Internet start-ups and corporate training.",
      "id":104
   },
   {
      "dtend":"20120718T112000",
      "dtstart":"20120718T104000",
      "dtstamp":"20120729T140730",
      "location":"D136",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23819",
      "uid":"http://oscon.com/--s2012-07-18-10:40--23819",
      "summary":"Perl 5: Today, Tomorrow, and Christmas",
      "description":"Presented by Ricardo Signes (Pobox.com). In this session, Ricardo Signes (rjbs), the Perl 5 project lead, will discuss the future of the Perl language, the guiding principles of its ongoing design, and the specific changes toward which the Perl 5 Porters are working. It will also describe the way Perl 5 development really happens, how that is changing, and what we might want it to become.",
      "id":105
   },
   {
      "dtend":"20120718T121000",
      "dtstart":"20120718T113000",
      "dtstamp":"20120723T045530",
      "location":"D136",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24202",
      "uid":"http://oscon.com/--s2012-07-18-11:30--24202",
      "summary":"Programming in the Future",
      "description":"Presented by Eric Wilhelm (Sourcefire, Inc.). How does programming change and what will it be like in 25 years when you take your flying car to the office?  Do the past 25 years of Perl give us enough perspective to see 25 years into the future?  We'll look at recent progress, new features, and see how you can use a deeper knowledge of the inner workings to revolutionize your approach solving problems today.",
      "id":106
   },
   {
      "dtend":"20120718T142000",
      "dtstart":"20120718T134000",
      "dtstamp":"20120723T173618",
      "location":"D136",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23513",
      "uid":"http://oscon.com/--s2012-07-18-13:40--23513",
      "summary":"Profiling memory usage of Perl applications",
      "description":"Presented by Tim Bunce (TigerLead). Why is my process using that much memory? Is there a memory leak, and if so where is it? In this talk I'll show you how to find answers to these questions and more.",
      "id":107
   },
   {
      "dtend":"20120718T151000",
      "dtstart":"20120718T143000",
      "dtstamp":"20120724T225834",
      "location":"D136",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23528",
      "uid":"http://oscon.com/--s2012-07-18-14:30--23528",
      "summary":"Introduction to Git for the Perl Hacker",
      "description":"Presented by Mark Allen (Mark Allen). For many Perl programmers, using git is a bit of a black box. This talk hopes to bring some clarity around the rather unintuitive interface of the git distributed version control system. The talk is geared for git beginners, primarily, although some of the content may be interesting to people who are comfortable with the basic git workflow of \"add, commit, push.\"",
      "id":108
   },
   {
      "dtend":"20120718T165000",
      "dtstart":"20120718T161000",
      "dtstamp":"20120402T222202",
      "location":"D136",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24815",
      "uid":"http://oscon.com/--s2012-07-18-16:10--24815",
      "summary":"The O'Reilly Author Experience",
      "description":"Presented by Matt Neuburg (TidBITS). The process of writing, editing, and publishing an O'Reilly programming book has been tending increasingly into the open source domain, relying on open source tools and technologies. This talk describes one author's experience, along with considerations about the possible future of the book in an increasingly open source world.",
      "id":109
   },
   {
      "dtend":"20120718T174000",
      "dtstart":"20120718T170000",
      "dtstamp":"20120728T194732",
      "location":"D136",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23271",
      "uid":"http://oscon.com/--s2012-07-18-17:00--23271",
      "summary":"The Conway Channel",
      "description":"Presented by Damian Conway (Thoughtstream). Who knows what evil lurks in the heart of Perl? The Damian knows!",
      "id":110
   },
   {
      "dtend":"20120719T112000",
      "dtstart":"20120719T104000",
      "dtstamp":"20120722T235004",
      "location":"D136",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23817",
      "uid":"http://oscon.com/--s2012-07-19-10:40--23817",
      "summary":"What's New in Perl?",
      "description":"Presented by Ricardo Signes (Pobox.com). Ricardo Signes (rjbs), the Perl 5 project lead, will tell you about all the changes in Perl 5.10 through 5.16 that will affect your daily life, with a focus on things you should and shouldn't use.",
      "id":111
   },
   {
      "dtend":"20120719T121000",
      "dtstart":"20120719T113000",
      "dtstamp":"20120728T194738",
      "location":"D136",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23270",
      "uid":"http://oscon.com/--s2012-07-19-11:30--23270",
      "summary":"Taming Perl Regexes",
      "description":"Presented by Damian Conway (Thoughtstream). Perl regexes are the wolverines of the programming world: compact, immensely powerful, and with a nasty tendency to maul you, when and where you least expect it. This talk demonstrates and explains a new Perl module (Regexp::Debugger) that helps tame unruly regexes by providing live interactive run-time visualizations of any regex in your code, as that regex matches.",
      "id":112
   },
   {
      "dtend":"20120719T142000",
      "dtstart":"20120719T134000",
      "dtstamp":"20120729T141712",
      "location":"D136",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23404",
      "uid":"http://oscon.com/--s2012-07-19-13:40--23404",
      "summary":"Writing Non-blocking Code for Interaction With Data Systems and Web Services in Node.js and Perl",
      "description":"Presented by Jay Janssen (Percona, Inc.). Illustrated guide to how to write non-blocking code for Perl (and some Javascript).  Goal for this session is to give some familiarity to high-level non-blocking APIs for engineers who want to dig into non-blocking programming.",
      "id":113
   },
   {
      "dtend":"20120719T151000",
      "dtstart":"20120719T143000",
      "dtstamp":"20120728T043747",
      "location":"D136",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23787",
      "uid":"http://oscon.com/--s2012-07-19-14:30--23787",
      "summary":"YARRR! Plundering Programming Paradigms for Profit!",
      "description":"Presented by Piers Cawley (Thermeon). Avast ye scurvy dogs! Strap yerselves in fer a pirate voyage around the islands of code! Feast yer eyes on the treasures of the mystic land of Haskell, the thifthing thands of lithp. Gasp at beautiful objects from Smalltalk and develop an eye for plundering programming pearls wherever you find 'em. Then bring 'em all back to the good ship 'Black Perl' use 'em for fun and profit. YARRR!",
      "id":114
   },
   {
      "dtend":"20120719T165000",
      "dtstart":"20120719T161000",
      "dtstamp":"20120724T012049",
      "location":"D136",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23885",
      "uid":"http://oscon.com/--s2012-07-19-16:10--23885",
      "summary":"Cooking Perl with Chef",
      "description":"Presented by David Golden (Bunchmail). Do you like the idea of repeatable, automated Perl application deployment?  Me, too! This talk will show how to make Chef play nice with Perl.  You'll learn how to weave together some great tools like perlbrew, local::lib, and carton to isolate your apps and manage them all with Chef.",
      "id":115
   },
   {
      "dtend":"20120719T174000",
      "dtstart":"20120719T170000",
      "dtstamp":"20120728T194752",
      "location":"D136",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24252",
      "uid":"http://oscon.com/--s2012-07-19-17:00--24252",
      "summary":"Unicode Support Shootout: The Good, the Bad, the Mostly Ugly",
      "description":"Presented by Tom Christiansen (TCPC). How does Unicode support stack up across major platforms, including Java, Perl, Python, Ruby, and more? Who’s doing the best job, and who’s failing miserably? Is anyone doing a good job? Does anyone actually implement to standard, and to what extent? I’ll compare the major platforms to separate the losers from the not-so-losers.",
      "id":116
   },
   {
      "dtend":"20120720T104000",
      "dtstart":"20120720T100000",
      "dtstamp":"20120724T224149",
      "location":"D136",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23968",
      "uid":"http://oscon.com/--s2012-07-20-10:00--23968",
      "summary":"Using and Building Open Source in Google Corporate Engineering",
      "description":"Presented by Justin McWilliams (Google). Google makes extensive use of open source software in running Google - both making use and contributing back to that.  By using and contributing to open source software, we have been able to fundamentally change how managing an enterprise-size work force and their computing needs.",
      "id":117
   },
   {
      "dtend":"20120720T114000",
      "dtstart":"20120720T110000",
      "dtstamp":"20120725T005237",
      "location":"D136",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23510",
      "uid":"http://oscon.com/--s2012-07-20-11:00--23510",
      "summary":"Orion: Development Tools for the Web, on the Web",
      "description":"Presented by Wayne Beaton (The Eclipse Foundation), Susan McCourt (IBM). Orion is a browser-based open tool integration platform: tools are written in JavaScript and run in the browser. Unlike other attempts at creating browser-based development tools, this is not an IDE running in a single tab. Links work and can be shared. You can open a file in a new tab. Great care has been taken to provide a web experience for development.",
      "id":118
   },
   {
      "dtend":"20120720T123000",
      "dtstart":"20120720T115000",
      "dtstamp":"20120724T012227",
      "location":"D136",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23601",
      "uid":"http://oscon.com/--s2012-07-20-11:50--23601",
      "summary":"Routine Testing in Perl",
      "description":"Presented by Piers Cawley (Thermeon). Moose! Testing! Isolation! All fine things to have when writing code, but it's all to easy for the goodness of Moose to stop short when you change directory from ./lib to ./t. RJBS's fabulous Test::Routine brings all the goodness of Moose into your tests as well, and in this session, I'll show you how to use it. RJBS would do it, but he's busy pumpkinging.",
      "id":119
   },
   {
      "dtend":"20120718T200000",
      "dtstart":"20120718T190000",
      "dtstamp":"20120614T170825",
      "location":"D136",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/25275",
      "uid":"http://oscon.com/--s2012-07-18-19:00--25275",
      "summary":"MySQL Birds of a Feather",
      "description":"MySQL is the most popular database on the web this BOF is for those who use MySQL, want to use MySQL, are seeking to network with other MySQL professionals, or just hear the latest news about MySQL.  Last year's MySQL BOF was lively, well attended, and featured many famous names from the MySQL community.  Come join us, talk MySQL, and make new friends.",
      "id":120
   },
   {
      "dtend":"20120719T200000",
      "dtstart":"20120719T190000",
      "dtstamp":"20120611T212939",
      "location":"D136",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26104",
      "uid":"http://oscon.com/--s2012-07-19-19:00--26104",
      "summary":"Brackets - An open source code editor for the web",
      "description":"Brackets is an open source code editor for the web written in JavaScript, HTML and CSS. Join a discussion with members of the Brackets team and learn how you can contribute to this active and exciting project. We can build a better editor. http://github.com/adobe/brackets",
      "id":121
   },
   {
      "dtend":"20120716T200000",
      "dtstart":"20120716T190000",
      "dtstamp":"20120717T151457",
      "location":"D136",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26484",
      "uid":"http://oscon.com/--s2012-07-16-19:00--26484",
      "summary":"the Programmers Cloud",
      "description":"Join Josh Long of SpringSource, a division of VMware to talk about the issues surrounding cloud adoption facing modern day programmers.",
      "id":122
   },
   {
      "dtend":"20120718T210000",
      "dtstart":"20120718T200000",
      "dtstamp":"20120711T195244",
      "location":"D136",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26509",
      "uid":"http://oscon.com/--s2012-07-18-20:00--26509",
      "summary":"Sphinx: Full-Text Search Alternative to MySQL - Peter Zaitsev/Percona",
      "description":"Database backed Full-Text Search (MySQL) and why companies like Craigslist, LivingSocial, and Boardreader from a technical perspective have chosen to utilize Sphinx.",
      "id":123
   },
   {
      "dtend":"20120716T123000",
      "dtstart":"20120716T090000",
      "dtstamp":"20120725T173746",
      "location":"D137-138",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24034",
      "uid":"http://oscon.com/--s2012-07-16-09:00--24034",
      "summary":"Introduction to Django",
      "description":"Presented by Jacob Kaplan-Moss (Revolution Systems, LLC). Django is a high-level web development framework designed for rapid development of database-backed web sites. This tutorial is designed to introduce developers to Django. It will take attendees from a blank screen to a fully-functional web application. I'll cover all the basics you need to know to get started with Django.",
      "id":124
   },
   {
      "dtend":"20120716T170000",
      "dtstart":"20120716T133000",
      "dtstamp":"20120808T232324",
      "location":"D137-138",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24350",
      "uid":"http://oscon.com/--s2012-07-16-13:30--24350",
      "summary":"Scala Koans",
      "description":"Presented by Daniel Hinojosa (evolutionnext.com), Dianne Marsh (Netflix). Koans are small Zen lessons, Scala Koans are small Zen lessons -- in Scala! Koans, as little exercises, are designed to provide tidbits of knowledge that when bundled together provide an in-depth understanding,  Each Koan comes complete with their own little epiphanies of joy. Scala Koans have been a favorite for developers  helping them make their path to Scala Nirvana. (laptop required)",
      "id":125
   },
   {
      "dtend":"20120717T123000",
      "dtstart":"20120717T090000",
      "dtstamp":"20120723T172848",
      "location":"D137-138",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23941",
      "uid":"http://oscon.com/--s2012-07-17-09:00--23941",
      "summary":"Get Started with the Arduino - A Hands-On Introductory Workshop (SOLD OUT)",
      "description":"Presented by Philip Lindsay (rancidbacon.com). Have you always wanted to create hardware devices to interact with the real world? Heard about the Arduino electronics prototyping platform but not sure how to get started? When you attend this workshop you will: set up an Arduino board & software; learn how the Arduino fits into the field of physical computing; and make your Arduino respond to button presses and blink lights. Hardware is fun!",
      "id":126
   },
   {
      "dtend":"20120717T170000",
      "dtstart":"20120717T133000",
      "dtstamp":"20120722T221905",
      "location":"D137-138",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24068",
      "uid":"http://oscon.com/--s2012-07-17-13:30--24068",
      "summary":"Connecting iOS to the open source world with Arduino",
      "description":"Presented by Alasdair Allan (Babilim Light Industries). This tutorial will walk you through connecting an iPhone, iPod touch or iPad to an Arduino or other external hardware using an RS-232 adaptor. This is hardware hacking for iOS developers. You'll learn how to build iOS applications that talk to the real world, talk to sensors that talk back, and make iOS part of the Internet of Things.",
      "id":127
   },
   {
      "dtend":"20120716T200000",
      "dtstart":"20120716T190000",
      "dtstamp":"20120717T151222",
      "location":"D137-138",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26448",
      "uid":"http://oscon.com/--s2012-07-16-19:00--26448",
      "summary":"Becoming a Node.js Ninja on VMware's Cloud Foundry PaaS",
      "description":"Learn about internal workings of Node.js & buzz around Node.js. Also learn about basics of VMware Cloud Foundry PaaS and how to run 4 different kinds of sample Node.js apps on Cloud Foundry",
      "id":128
   },
   {
      "dtend":"20120716T123000",
      "dtstart":"20120716T090000",
      "dtstamp":"20120723T140212",
      "location":"D139-140",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24299",
      "uid":"http://oscon.com/--s2012-07-16-09:00--24299",
      "summary":"How to Design for the Future - Cross Channel Experience Design",
      "description":"Presented by Samantha Starmer (REI, Recreational Equipment, Inc.). The future of design is everywhere a user touches our product or service—digital or physical. Web and other digital practitioners must move beyond the screen to designing a holistic customer experience that is seamless across channels and devices. In this interactive workshop, Samantha will provide specific tools  for designing for a full experience lifecycle across all channels and touchpoints.",
      "id":129
   },
   {
      "dtend":"20120716T170000",
      "dtstart":"20120716T133000",
      "dtstamp":"20120926T164016",
      "location":"D139-140",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23484",
      "uid":"http://oscon.com/--s2012-07-16-13:30--23484",
      "summary":"Integrating PHP Projects with Jenkins",
      "description":"Presented by Sebastian Bergmann (thePHP.cc). Today's web applications require frequent updates, not just by adding or upgrading its features, but by maintaining and improving the software's existing code base. This tutorial teaches PHP developers how to use Jenkins, the popular continuous integration server, to monitor various aspects of software quality through continuous integration and continuous inspection.",
      "id":130
   },
   {
      "dtend":"20120717T123000",
      "dtstart":"20120717T090000",
      "dtstamp":"20120723T020156",
      "location":"D139-140",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24131",
      "uid":"http://oscon.com/--s2012-07-17-09:00--24131",
      "summary":"JavaFX 2 - A Java Developer's Guide",
      "description":"Presented by Stephen Chin (Oracle). This session will introduce you to the JavaFX 2 platform from the perspective of a seasoned Java developer. The breadth of JavaFX APIs will be explained through several examples that we will build out during the course of the session.",
      "id":131
   },
   {
      "dtend":"20120717T170000",
      "dtstart":"20120717T133000",
      "dtstamp":"20120725T173047",
      "location":"D139-140",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24366",
      "uid":"http://oscon.com/--s2012-07-17-13:30--24366",
      "summary":"Preventing Runtime Errors at Compile Time",
      "description":"Presented by Michael Ernst (University of Washington), Werner Dietl (University of Washington). Are you tired of null pointer exceptions, SQL injections, concurrency errors, mistaken equality tests, and other run-time errors? A compile-time tool named the Checker Framework has found hundreds of such errors in Java code.  Come learn how you can use the tool to improve your own code.  For those who don't use Java, we will explain the concept of pluggable type-checking that underlies the tool.",
      "id":132
   },
   {
      "dtend":"20120718T112000",
      "dtstart":"20120718T104000",
      "dtstamp":"20120801T130949",
      "location":"D139-140",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24376",
      "uid":"http://oscon.com/--s2012-07-18-10:40--24376",
      "summary":"Comparing Open Source Private Cloud Platforms",
      "description":"Presented by Lance Albertson (Oregon State University Open Source Lab). Private cloud computing has become an integral part of global business. While each platform provides a way for virtual machines to be deployed, implementations vary widely. It can be difficult to determine which features are right for your needs. This session will discuss the top open source private cloud platforms and provide analysis on which one is the best fit for you.",
      "id":133
   },
   {
      "dtend":"20120718T121000",
      "dtstart":"20120718T113000",
      "dtstamp":"20120721T184218",
      "location":"D139-140",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23566",
      "uid":"http://oscon.com/--s2012-07-18-11:30--23566",
      "summary":"Highly Available Cloud: OpenStack integration with Pacemaker",
      "description":"Presented by Florian Haas (hastexo). An introduction to high availability for the OpenStack cloud stack, using the Pacemaker cluster management framework.",
      "id":134
   },
   {
      "dtend":"20120718T142000",
      "dtstart":"20120718T134000",
      "dtstamp":"20120723T160750",
      "location":"D139-140",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23280",
      "uid":"http://oscon.com/--s2012-07-18-13:40--23280",
      "summary":"Apache HTTPD 2.4.0: Watch out cloud!",
      "description":"Presented by Jim Jagielski (ASF). With its latest release (2.4.0), Apache httpd is ideally suited for the cloud, both in performance and capability. See what enhancements have been made so that you can also take advantage of Apache 2.4.0.",
      "id":135
   },
   {
      "dtend":"20120718T151000",
      "dtstart":"20120718T143000",
      "dtstamp":"20120808T155311",
      "location":"D139-140",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24190",
      "uid":"http://oscon.com/--s2012-07-18-14:30--24190",
      "summary":"Apache ZooKeeper in Action",
      "description":"Presented by Mahadev Konar (Hortonworks). This talk will include a  review of the breadth of ZooKeeper features and use cases in  low latency systems like ad platforms, high latency WAN environment and high throughput deployments. The talk will also include the future roadmap for ZooKeeper.",
      "id":136
   },
   {
      "dtend":"20120718T165000",
      "dtstart":"20120718T161000",
      "dtstamp":"20120728T105436",
      "location":"D139-140",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23530",
      "uid":"http://oscon.com/--s2012-07-18-16:10--23530",
      "summary":"One-man ops; deploying at scale in EC2 while letting you sleep through the night",
      "description":"Presented by Jos Boumans (Krux Digital). Using the AWS infrastructure, affordable third party services and solid Open Source Software, this talk will focus on setting up a solid operations environment and practice that will scale with your site.",
      "id":137
   },
   {
      "dtend":"20120718T174000",
      "dtstart":"20120718T170000",
      "dtstamp":"20120403T041645",
      "location":"D139-140",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24230",
      "uid":"http://oscon.com/--s2012-07-18-17:00--24230",
      "summary":"Programming with the OSS Cloud Stack",
      "description":"Presented by Mike Amundsen (Layer 7 Technologies). The \"cloud stack\" development environment—one that lets you not just build cloud-based app for the web, but actually build them while on the Web—is a reality. Using open source, standardized software and management tools, it’s now possible to code, test, debug, and deploy web based solutions; all from a modern browser.",
      "id":138
   },
   {
      "dtend":"20120719T112000",
      "dtstart":"20120719T104000",
      "dtstamp":"20120720T152630",
      "location":"D139-140",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24309",
      "uid":"http://oscon.com/--s2012-07-19-10:40--24309",
      "summary":"Thinking Big: Building a IaaS SDK for the Cloud",
      "description":"Presented by Randi Harper (Amazon), Mitch Garnaat (Amazon). More and more companies, large and small,  are using open source software.  Sometimes, in addition to just using the software they also want to try to support the development efforts.  How hard could that be?",
      "id":139
   },
   {
      "dtend":"20120719T121000",
      "dtstart":"20120719T113000",
      "dtstamp":"20120725T052221",
      "location":"D139-140",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24035",
      "uid":"http://oscon.com/--s2012-07-19-11:30--24035",
      "summary":"Building GoDaddy.com’s Compute Cloud",
      "description":"Presented by Darren Shepherd (GoDaddy.com). Learn how GoDaddy.com built its Cloud Computing IaaS product with a team of less than 10 people.  See how we leveraged open source and existing technologies to accelerate our development, what worked, and what didn’t.  Learn how we built a reliable infrastructure on top of non-reliable messaging and an eventually consistent model using Redis, Apache CouchDB, Node.js, and Apache ZooKeeper.",
      "id":140
   },
   {
      "dtend":"20120719T142000",
      "dtstart":"20120719T134000",
      "dtstamp":"20120724T173412",
      "location":"D139-140",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23350",
      "uid":"http://oscon.com/--s2012-07-19-13:40--23350",
      "summary":"When Cloud Networking meets Cloud Computing: Software-Defined   Networking (SDN)",
      "description":"Presented by Mike Cohen (Big Switch Networks), Faan DeSwardt (Symantec). SDN is the promise of bringing comparable programmability to the network by abstracting a logical view from the underlying infrastructure for more agility, flexibility, scalability but also for more innovation, looking at networks in a new way and allowing for better synergies with applications running on it. 2012 is poised to be a pivotal year with production deployments, new players and more.",
      "id":141
   },
   {
      "dtend":"20120719T151000",
      "dtstart":"20120719T143000",
      "dtstamp":"20120803T171334",
      "location":"D139-140",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24212",
      "uid":"http://oscon.com/--s2012-07-19-14:30--24212",
      "summary":"A Look at The Network: Searching for Truth in Distributed Applications",
      "description":"Presented by Scott Andreas (Boundary, Inc). This session explores the concept of the network as a source of truth for distributed applications and offers a deep-dive into higher-level problems that often manifest early at level 3. Tying network and application behavior together offers a powerful cocktail for finding and fixing problems in distributed applications quickly while also ensuring timely responses to clients spread across the net.",
      "id":142
   },
   {
      "dtend":"20120719T165000",
      "dtstart":"20120719T161000",
      "dtstamp":"20120729T081711",
      "location":"D139-140",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24251",
      "uid":"http://oscon.com/--s2012-07-19-16:10--24251",
      "summary":"Automating Cloud Deployments with and Puppet and OpenStack",
      "description":"Presented by Dan Bode (PuppetLabs). This presentation will cover how OpenStack (an open source infrastructure as a service platform) and Puppet (an open source configuration management language) can be integrated to deploy and manage your own private cloud.",
      "id":143
   },
   {
      "dtend":"20120719T174000",
      "dtstart":"20120719T170000",
      "dtstamp":"20120721T191846",
      "location":"D139-140",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23641",
      "uid":"http://oscon.com/--s2012-07-19-17:00--23641",
      "summary":"Develop and Test Configuration Management Scripts with Vagrant",
      "description":"Presented by Mitchell Hashimoto (HashiCorp). Whether you use Chef, Puppet, or just basic shell scripting, there seems to be no clear way to incrementally develop and test scripts to provision a system. In this talk I'll introduce using local virtual machines managed by Vagrant as a way to achieve this, shortening the feedback loop and increasing productivity and confidence of configuration management script development.",
      "id":144
   },
   {
      "dtend":"20120720T104000",
      "dtstart":"20120720T100000",
      "dtstamp":"20120724T173533",
      "location":"D139-140",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24388",
      "uid":"http://oscon.com/--s2012-07-20-10:00--24388",
      "summary":"AMQP in Production: Building and Scaling High-Performance Compute Clusters",
      "description":"Presented by Nicholas Silva (Box). While there are many ways to design compute clusters, leveraging fast message queueing for all facets of system operation may be among the most elegant. Topics will include job collection, automatic load balancing, analytics, monitoring, and scaling. Learn real-world best practices and gotchas discovered while scaling an AMQP-based document processing backend to support over 8 million users.",
      "id":145
   },
   {
      "dtend":"20120720T114000",
      "dtstart":"20120720T110000",
      "dtstamp":"20120720T195436",
      "location":"D139-140",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23408",
      "uid":"http://oscon.com/--s2012-07-20-11:00--23408",
      "summary":"Running a high performance LAMP stack on a $20 Virtual server",
      "description":"Presented by Jay Janssen (Percona, Inc.). This talk will talk about how to optimize available hardware resources using a real-world VPS server running a full LAMP stack, including common tuning choke points and misconfigurations.",
      "id":146
   },
   {
      "dtend":"20120720T123000",
      "dtstart":"20120720T115000",
      "dtstamp":"20120724T173557",
      "location":"D139-140",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24412",
      "uid":"http://oscon.com/--s2012-07-20-11:50--24412",
      "summary":"One tiny daemon to harvest your server statistics (and more)",
      "description":"Presented by Brandon Philips (Rackspace, Inc). Finding on host monitoring that works for OSX, Linux and Windows is tough. It is even tougher to do it without CPU and Memory intensive languages.  But, we are doing it with virgo. Virgo is a Rackspace project that is creating a tiny daemon using lua, luvit and C to do monitoring across all major OSes fast and securely. Learn how it is built, how you can hack on it, and what it can do.",
      "id":147
   },
   {
      "dtend":"20120718T200000",
      "dtstart":"20120718T190000",
      "dtstamp":"20120729T233645",
      "location":"D139-140",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26194",
      "uid":"http://oscon.com/--s2012-07-18-19:00--26194",
      "summary":"FOSS by the Numbers Hack-a-thon",
      "description":"Join the Ohloh team and Donnie Berkholz from RedMonk for a fun, free-wheeling session. We'll mash-up different data sources with creative analysis, and calculate some new insights about the FOSS ecosystem. Bring data and ideas!",
      "id":148
   },
   {
      "dtend":"20120719T200000",
      "dtstart":"20120719T190000",
      "dtstamp":"20120702T203354",
      "location":"D139-140",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26446",
      "uid":"http://oscon.com/--s2012-07-19-19:00--26446",
      "summary":"Chef BoF: Automate All the Things!",
      "description":"Chef is an open source systems integration framework for automating the deployment of your entire infrastructure and the applications running in it. Let's get together and talk about what Chef can do for you today and what's coming in the future.",
      "id":149
   },
   {
      "dtend":"20120716T200000",
      "dtstart":"20120716T190000",
      "dtstamp":"20120820T082724",
      "location":"D139-140",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26463",
      "uid":"http://oscon.com/--s2012-07-16-19:00--26463",
      "summary":"Ceph: object storage, block storage, file system, replication, massive scalability, and then some!",
      "description":"A deep dive and discussion of Ceph, the highly available, massively scalable distributed object store, file system, and block device.",
      "id":150
   },
   {
      "dtend":"20120718T112000",
      "dtstart":"20120718T104000",
      "dtstamp":"20120721T000740",
      "location":"D137",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23216",
      "uid":"http://oscon.com/--s2012-07-18-10:40--23216",
      "summary":"Open Sourcing User Experience Design",
      "description":"Presented by Jeff Gothelf (Proof). Design is often perceived as “making things user-friendly.” To combat that oversimplification, designers shroud their work in specialized tools & jargon. This gives designers a false sense of value & control over their work. In actuality, this drives divisions between designers & their teams. By open sourcing design process via transparency, the true value of Design and designers becomes clear.",
      "id":151
   },
   {
      "dtend":"20120718T121000",
      "dtstart":"20120718T113000",
      "dtstamp":"20121118T011300",
      "location":"D137",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24833",
      "uid":"http://oscon.com/--s2012-07-18-11:30--24833",
      "summary":"Consumer Science and Product Development at Netflix",
      "description":"Presented by Rochelle King (Netflix), Matt Marenghi (Netflix). Netflix has created one of the most beloved and, at times, controversial consumer products of the last decade. Two veteran executives of the company, leaders of product design and product engineering,will give a detailed, behind-the-scenes look at how the experiment-oriented culture of Netflix drives product decisions.",
      "id":152
   },
   {
      "dtend":"20120718T142000",
      "dtstart":"20120718T134000",
      "dtstamp":"20120724T173516",
      "location":"D137",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24282",
      "uid":"http://oscon.com/--s2012-07-18-13:40--24282",
      "summary":"Arduino Hacking 101: Importing the Universe",
      "description":"Presented by Federico Lucifredi (Canonical USA). This session aims to give you the tools to import the real world into the programming scope of your trusty $30 microcontroller, by covering the technology fundamentals and integration essentials of a wide variety of sensors and actuators, as well as providing a few alternative power schemes and even mobility options to increase the variety of your design arsenal.",
      "id":153
   },
   {
      "dtend":"20120718T151000",
      "dtstart":"20120718T143000",
      "dtstamp":"20120724T174033",
      "location":"D137",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23946",
      "uid":"http://oscon.com/--s2012-07-18-14:30--23946",
      "summary":"Arduino & Handbag: Create Android Accessories Without Android Code",
      "description":"Presented by Philip Lindsay (rancidbacon.com). The Android Open Accessory Protocol makes it possible for you to create custom Arduino-based accessories for your Android phone or tablet. Attend this session to learn how to get started, the hardware & software required and how the Handbag for Android project makes development easier.",
      "id":154
   },
   {
      "dtend":"20120718T165000",
      "dtstart":"20120718T161000",
      "dtstamp":"20120729T234730",
      "location":"D137",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24093",
      "uid":"http://oscon.com/--s2012-07-18-16:10--24093",
      "summary":"Hacking Together A Basic Remote Sensor With An Arduino, Xbee Radios, and Linux",
      "description":"Presented by Rob Reilly (Rob Reilly Consulting). The hacker community has enthusiastically embraced the Arduino microcontroller. Linux and Open Source hackers are some of the most sophisticated and forward thinking in the business. This talk with give them plenty of ideas for building highly capable, remote sensor projects.",
      "id":155
   },
   {
      "dtend":"20120718T174000",
      "dtstart":"20120718T170000",
      "dtstamp":"20120725T032052",
      "location":"D137",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24300",
      "uid":"http://oscon.com/--s2012-07-18-17:00--24300",
      "summary":"Building a Home Automation Server",
      "description":"Presented by Bruce Momjian (EnterpriseDB). There are more options for home automation than ever before --- a growing number of inputs and outputs can be harnessed to make your home life easier. This presentation ties shows how sensors, temperatures, wireless devices, and telephones can be tied into lights, sounds, and even coffee pots to make your home \"smart\".",
      "id":156
   },
   {
      "dtend":"20120719T112000",
      "dtstart":"20120719T104000",
      "dtstamp":"20120720T192425",
      "location":"D137",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23882",
      "uid":"http://oscon.com/--s2012-07-19-10:40--23882",
      "summary":"Storytelling a Better User Experience",
      "description":"Presented by Paul Tashima (Nebula Inc.). This session will explore how storytelling techniques reflect core design approaches. From folklore to modern cinema, the way in which we tell good stories may help guide the way in which we design good user experience.",
      "id":157
   },
   {
      "dtend":"20120719T121000",
      "dtstart":"20120719T113000",
      "dtstamp":"20120808T155734",
      "location":"D137",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23591",
      "uid":"http://oscon.com/--s2012-07-19-11:30--23591",
      "summary":"Designing effective visualisations: matching data problems to our perceptual strengths",
      "description":"Presented by Hadley Wickham (Rice University / RStudio). Learn the essential bits of cognitive psychology to create effect visualisations that convey what you want them to convey.",
      "id":158
   },
   {
      "dtend":"20120719T142000",
      "dtstart":"20120719T134000",
      "dtstamp":"20120722T221940",
      "location":"D137",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24326",
      "uid":"http://oscon.com/--s2012-07-19-13:40--24326",
      "summary":"The Yocto Project: Professional Tools for Embedded Linux",
      "description":"Presented by Jeffrey Osier-Mixon (Intel Corporation). The Yocto Project™ is an open source collaboration project that provides tools to enable you create custom Linux-based systems for embedded products. This presentation describes the project in detail, contrasts it with other existing solutions, and provides a working example showing how you can create your own embedded distribution, with or without hardware.",
      "id":159
   },
   {
      "dtend":"20120719T151000",
      "dtstart":"20120719T143000",
      "dtstamp":"20120724T190804",
      "location":"D137",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24277",
      "uid":"http://oscon.com/--s2012-07-19-14:30--24277",
      "summary":"Making Hardware Open: Challenges and Opportunities",
      "description":"Presented by Frank Frankovsky (Facebook), Jonathan  Bryce (The Rackspace Cloud), Brian Stevens (Red Hat), Steve Ichinaga (Hyve Solutions, a division of SYNNEX Corporation). Facebook's Frank Frankovsky will lead a panel of industry leaders in a discussion of the challenges and opportunities in building open source movements around hardware. Frank will share key learnings from the Open Compute Project (a prominent industry initiative focused on driving greater openness and collaboration in infrastructure technology) and draw out similar insights from the panel.",
      "id":160
   },
   {
      "dtend":"20120719T174000",
      "dtstart":"20120719T170000",
      "dtstamp":"20120723T230038",
      "location":"D137",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24153",
      "uid":"http://oscon.com/--s2012-07-19-17:00--24153",
      "summary":"Bonescript: Simplified Physical Computing with Node.JS",
      "description":"Presented by Jason Kridner (Texas Instruments). Event-based I/O with JavaScript on embedded Linux provides single-language development of web-based visual monitors and controls with a broad range of sensors and actuators. Simple open hardware and software examples enable rich, affordable collaboration upon Linux. Connecting various sensor types, building Processing.JS-based visualizations and sharing your creation are also covered.",
      "id":161
   },
   {
      "dtend":"20120720T104000",
      "dtstart":"20120720T100000",
      "dtstamp":"20120723T041208",
      "location":"D137",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23675",
      "uid":"http://oscon.com/--s2012-07-20-10:00--23675",
      "summary":"Desktop Applications in the 21st Century",
      "description":"Presented by Joshua Marinacci (Nokia). Within 10 years 90% of people will use a smartphone, tablet, or other non-traditional device as their primary computing interface. But what about the other 10%: the professionals who need devices with both power *and* usability? In this session we will explore the the future of desktop apps as they compete with mobile and web based applications and look at new tools & toolkits to build them.",
      "id":162
   },
   {
      "dtend":"20120720T114000",
      "dtstart":"20120720T110000",
      "dtstamp":"20120724T181807",
      "location":"D137",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24064",
      "uid":"http://oscon.com/--s2012-07-20-11:00--24064",
      "summary":"Designing HTML5 Components",
      "description":"Presented by Joonas Lehtinen (Vaadin Ltd). Dozens of toolkits offer a range of widgets to build rich web applications, but the included widget set is rarely enough. This presentation shows how a new component can be designed and implemented from scratch. Topics covered include considerations for choosing DOM structure, finding a balance between performance and features, implementation considerations and testing the component.",
      "id":163
   },
   {
      "dtend":"20120720T123000",
      "dtstart":"20120720T115000",
      "dtstamp":"20120721T021956",
      "location":"D137",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23373",
      "uid":"http://oscon.com/--s2012-07-20-11:50--23373",
      "summary":"Social Commerce With Magento and Open Graph",
      "description":"Presented by John Jawed (X.Commerce). A stellar user experience and social indicators can be the difference between the checkout and back buttons. Learn how to work with and integrate facebook's new Open Graph APIs within magento. The session will provide a walkthrough of the facebook and magento setup, along with examples of customized user experiences which make the most of Open Graph and magento.",
      "id":164
   },
   {
      "dtend":"20120718T200000",
      "dtstart":"20120718T190000",
      "dtstamp":"20120720T074121",
      "location":"D137",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/25321",
      "uid":"http://oscon.com/--s2012-07-18-19:00--25321",
      "summary":"What is Python?",
      "description":"Unless you've been living under a rock the last few years, you should have already heard about Python. However, due to your work or other commitments, perhaps you haven't explored it in-depth. Here's your chance to get a high-level intro followed by a hands-on demo, an informal discussion on what it is and what people use it for, or whatever y'all want.",
      "id":165
   },
   {
      "dtend":"20120718T210000",
      "dtstart":"20120718T200000",
      "dtstamp":"20120612T055831",
      "location":"D137",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/25325",
      "uid":"http://oscon.com/--s2012-07-18-20:00--25325",
      "summary":"What is Google App Engine?",
      "description":"Google App Engine is a development & execution platform that lets you build+deploy web+non-web apps on Google's scalable infrastructure using Python, Go, or Java. Your apps execute on the same servers that power our company (speed, scale, reliability). There is no thinking about VMs, OSs, databases, webservers, licensing, updates/patches, load-balancing, etc. BOF: quick intro then hands-on coding",
      "id":166
   },
   {
      "dtend":"20120719T200000",
      "dtstart":"20120719T190000",
      "dtstamp":"20120619T072931",
      "location":"D137",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26341",
      "uid":"http://oscon.com/--s2012-07-19-19:00--26341",
      "summary":"Vaadin BOF",
      "description":"Vaadin Framework is one of the most popular open source web frameworks for Java developers at the moment. It is mostly used for building intranet and saas applications with rich desktop like user experience. Join Joonas Lehtinen and Jani Laakso - founders of the project - for discussion on what is in the next major version of the framework: Vaadin 7.",
      "id":167
   },
   {
      "dtend":"20120718T112000",
      "dtstart":"20120718T104000",
      "dtstamp":"20120729T233914",
      "location":"D138",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23380",
      "uid":"http://oscon.com/--s2012-07-18-10:40--23380",
      "summary":"Harnessing the Good Intentions of Others for your OSS Project",
      "description":"Presented by Llewellyn Falco (Spun Labs), Lynn Langit (Teaching Kids Programming). We have had a history of taking a different approach that has been highly successful in turning small emails and twitter comments into people programming with us on our OSS projects.  In this session we will share our stories so that you can also the harness good intentions of others and turn those intentions into committable code.",
      "id":168
   },
   {
      "dtend":"20120718T121000",
      "dtstart":"20120718T113000",
      "dtstamp":"20120729T232742",
      "location":"D138",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24381",
      "uid":"http://oscon.com/--s2012-07-18-11:30--24381",
      "summary":"Open Source Community Growth as a User Experience Problem",
      "description":"Presented by Asheesh Laroia (OpenHatch), Karen Rustad (OpenHatch). In your open source project's community, some people contribute. Most people don't. By analyzing the typical open source project's on-ramp for new contributors through the lens of user experience design, we provide practical tips to make any project more approachable and that diversify the community.",
      "id":169
   },
   {
      "dtend":"20120718T142000",
      "dtstart":"20120718T134000",
      "dtstamp":"20120729T233938",
      "location":"D138",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23552",
      "uid":"http://oscon.com/--s2012-07-18-13:40--23552",
      "summary":"Open Source 2.0: The Science of Community Management",
      "description":"Presented by David Eaves (Eaves Consulting). What do data analytics and negotiation theory have in common? In this talk, community management adviser David Eaves will outline how these two disciplines form the core of a new Science of Community Management: an approach to measure and manage contributors to make participation less frustration and more productive.",
      "id":170
   },
   {
      "dtend":"20120718T151000",
      "dtstart":"20120718T143000",
      "dtstamp":"20120729T233631",
      "location":"D138",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24224",
      "uid":"http://oscon.com/--s2012-07-18-14:30--24224",
      "summary":"Scaling Your Community by Nurturing Leaders",
      "description":"Presented by Meghan Gill (10gen). In this session, we’ll talk about strategies for nurturing, empowering and rewarding community leaders to help scale your open source community.",
      "id":171
   },
   {
      "dtend":"20120718T165000",
      "dtstart":"20120718T161000",
      "dtstamp":"20120726T180048",
      "location":"D138",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24290",
      "uid":"http://oscon.com/--s2012-07-18-16:10--24290",
      "summary":"Mind Over Machine--How-To Make Your Own Mind-Controlled Robot",
      "description":"Presented by Mary Jane Kelly (Casaba Security). Long have people dreamed of finding psychokinetic powers. From ancient mythology to the Uncanny X-Men, mental superpowers have been the stuff of legend. Now, with an Arduino and an EEG sensor headset, the amazing power of telekinesis can be yours!",
      "id":172
   },
   {
      "dtend":"20120718T174000",
      "dtstart":"20120718T170000",
      "dtstamp":"20120402T205501",
      "location":"D138",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24396",
      "uid":"http://oscon.com/--s2012-07-18-17:00--24396",
      "summary":"Open Source tools for local history",
      "description":"Presented by Brian Capouch (Saint Josephs College). Pastfinder is a prototype system developed by the software engineering class at Saint Joseph's College to keep track of a wide variety of geolocated historical assets.  Based on Open Source tools, it was used to develop an online \"virtual cemetery\" which represents Independence Cemetery, a large pioneer graveyard in Jasper County, Indiana.",
      "id":173
   },
   {
      "dtend":"20120719T112000",
      "dtstart":"20120719T104000",
      "dtstamp":"20120719T210232",
      "location":"D138",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23066",
      "uid":"http://oscon.com/--s2012-07-19-10:40--23066",
      "summary":"Girl Developers will Save the World!",
      "description":"Presented by Cheryl Miller (greenlight for girls Foundation). Greenlightforgirls.org is a Brussels-based, international NGO promoting science, technology, engineering and mathematics to girls of all ages and backgrounds.  We promote female role models from technical sectors to youngsters, and run events which inspire girls to study and pursue careers in technical areas, including computers.  With this knowledge, we believe girls will save the world!",
      "id":174
   },
   {
      "dtend":"20120719T121000",
      "dtstart":"20120719T113000",
      "dtstamp":"20120724T173723",
      "location":"D138",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24185",
      "uid":"http://oscon.com/--s2012-07-19-11:30--24185",
      "summary":"Effecting Organizational Change",
      "description":"Presented by Kane McLean (Open Source for America). Change is hard for individuals, and harder for organizations. Understanding how to navigate the forces affecting our habits and willpower will enable you to set about effecting real change in your organization. Discussed in terms of grassroots, clouds, elephants and jockeys, this practical perspective redefines the challenge of cultural change.",
      "id":175
   },
   {
      "dtend":"20120719T142000",
      "dtstart":"20120719T134000",
      "dtstamp":"20120724T190932",
      "location":"D138",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23982",
      "uid":"http://oscon.com/--s2012-07-19-13:40--23982",
      "summary":"The Art of Organizational Manipulation",
      "description":"Presented by Brian Fitzpatrick (Google, Inc.), Ben Collins-Sussman (Google, Inc.). We often hear engineers lament how hard it is to get anything done inside of a big company. The trick to overcoming this is to know the right people, understand how power flows in the organization, and, most importantly, what you can get away with and when.  We'll help you understand the human element of navigating companies both big and small through a series of (hopefully) amusing anecdotes.",
      "id":176
   },
   {
      "dtend":"20120719T151000",
      "dtstart":"20120719T143000",
      "dtstamp":"20120727T152434",
      "location":"D138",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23244",
      "uid":"http://oscon.com/--s2012-07-19-14:30--23244",
      "summary":"Open Source: The Next Generation",
      "description":"Presented by Nóirín Plunkett (Eucalyptus Systems), Michael Schwern (eval Empire). This year's college students never had a Commodore 64 - it had been discontinued before they were born. They've grown up with the internet and Google - they're smart, and they're already coding. This talk looks at how we can make open source relevant to the Facebook generation, how our communities can adapt to recognize their itches, and how we can benefit from their insight and work.",
      "id":177
   },
   {
      "dtend":"20120719T165000",
      "dtstart":"20120719T161000",
      "dtstamp":"20120725T173855",
      "location":"D138",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24392",
      "uid":"http://oscon.com/--s2012-07-19-16:10--24392",
      "summary":"Ubuntu Home Hacks",
      "description":"Presented by Allison Randal (DrugDev, Inc.). Inspired by a friend's X10-wired house in the 1990's, this talk is a modern take on the \"smart home\", searching for a more organic connection to our digital selves.",
      "id":178
   },
   {
      "dtend":"20120719T174000",
      "dtstart":"20120719T170000",
      "dtstamp":"20120721T231740",
      "location":"D138",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23944",
      "uid":"http://oscon.com/--s2012-07-19-17:00--23944",
      "summary":"Building a free Java community with deep roots",
      "description":"Presented by Martijn Verburg (jClarity), Ben Evans (jClarity). Based on our experiences with the LJC and other OSS projects we cover several tips and tricks used to build a vibrant community of thousands of passionate developers and get those communities working with each other and how to deal with conflicts and other war stories!",
      "id":179
   },
   {
      "dtend":"20120720T104000",
      "dtstart":"20120720T100000",
      "dtstamp":"20120727T151658",
      "location":"D138",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23014",
      "uid":"http://oscon.com/--s2012-07-20-10:00--23014",
      "summary":"OSI - More Relevant Than Ever",
      "description":"Presented by Tony Wasserman (Carnegie Mellon Silicon Valley), Simon  Phipps (Open Source Initiative). Formed by a group that included Tim O'Reilly, OSI has been the cornerstone of the movement OSCON aims to gather in plenary. Hear how OSI is transforming itself into the new voice of the global open source community",
      "id":180
   },
   {
      "dtend":"20120720T114000",
      "dtstart":"20120720T110000",
      "dtstamp":"20120724T190815",
      "location":"D138",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23009",
      "uid":"http://oscon.com/--s2012-07-20-11:00--23009",
      "summary":"Test Driven Blogging or how a wiki almost killed my startup",
      "description":"Presented by Peter Neubauer (Neo Technology). You know the drill - prototype, code, test, docs. The last part of the chain is either omitted or will rot in Wikis and manuals. This session introduces what Neo4j did to get O'Reilly quality DocBook content out of the codebase without getting in the way of the developers and extending the amount of docs from JavaDoc to PDF-book quality.",
      "id":181
   },
   {
      "dtend":"20120720T123000",
      "dtstart":"20120720T115000",
      "dtstamp":"20120726T184356",
      "location":"D138",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24180",
      "uid":"http://oscon.com/--s2012-07-20-11:50--24180",
      "summary":"Building a Modern MUD",
      "description":"Presented by Andy Smith (Rackspace). Long before WoW and whatever else the kids are playing these days, we had telnet and multi-user dungeons with huge expansive worlds, clever writing and tons of charm. People still use IRC, why not MUDs? As a huge fan of the genre I wanted to write my own, this is my journey.",
      "id":182
   },
   {
      "dtend":"20120718T200000",
      "dtstart":"20120718T190000",
      "dtstamp":"20120724T190739",
      "location":"D138",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26111",
      "uid":"http://oscon.com/--s2012-07-18-19:00--26111",
      "summary":"GlusterFS: Taming the Big Data Beast",
      "description":"GlusterFS is the engine that drives storage in the cloud, virtualized environments, or just large, scale-out NAS in general. If you have massive amounts of unstructured data, such as files and folders, GlusterFS is for you.",
      "id":183
   },
   {
      "dtend":"20120719T200000",
      "dtstart":"20120719T190000",
      "dtstamp":"20120627T171619",
      "location":"D138",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26363",
      "uid":"http://oscon.com/--s2012-07-19-19:00--26363",
      "summary":"Programming OpenFlow and SDN with Floodlight",
      "description":"Interested in learning about Software-Defined Networking and OpenFlow?  Mike Cohen, product manager for Floodlight, will offer a hands-on tutorial that shows attendees how to build applications on top of the Floodlight platform.",
      "id":184
   },
   {
      "dtend":"20120716T123000",
      "dtstart":"20120716T090000",
      "dtstamp":"20120719T154357",
      "location":"E143-144",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24059",
      "uid":"http://oscon.com/--s2012-07-16-09:00--24059",
      "summary":"Perl: The First Three Days",
      "description":"Presented by Peter Scott (Pacific Systems Design Technologies). Normally it takes three days of classes for a beginner to get familiar with Perl.  We don't have three days, so we're going to speed things up... just a bit.  This tutorial will cover the basics and enough of the more advanced features to bootstrap the learning process for Perl novices.",
      "id":185
   },
   {
      "dtend":"20120716T170000",
      "dtstart":"20120716T133000",
      "dtstamp":"20120718T035850",
      "location":"E143-144",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24183",
      "uid":"http://oscon.com/--s2012-07-16-13:30--24183",
      "summary":"Request Tracker Boot Camp",
      "description":"Presented by Kevin Falcone (Best Practical Solutions), Alex Vandiver (Best Practical Solutions). Request Tracker (RT) is an enterprise-grade ticketing system. It’s designed to help your organization track what needs to get done and what still needs doing. From basic customer service to advanced back-office workflows, RT is flexible enough to keep your processes smooth and effective.",
      "id":186
   },
   {
      "dtend":"20120717T123000",
      "dtstart":"20120717T090000",
      "dtstamp":"20120726T055619",
      "location":"E143-144",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23275",
      "uid":"http://oscon.com/--s2012-07-17-09:00--23275",
      "summary":"New Features of the Modern Perls (5.10 to 5.16)",
      "description":"Presented by Damian Conway (Thoughtstream). This tutorial provides a overview of the most important new features introduced in Perl 5.10 to 5.16, along with practical examples of how those features can improve the performance, robustness, and maintainability of your code",
      "id":187
   },
   {
      "dtend":"20120718T112000",
      "dtstart":"20120718T104000",
      "dtstamp":"20120926T164100",
      "location":"E144",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23252",
      "uid":"http://oscon.com/--s2012-07-18-10:40--23252",
      "summary":"PHP in 2012",
      "description":"Presented by Rasmus Lerdorf (Etsy). A look at the state of PHP in 2012 and how it fits into the current technology stack. The session will cover common mistakes and a detailed review of new PHP 5.4 features.",
      "id":188
   },
   {
      "dtend":"20120718T121000",
      "dtstart":"20120718T113000",
      "dtstamp":"20120926T164039",
      "location":"E144",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23503",
      "uid":"http://oscon.com/--s2012-07-18-11:30--23503",
      "summary":"PHP 5.4 Features You Will Actually Use",
      "description":"Presented by Lorna Jane Mitchell (LornaJane). Did you know that the newest version of PHP ships with its own development server?  This talk discusses when this might be useful (and when it isn't!) and also covers a selection of the other features new in PHP.",
      "id":189
   },
   {
      "dtend":"20120718T142000",
      "dtstart":"20120718T134000",
      "dtstamp":"20120926T164055",
      "location":"E144",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23829",
      "uid":"http://oscon.com/--s2012-07-18-13:40--23829",
      "summary":"I Can't Believe You Still Do It That Way:12 Years of PHP Best Practice Talks revisited",
      "description":"Presented by Laura Thomson (Mozilla Corporation), Luke Welling ([Redacted]). For the last twelve years we've been giving conference talks and writing books about how to develop for the web in PHP.  Over that time we've made a bunch of recommendations: some still hold true, and some things have changed quite a bit since 2000.  We'll talk about how the landscape's changed, and how and when you should change the way you work.",
      "id":190
   },
   {
      "dtend":"20120718T151000",
      "dtstart":"20120718T143000",
      "dtstamp":"20120615T175204",
      "location":"E144",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23097",
      "uid":"http://oscon.com/--s2012-07-18-14:30--23097",
      "summary":"Developing easily deployable PHP Applications",
      "description":"Presented by John Mertic (SugarCRM). Here's the scenario: you wrote a PHP application that is designed to run on Linux, Apache, and MySQL. Now you have a customer that wants to run it on Windows. Or using Oracle. Or they like using Memcache instead of APC.  How do you do it, without sacrificing performance, stability, simplicity, and your own sanity? learn what it takes to make that project a success.",
      "id":191
   },
   {
      "dtend":"20120718T165000",
      "dtstart":"20120718T161000",
      "dtstamp":"20120926T164114",
      "location":"E144",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23508",
      "uid":"http://oscon.com/--s2012-07-18-16:10--23508",
      "summary":"Get Some Rest: Best RESTful API Practices",
      "description":"Presented by Lorna Jane Mitchell (LornaJane). Whether you're consumer or provider, getting the API right is a puzzle.  This session gives the best practices for making this relationship easier all round, with clear PHP-based examples and a few war stories to go with them.",
      "id":192
   },
   {
      "dtend":"20120718T174000",
      "dtstart":"20120718T170000",
      "dtstamp":"20120719T230027",
      "location":"E144",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23011",
      "uid":"http://oscon.com/--s2012-07-18-17:00--23011",
      "summary":"Dependency Injection with PHP",
      "description":"Presented by Bastian Hofmann (ResearchGate GmbH). Dependency Inversion is an important technique of object oriented software design and one of Uncle Bob's S.O.L.I.D. principles. In this talk I'll show you what this means and how modern PHP dependency injection containers can help you massively. I will especially highlight rginjection, a new, fetaure rich container inspired by google-guice.",
      "id":193
   },
   {
      "dtend":"20120719T112000",
      "dtstart":"20120719T104000",
      "dtstamp":"20120722T201516",
      "location":"E144",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24320",
      "uid":"http://oscon.com/--s2012-07-19-10:40--24320",
      "summary":"Why would you use PHP for a startup?",
      "description":"Presented by Luke Welling ([Redacted]). PHP has rarely been a fashionable language, so it's probably no surprise that it is not high fashion for startups today.  What advantages influence the startups that choose it?  Ignoring loss of hipster cred, what real disadvantages do they face?  What features of other language ecosystems are missing or underused in PHP?",
      "id":194
   },
   {
      "dtend":"20120719T121000",
      "dtstart":"20120719T113000",
      "dtstamp":"20120719T200620",
      "location":"E144",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24071",
      "uid":"http://oscon.com/--s2012-07-19-11:30--24071",
      "summary":"A Stitch In Time Saves Nine: Solving the N+1 Problem",
      "description":"Presented by Paul Jones (http://paul-m-jones.com/). When dealing with databases, developers frequently run into the N+1 problem, in which they populate domain objects via queries in loops. This causes terrible performance drags. The talk shows how to solve the N+1 problem in plain PHP as well as Postgres. It concludes with a way of automating the PHP side, and includes editorializing about the origins of the N+1 problem in the developer mindset.",
      "id":195
   },
   {
      "dtend":"20120719T142000",
      "dtstart":"20120719T134000",
      "dtstamp":"20120722T190130",
      "location":"E144",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24377",
      "uid":"http://oscon.com/--s2012-07-19-13:40--24377",
      "summary":"Inside PHP",
      "description":"Presented by Thomas Lee (New Relic). So you know the PHP language back to front, you know all the frameworks, and you've churned out countless native PHP modules in C -- but have you ever wondered how you might toy with the PHP language itself? Come along and learn a little more about the inside of your favourite programming language as I guide you through the process of adding a new keyword to the language.",
      "id":196
   },
   {
      "dtend":"20120719T151000",
      "dtstart":"20120719T143000",
      "dtstamp":"20120726T180104",
      "location":"E144",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/22993",
      "uid":"http://oscon.com/--s2012-07-19-14:30--22993",
      "summary":"Testing Untestable Code",
      "description":"Presented by Stephan Hochdörfer (bitExpert AG). Automated software testing is an widely-adopted standard today. Unfortunately there exist applications that are not testable by their design. In the first part of the session it is shown how the dynamic nature of PHP can be used to manipulate such dependencies. In the second part of the session an additional layer gets introduced which transforms parts of components into testable code fragments.",
      "id":197
   },
   {
      "dtend":"20120719T174000",
      "dtstart":"20120719T170000",
      "dtstamp":"20120722T012148",
      "location":"E144",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23264",
      "uid":"http://oscon.com/--s2012-07-19-17:00--23264",
      "summary":"What every web developer should know about database optimization",
      "description":"Presented by Steve Meyers (Utah Open Source Foundation). Most developers are developers, not DBAs, yet many smaller companies have inadequate database experience in-house.  This is largely because databases like MySQL and PostgreSQL don't necessarily require a full-time DBA to administer.  It's become more important for developers at smaller companies to have some basic knowledge of how to keep their database happy.",
      "id":198
   },
   {
      "dtend":"20120720T104000",
      "dtstart":"20120720T100000",
      "dtstamp":"20120726T211216",
      "location":"E144",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24349",
      "uid":"http://oscon.com/--s2012-07-20-10:00--24349",
      "summary":"Hacking Embedded Linux: More Hardware than You Require",
      "description":"Presented by Federico Lucifredi (Canonical USA). A quick intro to embedded Linux development and a survey of the capabilities and limits of the most interesting hardware available for experimenting by hardware hackers, and the skills needed to make effective use of it. Ranging from Plug Computers to bare development boards, miniaturized systems and rooted hard drives, the ever-growing bestiary of ARM devices at our disposal for projects is fun!",
      "id":199
   },
   {
      "dtend":"20120720T114000",
      "dtstart":"20120720T110000",
      "dtstamp":"20120723T010414",
      "location":"E144",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24137",
      "uid":"http://oscon.com/--s2012-07-20-11:00--24137",
      "summary":"America's Next Top Data Model",
      "description":"Presented by Ian Plosker (Basho Technologies, Inc). Watch as data models compete for the top prize. Who will win? Contestants will be judged on performance, ease of querying, and scalability. Join us to find out who will be America's Next Top Data Model.",
      "id":200
   },
   {
      "dtend":"20120720T123000",
      "dtstart":"20120720T115000",
      "dtstamp":"20120721T182631",
      "location":"E144",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23950",
      "uid":"http://oscon.com/--s2012-07-20-11:50--23950",
      "summary":"Big Data Without Big Database: Extreme In-Memory Caching",
      "description":"Presented by Leon Stein (Decide). These days it is not uncommon to have 100s of gigabytes of data that needs to be sliced and diced then delivered fast and rendered quickly. This talk seeks to cover some strategies for caching large data sets without tons of expensive hardware, but through software and data design.",
      "id":201
   },
   {
      "dtend":"20120718T200000",
      "dtstart":"20120718T190000",
      "dtstamp":"20120702T201849",
      "location":"E144",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26455",
      "uid":"http://oscon.com/--s2012-07-18-19:00--26455",
      "summary":"Open Translation & Localization Tools",
      "description":"Meet, discuss and learn about open translation and localization tools that you can use to make your application or service accessible to users globally.",
      "id":202
   },
   {
      "dtend":"20120719T200000",
      "dtstart":"20120719T190000",
      "dtstamp":"20121016T114358",
      "location":"E144",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26485",
      "uid":"http://oscon.com/--s2012-07-19-19:00--26485",
      "summary":"Enterprise Java and Spring",
      "description":"Are you using Spring? Curious about some of the upcoming new features and projects? Then this is the BoF for you.",
      "id":203
   },
   {
      "dtend":"20120718T112000",
      "dtstart":"20120718T104000",
      "dtstamp":"20120720T153346",
      "location":"E145",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24043",
      "uid":"http://oscon.com/--s2012-07-18-10:40--24043",
      "summary":"Living with Open Source Software",
      "description":"Presented by Brian Olore (The Boeing Company), Katie Gengler (The Boeing Company). Why do you decide to use Open Source Software? How do you choose one Open Source project over another? Join us for a discussion of the critical factors to consider to \"mitigate risk\" when choosing to use a project, including techniques for living with that choice. We'll talk about several different projects that we have integrated to various ends: success, forking, adoption, and abandonment.",
      "id":204
   },
   {
      "dtend":"20120718T121000",
      "dtstart":"20120718T113000",
      "dtstamp":"20120725T203249",
      "location":"E145",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23772",
      "uid":"http://oscon.com/--s2012-07-18-11:30--23772",
      "summary":"The Ten Commandments of Open Innovation",
      "description":"Presented by Thierry Carrez (OpenStack). As open source becomes ubiquitous, open innovation becomes the new frontier. How do we create truly collaborative multi-company open source projects, and how do we make them successful ? This talk will reflect back on the good and the bad of the OpenStack project experience to distill ten principles that anyone should apply to their own open innovation projects.",
      "id":205
   },
   {
      "dtend":"20120718T142000",
      "dtstart":"20120718T134000",
      "dtstamp":"20120719T220925",
      "location":"E145",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24378",
      "uid":"http://oscon.com/--s2012-07-18-13:40--24378",
      "summary":"‘Open Movie’ 3D Animation and the Business of Free Culture",
      "description":"Presented by Bassam Kurdali (URCHN). Artist, programmer, entrepreneur and activist Bassam Kurdali on the non-traditional URCHN.ORG animation studio, the Tube Open Movie, F/LOSS for independent filmmaking, art work and doing business in the commons.",
      "id":206
   },
   {
      "dtend":"20120718T151000",
      "dtstart":"20120718T143000",
      "dtstamp":"20120726T180036",
      "location":"E145",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24130",
      "uid":"http://oscon.com/--s2012-07-18-14:30--24130",
      "summary":"Hiding Data Kills Innovation",
      "description":"Presented by Gil Elbaz (Factual). Hiding  data in a siilo no longer needs to be the status quo. Indeed, this presentation argues that it shouldn’t be. In this presentation, Gil Elbaz will discuss the detriments of hiding data and the relationship between data accessibility and innovation.",
      "id":207
   },
   {
      "dtend":"20120718T165000",
      "dtstart":"20120718T161000",
      "dtstamp":"20120729T141244",
      "location":"E145",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24957",
      "uid":"http://oscon.com/--s2012-07-18-16:10--24957",
      "summary":"How The App Store Killed Free Software, And Why We're OK With That",
      "description":"Presented by Robert \"r0ml\" Lefkowitz (Sharewave). Software Freedom™ doesn't come from access to the source code any more than Freedom of the Press comes from the ability to take apart the machines that print the newspaper.  The App Store has changed the software industry to create software freedom without access to source code.",
      "id":208
   },
   {
      "dtend":"20120718T174000",
      "dtstart":"20120718T170000",
      "dtstamp":"20120723T043054",
      "location":"E145",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23112",
      "uid":"http://oscon.com/--s2012-07-18-17:00--23112",
      "summary":"It’s not our code, but it is our product! Managing the security impact of bundled Open Source Software",
      "description":"Presented by Tim Sammut (Cisco Security Research and Operations). The use of Open Source Software in products or services can create numerous benefits; however, it simultaneously presents security challenges that are often overlooked. How do you learn of new vulnerabilities in OSS that you use? How do you effectively manage and track those issues? How do you disclose issues to your customers? This session will address these questions and many more.",
      "id":209
   },
   {
      "dtend":"20120719T112000",
      "dtstart":"20120719T104000",
      "dtstamp":"20120724T140521",
      "location":"E145",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23024",
      "uid":"http://oscon.com/--s2012-07-19-10:40--23024",
      "summary":"Building PhoneGap at Nitobi and then Adobe: Free Software in Small and Large Corporations",
      "description":"Presented by Brian LeRoux (Adobe Systems). Nitobi Software quietly lead a mobile web revolution creating and fostering the PhoneGap project eventually growing it to millions of users worldwide. In late 2011, Nitobi was acquired by Adobe Systems. This talk will go through the transition of small software consultancy working part time on a free software project growing into a small team in a large company dedicated to the same project.",
      "id":210
   },
   {
      "dtend":"20120719T121000",
      "dtstart":"20120719T113000",
      "dtstamp":"20120726T184437",
      "location":"E145",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24221",
      "uid":"http://oscon.com/--s2012-07-19-11:30--24221",
      "summary":"US Government v. Open Source: A History and Lessons Learned",
      "description":"Presented by Karl Fogel (Open Tech Strategies, LLC), Gunnar  Hellekson (Red Hat). We've assembled the first comprehensive history of open source in the US government -- all the major events, publications, policy, and code releases we could collect. And it's mashable. From that data, we learn how the government adopts open source, how policies affects adoption, and how governments have most effectively encouraged their own open source use.",
      "id":211
   },
   {
      "dtend":"20120719T142000",
      "dtstart":"20120719T134000",
      "dtstamp":"20120727T152427",
      "location":"E145",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24259",
      "uid":"http://oscon.com/--s2012-07-19-13:40--24259",
      "summary":"Pivoting an African Open Source Project",
      "description":"Presented by David Kobia (Ushahidi Inc). Ushahidi, an open source project had many early successes in crowdsourced mapping and has had to deal with issues of scale, accessibility and security with ever increasing geo-political concerns. Ushahidi has also taken aim at big data’s problems of verification, aggregation and context with a tool called SwiftRiver. We’ve had many interesting challenges. Join us for lessons and dialogue.",
      "id":212
   },
   {
      "dtend":"20120719T151000",
      "dtstart":"20120719T143000",
      "dtstamp":"20120727T160355",
      "location":"E145",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23917",
      "uid":"http://oscon.com/--s2012-07-19-14:30--23917",
      "summary":"Bootstrap",
      "description":"Presented by Jacob Thornton (Twitter). What was learnt during Bootstraps rapid rise to the number one position on github? What went wrong? What went right? How were we lucky? What's coming next? CSS. Markup. JS. Co-authoring. Community. Press. A new toolkit. A new language.",
      "id":213
   },
   {
      "dtend":"20120719T165000",
      "dtstart":"20120719T161000",
      "dtstamp":"20120729T234643",
      "location":"E145",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24228",
      "uid":"http://oscon.com/--s2012-07-19-16:10--24228",
      "summary":"Managing Community Open Source Brands",
      "description":"Presented by Shane Curcuru (The Apache Software Foundation). What is the single most valuable part of an open source project?  Its brand. When everyone can fork your code on their own, a project's brand is the most important thing to understand and maintain for the benefit of the project's core technical community. Learn how communities can intelligently manage their reputation, and companies can respectfully use the brand.",
      "id":214
   },
   {
      "dtend":"20120719T174000",
      "dtstart":"20120719T170000",
      "dtstamp":"20120722T234606",
      "location":"E145",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23809",
      "uid":"http://oscon.com/--s2012-07-19-17:00--23809",
      "summary":"Frequently Asked and Infrequently Answered Questions  About Software Patents",
      "description":"Presented by Mishi Choudhary (Software Freedom Law Center), Deb Nicholson (Open Invention Network), Justin Colannino (Ropes & Gray LLP). The intense commercial competition between technology companies is driving large volumes of complex and often multi-jurisdictional patent litigation.  With the de facto possibility of patenting software related ideas in various countries, free and open source software developers must understand the patent risks inherent in the development and distribution of their software.",
      "id":215
   },
   {
      "dtend":"20120720T104000",
      "dtstart":"20120720T100000",
      "dtstamp":"20120402T182527",
      "location":"E145",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23750",
      "uid":"http://oscon.com/--s2012-07-20-10:00--23750",
      "summary":"Bringing the Open Source to the Enterprise! An incomplete story",
      "description":"Presented by Mohamed Elmallah (Children's Hospital of Los Angeles). You have been there before, wondering why do we pay all this money in licensing while we can go Open Source. You work for government, non-profit, healthcare, or an IT consulting company, you propose Open Source, but you find objections. If you are lucky enough to get an Open Source project going, you meet resistance and many challenges. Well, you are not alone. Let's contemplate on few stories.",
      "id":216
   },
   {
      "dtend":"20120720T114000",
      "dtstart":"20120720T110000",
      "dtstamp":"20120726T211225",
      "location":"E145",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23880",
      "uid":"http://oscon.com/--s2012-07-20-11:00--23880",
      "summary":"US Patriot Act and implications for Cloud Computing & Data Privacy",
      "description":"Presented by Diane Mueller (ActiveState), David Mertz (IBM developerWorks). Companies are thinking long & hard about legal & regulatory implications of cloud computing. No matter what efficiency gains are, Legal often directs IT to steer clear of any service that eliminates their ability to keep sensitive information out of the hands of Federal prosecutors. As the fog clears on the US Patriot Act, best practices are emerging to enable corporations to move to the cloud.",
      "id":217
   },
   {
      "dtend":"20120720T123000",
      "dtstart":"20120720T115000",
      "dtstamp":"20120724T140433",
      "location":"E145",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26537",
      "uid":"http://oscon.com/--s2012-07-20-11:50--26537",
      "summary":"Small Business Mistakes",
      "description":"Presented by Jacinta Richardson (Perl Training Australia). You have a great business idea and your friends and colleagues are supportive and tell you that you can do it. The forms have been filled in, you've said goodbye to your rat-race job, and you're investing your energy into getting things done. Still, despite how compelling your idea is, you're not making any money and your savings are dwindling. What are you doing wrong?",
      "id":218
   },
   {
      "dtend":"20120718T200000",
      "dtstart":"20120718T190000",
      "dtstamp":"20120710T180630",
      "location":"E145",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26352",
      "uid":"http://oscon.com/--s2012-07-18-19:00--26352",
      "summary":"Next Generation of Apache Hadoop",
      "description":" Join Arun C. Murthy, Apache Hadoop PMC and co-founder of Hortonworks, to discuss the next generation of Apache Hadoop and the major improvements in \"Hadoop-.23\".",
      "id":219
   },
   {
      "dtend":"20120719T200000",
      "dtstart":"20120719T190000",
      "dtstamp":"20120712T003136",
      "location":"E145",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26504",
      "uid":"http://oscon.com/--s2012-07-19-19:00--26504",
      "summary":"Meet the Arduino Community Manager and tell him what you'd like to see",
      "description":"I've recently been hired (part-time) by Arduino to wear a couple of different and flexible hats, the primary two responsibilities being community relations and educational materials. If you use, teach, or are in general interested in Arduino I'd like find out what you wish I would do.",
      "id":220
   },
   {
      "dtend":"20120716T123000",
      "dtstart":"20120716T090000",
      "dtstamp":"20120820T214234",
      "location":"E145-146",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23588",
      "uid":"http://oscon.com/--s2012-07-16-09:00--23588",
      "summary":"Data Science in R",
      "description":"Presented by Hadley Wickham (Rice University / RStudio). Learn the basics of R for data science: what makes R special as a language, and what R packages are most important for data manipulation, visualisation and modelling.",
      "id":221
   },
   {
      "dtend":"20120716T170000",
      "dtstart":"20120716T133000",
      "dtstamp":"20120731T202630",
      "location":"E145-146",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23130",
      "uid":"http://oscon.com/--s2012-07-16-13:30--23130",
      "summary":"The Art of Social Media Analysis with Twitter & Python",
      "description":"Presented by Krishna Sankar (TCS). Social media has become the true mirror of the society & no doubt, Twitter is silver behind the glass. An understanding of the underlying network models reflected by the tweets & associated metadata enables one to infer and predict. In this tutorial, we will derive domain metrics like Cliques and Brand Rank by applying SNA principles via Twitter APIs.",
      "id":222
   },
   {
      "dtend":"20120717T123000",
      "dtstart":"20120717T090000",
      "dtstamp":"20120814T164105",
      "location":"E145-146",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23090",
      "uid":"http://oscon.com/--s2012-07-17-09:00--23090",
      "summary":"PostgreSQL Unboxing",
      "description":"Presented by Christophe Pettus (PostgreSQL Experts, Inc.). You have your shiny new PostgreSQL source tarball or package, but what to do with it? In one intense tutorial, we'll go through everything need to install, configure, and maintain your new, tuned, replicated, back-uped PostgreSQL installation.",
      "id":223
   },
   {
      "dtend":"20120717T170000",
      "dtstart":"20120717T133000",
      "dtstamp":"20120731T202659",
      "location":"E145-146",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23910",
      "uid":"http://oscon.com/--s2012-07-17-13:30--23910",
      "summary":"Building real software with Go",
      "description":"Presented by Andrew Gerrand (Google). Dive headfirst into the Go Programming Language with this hands-on tutorial. Following the successful \"Tour of Go\" from OSCON in 2011, this pragmatic tutorial walks through the process of building a complete, useful, and idiomatic Go program. Participants will learn the Go language, libraries, and tools and have fun writing a real Go program.",
      "id":224
   },
   {
      "dtend":"20120718T112000",
      "dtstart":"20120718T104000",
      "dtstamp":"20120723T164509",
      "location":"E146",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24733",
      "uid":"http://oscon.com/--s2012-07-18-10:40--24733",
      "summary":"BodyTrack: Open Source Tools for Health Empowerment through Self-Tracking",
      "description":"Presented by Anne Wright (CMU), Candide Kemmler (Fluxtream.com), Rich Gibson (Gigapan.org). The BodyTrack project develops open source tools to aggregate and visualize self-tracking data from a variety of sources. We seek to empower individuals to explore how various factors affect them, such as evaluating potential food sensitivities, asthma or migraine triggers, or other environment/health interactions. We will discuss these tools and experiences using them.",
      "id":225
   },
   {
      "dtend":"20120718T121000",
      "dtstart":"20120718T113000",
      "dtstamp":"20120720T000240",
      "location":"E146",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24629",
      "uid":"http://oscon.com/--s2012-07-18-11:30--24629",
      "summary":"Hacking Yourself: Hard Core Behavior Change",
      "description":"Presented by Fred Trotter (FredTrotter.com). I run the public running behaviour change site RunOrElse.com. The idea is simple. You set a distance goal each week. You track that goal with RunKeeper. If you meet your goal, nothing happens and you keep your money. If you fail your goal, we automatically charge your Paypal account, sending money to charity.  During this talk we will release and demo Open Source code that does the same thing!",
      "id":226
   },
   {
      "dtend":"20120718T142000",
      "dtstart":"20120718T134000",
      "dtstamp":"20120720T181522",
      "location":"E146",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24738",
      "uid":"http://oscon.com/--s2012-07-18-13:40--24738",
      "summary":"Experience Sampling Experience",
      "description":"Presented by Bob Evans (Google). Get started building your own Android health trackers in minutes with PACO.  PACO is an opensource Android tool that lets you create all sorts of experience sampling studies to track health & wellness as well as visualize all the data together across your experiments. It started out inside Google but is now being used by Quantified Self-ers, med schools, psychology departments, & businesses.",
      "id":227
   },
   {
      "dtend":"20120718T151000",
      "dtstart":"20120718T143000",
      "dtstamp":"20120723T164520",
      "location":"E146",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24204",
      "uid":"http://oscon.com/--s2012-07-18-14:30--24204",
      "summary":"Building safety-critical medical device platforms and Meaningful Use EHR gateways",
      "description":"Presented by Shahid Shah (Netspective). Medical devices can no longer be seen as standalone components because of the significant clinical data they collect. Creating connected devices is a major requirement for most manufacturers and this talk with show how to use modern, open source and open software architecture techniques to build connected devices.",
      "id":228
   },
   {
      "dtend":"20120718T165000",
      "dtstart":"20120718T161000",
      "dtstamp":"20120724T230153",
      "location":"E146",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26536",
      "uid":"http://oscon.com/--s2012-07-18-16:10--26536",
      "summary":"Don't Fear Unicode",
      "description":"Presented by Jacinta Richardson (Perl Training Australia). Unicode isn't new, but it still seems hard when you're starting at the beginning and haven't even been told the difference between a glyph, a codepoint, a character and a byte. Every year there are talks and tutorials at conferences about it, but if you haven't grasped the basics, you can feel frustrated and lost much too quickly. Fear not! It's about to get easier.",
      "id":229
   },
   {
      "dtend":"20120718T174000",
      "dtstart":"20120718T170000",
      "dtstamp":"20120723T164527",
      "location":"E146",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24177",
      "uid":"http://oscon.com/--s2012-07-18-17:00--24177",
      "summary":"Global communities building open source Health IT platforms: The OpenMRS experience",
      "description":"Presented by Paul Biondich (OpenMRS), Burke Mamlin (OpenMRS), Hamish Fraser (Partners In Health). What are the advantages and disadvantages of building Health IT platforms instead of out-of-the box systems? How can people building these systems share tools and resources with others in different countries who may do very different work? This panel of participants in the OpenMRS community will share their real-world experiences from multiple continents on a variety of scales.",
      "id":230
   },
   {
      "dtend":"20120719T112000",
      "dtstart":"20120719T104000",
      "dtstamp":"20120726T180054",
      "location":"E146",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24181",
      "uid":"http://oscon.com/--s2012-07-19-10:40--24181",
      "summary":"Open Standards and Open Architecture in Global Health: Saving Lives with Open Source",
      "description":"Presented by Paul Biondich (OpenMRS), Derek Ritz (ecGroup Inc.), Dykki Settle (IntraHealth International), Eduardo Jezierski (InSTEDD). Open standards and open architecture support developing countries to build systems in a more thoughtful and pragmatic way. Through this approach, and using these tools, we can follow an example of how Rwanda has begun to design and develop a national health information system, and how this will allow other countries to do the same, more quickly and more effectively then ever before",
      "id":231
   },
   {
      "dtend":"20120719T121000",
      "dtstart":"20120719T113000",
      "dtstamp":"20120727T004340",
      "location":"E146",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24291",
      "uid":"http://oscon.com/--s2012-07-19-11:30--24291",
      "summary":"Clinical DNA Sequencing: Software to Push Healthcare Forward",
      "description":"Presented by Michael Italia (The Children's Hospital of Philadelphia). For more than a decade, people have imagined a future where the sequencing of a person's DNA would be as routine a medical practice as a visit to the doctor. We now stand on the cusp of this future, but the volume and complexity of the data exceed our ability to interpret it. Within this challenge lies a major opportunity for software to make a difference in the future of medicine.",
      "id":232
   },
   {
      "dtend":"20120719T142000",
      "dtstart":"20120719T134000",
      "dtstamp":"20120726T184429",
      "location":"E146",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23956",
      "uid":"http://oscon.com/--s2012-07-19-13:40--23956",
      "summary":"Hacking your body: Running as performance tuning",
      "description":"Presented by Dave Neary (Red Hat). Your body is a machine. If you jog or run, then by mixing things up, you can help make that machine run more efficiently. This talk will cover the basics of how to establish a performance baseline, constructing a training program to improve performance, and then measuring the improvements.",
      "id":233
   },
   {
      "dtend":"20120719T151000",
      "dtstart":"20120719T143000",
      "dtstamp":"20120514T192245",
      "location":"E146",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/25832",
      "uid":"http://oscon.com/--s2012-07-19-14:30--25832",
      "summary":"Free the Code: The Case for the US Federal Government to Open Source Software as a Default Position",
      "description":"Presented by Deborah Bryant (Deb Bryant & Associates), John Scott (RadiantBlue Technologies, Inc. ). Long-time open source advocate in government Deb Bryant takes off the gloves and talks about legislators and lobbyists, policy wonks and pundits, bureaucrats and and advocates. It's just the fodder you’ll need to get behind a new national technology imperative; recycle US Federal investments in software into the innovation economy while taking control of their own software destiny.",
      "id":234
   },
   {
      "dtend":"20120719T165000",
      "dtstart":"20120719T161000",
      "dtstamp":"20120731T203552",
      "location":"E146",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24129",
      "uid":"http://oscon.com/--s2012-07-19-16:10--24129",
      "summary":"OSEHRA - Building an Open Source EHR for All",
      "description":"Presented by Luis Ibanez (KITWARE Inc.), Seong Ki Mun (OSEHRA), Rick Avila (KITWARE Inc.). The Department of Veterans Affairs spawned in July 2011 the creation of OSEHRA, a non-profit organization whose mission is to apply best practices of open source software development to the improvement and maintenance of Open Source EHR information systems that are freely available for all. Please join us in this session to hear about the current activities and future plans of OSEHRA.",
      "id":235
   },
   {
      "dtend":"20120719T174000",
      "dtstart":"20120719T170000",
      "dtstamp":"20120723T164629",
      "location":"E146",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23770",
      "uid":"http://oscon.com/--s2012-07-19-17:00--23770",
      "summary":"Nibbling at the heels of Commercial EMR",
      "description":"Presented by Mohamed Elmallah (Children's Hospital of Los Angeles). We have heard it before: \"All or nothing.\" But when it comes to replacing your Enterprise EMR, it might not be the case. Commercial EMR and Open Source can coexist, decoupling pieces from under the EMR closed platform to an Open Source stack. Opening new horizons to your customization and development effort, providing more functionality to your medical staff without burdening your upgrade path.",
      "id":236
   },
   {
      "dtend":"20120720T104000",
      "dtstart":"20120720T100000",
      "dtstamp":"20120723T001623",
      "location":"E146",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24263",
      "uid":"http://oscon.com/--s2012-07-20-10:00--24263",
      "summary":"What's the Matter With Sitting On Your Butt All Day?",
      "description":"Presented by Jason Levitt (Spirit.io). Various studies over the past decade are nearly universal in lambasting the office chair as the harbinger of a number of ills. But what's the alternative? In this session, we look at some popular alternatives to the traditional office chair including standing at a desk, treadmill desks, saddle seats, stools, kneeling chairs, the Swooper, and balance ball chairs.",
      "id":237
   },
   {
      "dtend":"20120720T114000",
      "dtstart":"20120720T110000",
      "dtstamp":"20120731T220537",
      "location":"E146",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24138",
      "uid":"http://oscon.com/--s2012-07-20-11:00--24138",
      "summary":"High Performance Network Programming on the JVM",
      "description":"Presented by Erik Onnen (Urban Airship). The JVM is capable of amazing network throughput and performance when used properly. Different languages (Java, Scala, Clojure), programming approaches (Asynchronous IO, Blocking IO) can greatly affect throughput and latency. This talk will draw on experience building networks of millions of devices to discuss best practices and contrast emerging idoms on the JVM.",
      "id":238
   },
   {
      "dtend":"20120720T123000",
      "dtstart":"20120720T115000",
      "dtstamp":"20120720T192332",
      "location":"E146",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24112",
      "uid":"http://oscon.com/--s2012-07-20-11:50--24112",
      "summary":"Hacking JavaFX with Groovy, Clojure, Scala, and Visage",
      "description":"Presented by Stephen Chin (Oracle). This presentation demonstrates the potential of using JavaFX 2 together with alternative languages such as Groovy, Clojure, and Scala. It also will showcase the successor to JavaFX Script, Visage, a DSL with features specifically targeted at helping create clean UIs.",
      "id":239
   },
   {
      "dtend":"20120718T200000",
      "dtstart":"20120718T190000",
      "dtstamp":"20120709T194652",
      "location":"E146",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26478",
      "uid":"http://oscon.com/--s2012-07-18-19:00--26478",
      "summary":"Messaging and Integration in PaaS-based solutions (Cloud Foundry)",
      "description":"A group discussion on the integration technologies needed in the new open Platform as a Service era - we've got mature data formats, messaging providers and protocols - what sorts of methods and techniques are useful, and what are we missing?",
      "id":240
   },
   {
      "dtend":"20120719T200000",
      "dtstart":"20120719T190000",
      "dtstamp":"20120711T175039",
      "location":"E146",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26507",
      "uid":"http://oscon.com/--s2012-07-19-19:00--26507",
      "summary":"MySQL Sharding Replication and Clustering",
      "description":"Presented by Peter Zaitsev (Percona Inc). If you're running MySQL on the large scales you're using MySQL at least some of the technologies on Clustering, Replication or Sharding.  Come to This BOF to share your experiences with different strategies, tools and technologies and learn what other people are doing",
      "id":241
   },
   {
      "dtend":"20120718T112000",
      "dtstart":"20120718T104000",
      "dtstamp":"20120724T173543",
      "location":"E147",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23281",
      "uid":"http://oscon.com/--s2012-07-18-10:40--23281",
      "summary":"Scaling to 100+ APIs",
      "description":"Presented by Joe Gregorio (Google). So you've shipped an API. But what if you had to ship over 100 APIs? Come hear the lessons Google learned, and the unique challenges we faced, as we scaled our system for developing and serving APIs from a handful to over 100.",
      "id":242
   },
   {
      "dtend":"20120718T121000",
      "dtstart":"20120718T113000",
      "dtstamp":"20120723T221327",
      "location":"E147",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23295",
      "uid":"http://oscon.com/--s2012-07-18-11:30--23295",
      "summary":"Open Data and Visualization in Smallest Federated Wiki",
      "description":"Presented by Ward Cunningham (Cunningham & Cunningham, Inc.). Federation lets you have your data and share it too. Learn how you can use this new wiki to provide or consume open data in an environment architected to make this safe and easy.",
      "id":243
   },
   {
      "dtend":"20120718T151000",
      "dtstart":"20120718T143000",
      "dtstamp":"20120725T203942",
      "location":"E147",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24134",
      "uid":"http://oscon.com/--s2012-07-18-14:30--24134",
      "summary":"The Secret Diaries of a Performance Tuning Superhero",
      "description":"Presented by Steve  Burton (AppDynamics). As applications become more distributed, virtual and elastic, many organizations are losing their grip on application performance and scalability. This session will use customer case studies to look at the biggest performance bottlenecks of the past year, as well as best practices around finding and troubleshooting them.",
      "id":244
   },
   {
      "dtend":"20120718T165000",
      "dtstart":"20120718T161000",
      "dtstamp":"20120725T203937",
      "location":"E147",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24399",
      "uid":"http://oscon.com/--s2012-07-18-16:10--24399",
      "summary":"Faster! Faster! Accelerate your business with blazing prototypes",
      "description":"Presented by Drew Engelson (Celerity). Bring your ideas to life! Convince your boss to that open source development is faster and cheaper than the \"safe\" COTS solution they probably hate anyway. Let's investigate ways to get real-life, functional prototypes up with blazing speed. We'll look at and compare tools for truly rapid development including Python, Django, Flask, PHP, Amazon EC2 and Heroku.",
      "id":245
   },
   {
      "dtend":"20120719T112000",
      "dtstart":"20120719T104000",
      "dtstamp":"20120725T204101",
      "location":"E147",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24437",
      "uid":"http://oscon.com/--s2012-07-19-10:40--24437",
      "summary":"EFF's mission to Encrypt the Web",
      "description":"Presented by Peter Eckersley (Electronic Frontier Foundation). EFF has a long-term plan to switch the insecure, unencrypted Web of 2009 over to an encrypted Web of 2013 or 2014.  This talk will summarize our methods, successes to date (including HTTPS Everywhere, the SSL Observatory, and the crazy things we had to do to get them to work as Firefox and Chrome extensions) and a number of research and protocol-development projects that are in the pipeline.",
      "id":246
   },
   {
      "dtend":"20120719T121000",
      "dtstart":"20120719T113000",
      "dtstamp":"20120729T234239",
      "location":"E147",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24380",
      "uid":"http://oscon.com/--s2012-07-19-11:30--24380",
      "summary":"Git For Ages 4 And Up",
      "description":"Presented by Michael Schwern (eval Empire). Learn how to think like a Git using nothing more than children's toys!  If you’re using git, but are uncomfortable with it and don’t really get it, this is for you. WARNING: CHOKING HAZARD – Small Parts. Not For Children Under 4 Years.",
      "id":247
   },
   {
      "dtend":"20120719T142000",
      "dtstart":"20120719T134000",
      "dtstamp":"20120726T053310",
      "location":"E147",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23901",
      "uid":"http://oscon.com/--s2012-07-19-13:40--23901",
      "summary":"Everything you ever wanted to know about deployment but were afraid to ask",
      "description":"Presented by Laura Thomson (Mozilla Corporation). Web developers dream of continuous deployment: new code in production without a hitch.  In this talk I'll cover the full story from building deployable code through working out a build and release process through continuous integration, automation, and continuous deployment.  We'll also look at deployment velocity and why CD might not be for you.",
      "id":248
   },
   {
      "dtend":"20120719T151000",
      "dtstart":"20120719T143000",
      "dtstamp":"20120723T171528",
      "location":"E147",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24141",
      "uid":"http://oscon.com/--s2012-07-19-14:30--24141",
      "summary":"Development is Production Too",
      "description":"Presented by John Goulah (Etsy), Erik Kastner (Etsy / Meta | ateM). Its common to discuss the production environment in public but it is a black art on how to construct the development environment correctly, in fact it is a common problem that development doesn’t closely mirror the production experience.  We will address why this is important,  some common anti-patterns, and how it can be done correctly.",
      "id":249
   },
   {
      "dtend":"20120719T165000",
      "dtstart":"20120719T161000",
      "dtstamp":"20120728T194748",
      "location":"E147",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24226",
      "uid":"http://oscon.com/--s2012-07-19-16:10--24226",
      "summary":"State of the MQ",
      "description":"Presented by Brian Clapper (Circonus, Inc.). Message Queues are a hot topic, but not all are created equal. After reviewing most of the popular choices, I will review my findings and offer suggestions for which to use when, and pros and cons of each.  On the list are RabbitMQ, Kafka, Apache Qpid, Kestrel, ZeroMQ and more as time permits.",
      "id":250
   },
   {
      "dtend":"20120719T174000",
      "dtstart":"20120719T170000",
      "dtstamp":"20120725T173856",
      "location":"E147",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23186",
      "uid":"http://oscon.com/--s2012-07-19-17:00--23186",
      "summary":"Demystifying REST",
      "description":"Presented by Kirsten Jones (Princess Polymath). Web services are everywhere!  I'll give you the context you need to use REST web services, and - more importantly - give you the tools you need to debug what's happening while you do. Attendees will be taught how to understand, sniff and debug HTTP traffic to debug web service calls.  They will be given a brief overview of REST web services and an overview of how OAuth authentication works.",
      "id":251
   },
   {
      "dtend":"20120720T104000",
      "dtstart":"20120720T100000",
      "dtstamp":"20120721T153318",
      "location":"E147",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23833",
      "uid":"http://oscon.com/--s2012-07-20-10:00--23833",
      "summary":"The Google Open Source Update",
      "description":"Presented by Carol Smith (Google, Inc.), Shawn Pearce (Google), Chris DiBona (Google, Inc.). In this talk we’ll talk about the years events in open source at Google, including a breakdown of the Google code-in project and an update on the Summer of Code. Also, we'll talk about how we dealt with hosting Android and Gerrit after the kernel.org hack.",
      "id":252
   },
   {
      "dtend":"20120720T114000",
      "dtstart":"20120720T110000",
      "dtstamp":"20120722T075523",
      "location":"E147",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24527",
      "uid":"http://oscon.com/--s2012-07-20-11:00--24527",
      "summary":"Will Microsoft ever get serious about Open Source?",
      "description":"Presented by Scott Hanselman (Microsoft). Will Microsoft ever get serious about Open Source? How does Microsoft design what is \"Open Source\" vs. \"Source Opened\"? Join Scott Hanselman from the Azure/ASP.NET/IIS team as he talks about what's going on in Open Source in the Angle Brackets and Curly Brackets space.",
      "id":253
   },
   {
      "dtend":"20120720T123000",
      "dtstart":"20120720T115000",
      "dtstamp":"20120728T194802",
      "location":"E147",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23272",
      "uid":"http://oscon.com/--s2012-07-20-11:50--23272",
      "summary":"Instantly Better Vim",
      "description":"Presented by Damian Conway (Thoughtstream). If you're one of the 50% of developers who uses vi/Vim on a regular basis, but you still only use the 5% of the editor features that you learned in school, this talk will offer you a dozen ways to instantly make your editing more efficient and productive.",
      "id":254
   },
   {
      "dtend":"20120718T200000",
      "dtstart":"20120718T190000",
      "dtstamp":"20120711T154131",
      "location":"E147",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26499",
      "uid":"http://oscon.com/--s2012-07-18-19:00--26499",
      "summary":"Training developers on how to contribute to free software projects",
      "description":"Contributing successfully to free software projects requires persistence, humility, and above all, good communication skills.  Upstream University will lead a discussion on how to teach these to aspiring contributors: can it be done?  If so, how?",
      "id":255
   },
   {
      "dtend":"20120718T112000",
      "dtstart":"20120718T104000",
      "dtstamp":"20120730T221406",
      "location":"F150",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24113",
      "uid":"http://oscon.com/--s2012-07-18-10:40--24113",
      "summary":"Concurrent Programming for Mobile Application: Is Android Up To The Challenge?",
      "description":"Presented by G. Blake Meike (Open Mobile World Wide). The mobile platform adds new challenges to concurrent programming making it much more like what used to be called \"real time programming\".  The Android OS addresses these challenges with three frameworks: a managed application lifecycle, the Looper class, and the AsyncTask template.  But is it enough?",
      "id":256
   },
   {
      "dtend":"20120718T121000",
      "dtstart":"20120718T113000",
      "dtstamp":"20120726T180040",
      "location":"F150",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23338",
      "uid":"http://oscon.com/--s2012-07-18-11:30--23338",
      "summary":"Remixing Android",
      "description":"Presented by Marko Gargenta (Marakana). Learn how to take vanilla Android, rip it open, remix it, and build a new image that can run on your device on choice. In this talk, we'll explore the black magic of Android internals. You will learn how to reconfigure the build system by adding our applications, services, daemons, or libraries. By the end of this talk, you should have basic understanding of creating a custom ROM.",
      "id":257
   },
   {
      "dtend":"20120718T142000",
      "dtstart":"20120718T134000",
      "dtstamp":"20120723T162122",
      "location":"F150",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23458",
      "uid":"http://oscon.com/--s2012-07-18-13:40--23458",
      "summary":"Android Security Essentials",
      "description":"Presented by Pragati Ogal Rai (PayPal). Android is the leading mobile operating system. With its growing popularity and adoption, it is important to understand the security architecture of Android so developers can secure their data and also protect the privacy and confidentiality of their users. This session discusses the overall Android security architecture and talks about different security artifacts provided by Android.",
      "id":258
   },
   {
      "dtend":"20120718T151000",
      "dtstart":"20120718T143000",
      "dtstamp":"20120720T083445",
      "location":"F150",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23957",
      "uid":"http://oscon.com/--s2012-07-18-14:30--23957",
      "summary":" Speech Enabling Android Applications",
      "description":"Presented by Simon MacDonald (IBM), Bryce Curtis (IBM). Learn about the android.speech package and enable Speech Recognition and Text to Speech functionality in your Android apps today. This presentation will give a brief overview of the basics and best practices of Speech Recognition. Then we will quickly put together an application using Speech Recognition for input and TTS for output that can answer almost any question you put to it. ",
      "id":259
   },
   {
      "dtend":"20120718T165000",
      "dtstart":"20120718T161000",
      "dtstamp":"20120730T101058",
      "location":"F150",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23146",
      "uid":"http://oscon.com/--s2012-07-18-16:10--23146",
      "summary":"MongoDB Geospatial and Android",
      "description":"Presented by Paul Scott (DSTV Online), Herman Smith (Touchlab). Build a MongoDB geospatial datastore using Creative Commons licensed world data and an Android client to consume the service for fun and profit!",
      "id":260
   },
   {
      "dtend":"20120718T174000",
      "dtstart":"20120718T170000",
      "dtstamp":"20120722T175320",
      "location":"F150",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24027",
      "uid":"http://oscon.com/--s2012-07-18-17:00--24027",
      "summary":"Building a Mobile, Offline Mapping Stack Using Open Tools & Data",
      "description":"Presented by Justin Miller (MapBox). This presentation will focus on a process for taking open data sources, turning them into beautiful custom maps, using them on mobile in an offline-capable way, and doing it all with entirely open source code.",
      "id":261
   },
   {
      "dtend":"20120719T112000",
      "dtstart":"20120719T104000",
      "dtstamp":"20120723T015208",
      "location":"F150",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23237",
      "uid":"http://oscon.com/--s2012-07-19-10:40--23237",
      "summary":"PhoneGap : Cross the Gap from HTML5 to Mobile",
      "description":"Presented by Paul Beusterien (Mobile Developer Solutions). Create, develop, and deploy mobile applications with JavaScript, HTML, and CSS using PhoneGap.",
      "id":262
   },
   {
      "dtend":"20120719T121000",
      "dtstart":"20120719T113000",
      "dtstamp":"20120726T180057",
      "location":"F150",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23840",
      "uid":"http://oscon.com/--s2012-07-19-11:30--23840",
      "summary":"jQuery: Mobile Sites That Feel Like Apps",
      "description":"Presented by Anna Filina (FooLab Inc.). jQuery Mobile is a cross-platform framework made for smartphones and tablets. With its HTML5 interface, it looks and feels like an app. This presentation will teach you how to quickly create a mobile front-end with little effort. It will also feature a use-case of adapting an existing web application to the mobile.",
      "id":263
   },
   {
      "dtend":"20120719T142000",
      "dtstart":"20120719T134000",
      "dtstamp":"20120726T180100",
      "location":"F150",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23198",
      "uid":"http://oscon.com/--s2012-07-19-13:40--23198",
      "summary":"Topics in Designing An Android Sensor Subsystem: Pitfalls and Considerations",
      "description":"Presented by Jen Costillo (Rebel Bot). A logical approach to designing an Android sensor subsystem within a consumer product. At the outset it appears simple but once tasked it is a monumental effort with several complex trade-offs. The approach covers vendor algorithms, power, and latency issues in addition to the overall end to end architecture (sensor selection though plumbing libraries into the sensor frameworks).",
      "id":264
   },
   {
      "dtend":"20120719T151000",
      "dtstart":"20120719T143000",
      "dtstamp":"20120722T174227",
      "location":"F150",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24161",
      "uid":"http://oscon.com/--s2012-07-19-14:30--24161",
      "summary":"Mobile 3D Visualization",
      "description":"Presented by Pat Marion (Kitware, Inc.), Utkarsh Ayachit (Kitware, Inc.). Advanced 3D visualization has long been relegated to powerful workstations or supercomputers. Recent efforts have extended the open source, scientific computing tools VTK and ParaView to run on the popular Android and iOS mobile platforms. This proposal shows how to run and interact with Big Data on mobile platforms, as well as perform advanced visualization directly on the mobile device.",
      "id":265
   },
   {
      "dtend":"20120719T165000",
      "dtstart":"20120719T161000",
      "dtstamp":"20120723T015305",
      "location":"F150",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23908",
      "uid":"http://oscon.com/--s2012-07-19-16:10--23908",
      "summary":"Progressive Enhancement on the Mobile Web",
      "description":"Presented by John Bender (Adobe Systems). Progressive Enhancement isn't important on the mobile web because all the browsers are Webkit right? Not so fast. Even among Webkit implementations events, css, and performance vary widely. We'll talk about the darker corners of the mobile web and show how jQuery Mobile can help you build sites that are reliable, accessible, and support more devices.",
      "id":266
   },
   {
      "dtend":"20120719T174000",
      "dtstart":"20120719T170000",
      "dtstamp":"20120722T201558",
      "location":"F150",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23083",
      "uid":"http://oscon.com/--s2012-07-19-17:00--23083",
      "summary":"Viewports: Handling the many screens on the Mobile Web",
      "description":"Presented by Joe Bowser (Adobe Systems). The mobile web is now the ubiquitious web.  Modern web developers building mobile web applications need to consider the many different devices with many screen sizes and densities.  This talk focuses on the different techniques on how to deal with this on the web, regardless of whether this app is a website or a native application built using a framework such as PhoneGap.",
      "id":267
   },
   {
      "dtend":"20120720T114000",
      "dtstart":"20120720T110000",
      "dtstamp":"20120726T184400",
      "location":"F150",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23333",
      "uid":"http://oscon.com/--s2012-07-20-11:00--23333",
      "summary":"The Current State of OAuth 2",
      "description":"Presented by Aaron Parecki (Geoloqi). If you've ever written any code to authenticate wtih Twitter, you may have been confused by all the signature methods and base strings. You'll be happy to know that OAuth 2 has vastly simplified the process, but at what cost?",
      "id":268
   },
   {
      "dtend":"20120720T123000",
      "dtstart":"20120720T115000",
      "dtstamp":"20120723T005916",
      "location":"F150",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23292",
      "uid":"http://oscon.com/--s2012-07-20-11:50--23292",
      "summary":"Hollywood Storytelling and the Web Development Process",
      "description":"Presented by George DeMet (Palantir.net, Inc.). In this session, we'll look at the website development process through the lens of Hollywood storytelling. We’ll examine how the narrative structure of various films compares to different process models for site development. And along the way, we'll talk about some best practices for delivering successful projects that are on time, on budget, and meet customer expectations.",
      "id":269
   },
   {
      "dtend":"20120717T170000",
      "dtstart":"20120717T090000",
      "dtstamp":"20120720T195347",
      "location":"F150",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24987",
      "uid":"http://oscon.com/--s2012-07-17-09:00--24987",
      "summary":"OpenStack Day",
      "description":"Join us for a day-long program exploring OpenStack, the open source cloud infrastructure platform. Originally founded at NASA and Rackspace, OpenStack has grown to be a global software community of developers collaborating on a standard and massively scalable open source cloud operating system.",
      "id":270
   },
   {
      "dtend":"20120716T170000",
      "dtstart":"20120716T133000",
      "dtstamp":"20120726T053642",
      "location":"F150",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26129",
      "uid":"http://oscon.com/--s2012-07-16-13:30--26129",
      "summary":"Getting Started with OpenStack",
      "description":"Presented by Monty Taylor (HP). Monty Taylor, manager of Automation and Deployment at HP, will be our guest speaker and will be running a lab session. This will be an in-depth, hands-on session on how to set-up OpenStack. We'll walk through setting up devstack, with the end result of creating a working OpenStack development environment by the end of the night.",
      "id":271
   },
   {
      "dtend":"20120718T112000",
      "dtstart":"20120718T104000",
      "dtstamp":"20120817T163818",
      "location":"F151",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26434",
      "uid":"http://oscon.com/--s2012-07-18-10:40--26434",
      "summary":"The Shared Learning Collaborative",
      "description":"Presented by Sharren Bates (Bill & Melinda Gates Foundation). The Shared Learning Collaborative (SLC) is building a set of shared technology services that will allow states and school districts to connect student data and education materials that currently exist in different formats and locations. Learn about the developing technology, including the technical specifications, data store, APIs and SDK, and address participant questions.",
      "id":272
   },
   {
      "dtend":"20120718T121000",
      "dtstart":"20120718T113000",
      "dtstamp":"20120727T163309",
      "location":"F151",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26307",
      "uid":"http://oscon.com/--s2012-07-18-11:30--26307",
      "summary":"How The Tools And Philosophies Of Open Source Will Save Education In The 21st Century",
      "description":"Presented by Kurt Bollacker (Applied Minds).  Our current public education system was built using industrial age thinking, and is now struggling to adapt to modern educational needs. Open Source philosophies\thave given us an information age of prosperity.  Recent developments mean we can finally use \"open source thinking\" to transform our educational system into a 21st century success- but it won't look much like it does today.",
      "id":273
   },
   {
      "dtend":"20120718T142000",
      "dtstart":"20120718T134000",
      "dtstamp":"20120727T163440",
      "location":"F151",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26107",
      "uid":"http://oscon.com/--s2012-07-18-13:40--26107",
      "summary":"Open Education Analytics Infrastructure: How we enable the next 10 years.",
      "description":"Presented by Greg Grossmeier (Creative Commons), Steve Midgley (US Department of Education). We've done it. We've created a ton of high quality OER. But how can that material enable a personalized learning environment? How do students find the best material for their unique needs and desires? The Learning Registry coupled with the new LRMI metadata standard provide that infrastructure. Come learn how you can improve your own learning platforms, or write the next generation.",
      "id":274
   },
   {
      "dtend":"20120718T151000",
      "dtstart":"20120718T143000",
      "dtstamp":"20120721T192118",
      "location":"F151",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26001",
      "uid":"http://oscon.com/--s2012-07-18-14:30--26001",
      "summary":"Big Little Boolean: The FERPA Restriction and You",
      "description":"Presented by Michael Brewer (UGA: Franklin College OIT). One of the many parts of the FERPA law is the ability of students to put a restriction on the release of their academic information. While this sounds simple enough, there are many powerful (and sometimes unforeseen) consequences of choosing the Restriction. In this session, we will discuss why you should add the field to your student records, why students opt in, and what side effects can happen.",
      "id":275
   },
   {
      "dtend":"20120718T165000",
      "dtstart":"20120718T161000",
      "dtstamp":"20120720T223809",
      "location":"F151",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/25210",
      "uid":"http://oscon.com/--s2012-07-18-16:10--25210",
      "summary":"Backyard Brains: Improving neuroscience education through open-source lessons and technology",
      "description":"Presented by Nathan Dotz (All Hands Active). We are bringing a previously unrepresented field, neuroscience, to K12 education with an unheard of method: we are open-sourcing everything. You'll learn how building upon open source technologies and using open licensing on our creations lets us do what no one else has -- bring neuroscience to primary education classrooms around the world!",
      "id":276
   },
   {
      "dtend":"20120718T174000",
      "dtstart":"20120718T170000",
      "dtstamp":"20120722T190718",
      "location":"F151",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26109",
      "uid":"http://oscon.com/--s2012-07-18-17:00--26109",
      "summary":"Designing Systems for Fluid Teacher Adoption",
      "description":"Presented by Jonathan Briggs (Eastside Preparatory School). Take a tour of 8 years of lessons learned building, assembling, purchasing and adapting an optimal online learning ecosystem at a forward thinking 5-12 independent school. Find out how to get rapid teacher adoption, maximize resources and influence instructional practices. We will also take a tour of how Eastside Prep's integrated systems support all levels of the school.",
      "id":277
   },
   {
      "dtend":"20120719T112000",
      "dtstart":"20120719T104000",
      "dtstamp":"20120825T224828",
      "location":"F151",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26353",
      "uid":"http://oscon.com/--s2012-07-19-10:40--26353",
      "summary":"We Are Superman: Transformative Capacities of Open Source Learning",
      "description":"Presented by David Preston (The Preston Group). Forget what you think you know about school and education policy: the unevenly distributed future is here.  Open source learning is no longer hypothetical.  Learners are using open source values, organizing principles and tools to construct experiences and networks that inspire, support achievement, and create previously unimagined opportunity for expansion.",
      "id":278
   },
   {
      "dtend":"20120719T121000",
      "dtstart":"20120719T113000",
      "dtstamp":"20120720T223954",
      "location":"F151",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26101",
      "uid":"http://oscon.com/--s2012-07-19-11:30--26101",
      "summary":"How Developers Can Transform K12 Education with UX",
      "description":"Presented by Bob Regan (Pearson Foundation). With so much digital content out there, why aren’t schools yet digital? It’s because so much educational software and experiences are hard to use, hard to find and hard to integrate with existing tools. Come discuss concrete ways developers can help to bootstrap the community of educators working to transform schools.",
      "id":279
   },
   {
      "dtend":"20120719T142000",
      "dtstart":"20120719T134000",
      "dtstamp":"20120721T004557",
      "location":"F151",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26436",
      "uid":"http://oscon.com/--s2012-07-19-13:40--26436",
      "summary":"Using OASIS DITA Learning Maps to Align with Standards and Model Learning Pathways",
      "description":"Presented by John Hunt (IBM). The Darwin Information Typing Architecture (DITA) is an OASIS specification that defines a set of XML doc types for authoring and organizing topic-oriented information, including maps to sequence topics and other resources into structured collections, and taxonomy-driven metadata to classify content. Attend this session to learn about DITA features supporting interop standards for K-12 education.",
      "id":280
   },
   {
      "dtend":"20120719T151000",
      "dtstart":"20120719T143000",
      "dtstamp":"20120720T224253",
      "location":"F151",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26435",
      "uid":"http://oscon.com/--s2012-07-19-14:30--26435",
      "summary":"Advancing the State of the Art in Formative Assessment Development and Distribution",
      "description":"Presented by Evan Eustace (CoreSpring). Development and exchange of formative assessments are hampered by inconsistent implementation of standards that do exist, and silo-ed data with static transfer between systems. CoreSpring,org is building an open library of formative assessment content aligned to new teaching standards, and a suite of tools and open APIs to facilitate development, distribution and data analysis.",
      "id":281
   },
   {
      "dtend":"20120719T165000",
      "dtstart":"20120719T161000",
      "dtstamp":"20120731T204244",
      "location":"F151",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/25978",
      "uid":"http://oscon.com/--s2012-07-19-16:10--25978",
      "summary":"Legitimizing interest based learning with Mozilla Open Badges",
      "description":"Presented by Tara Tiger Brown (UC Irvine), Chris McAvoy (Mozilla Foundation). Self directed, interest based learning needs validation, Mozilla's Open Badges Infrastructure opens learning accreditation to all. We'll cover the current thinking around interest based learning, and dive into the implementation details of the Mozilla Open Badges infrastructure, which provides a framework for recognizing and legitimizing self directed interest based learning.",
      "id":282
   },
   {
      "dtend":"20120719T174000",
      "dtstart":"20120719T170000",
      "dtstamp":"20120722T190221",
      "location":"F151",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/25219",
      "uid":"http://oscon.com/--s2012-07-19-17:00--25219",
      "summary":"Building an Ecosystem of FLOSS to Educate Students with Disabilities",
      "description":"Presented by Gerardo Capiel (Benetech). Benetech's Literacy program is revolutionizing access to educational materials for print disabled students (e.g. blind, dyslexic, quadraplegic).  It is accomplishing this goal by leveraging and contributing to an end-to-end ecosystem of FLOSS technologies to make sure that as the educational content landscape rapidly evolves print-disabled students are as “plugged-in” as their peers.",
      "id":283
   },
   {
      "dtend":"20120720T104000",
      "dtstart":"20120720T100000",
      "dtstamp":"20120724T181430",
      "location":"F151",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23862",
      "uid":"http://oscon.com/--s2012-07-20-10:00--23862",
      "summary":"Media and Video in the HTML5 Age",
      "description":"Presented by Andrew Davis (Kaltura, Inc.), Michael Dale (Kaltura, Wikimedia). We will cover the migration from Flash players to HTML5 and tools to support that transition. We will look at challenges of creating a consistent user experience with HTML5 video across devices. We will share insight from our html5video.org survey of industry leading open source players including benchmarks on performance and supported plugins.",
      "id":284
   },
   {
      "dtend":"20120720T114000",
      "dtstart":"20120720T110000",
      "dtstamp":"20120730T101337",
      "location":"F151",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24297",
      "uid":"http://oscon.com/--s2012-07-20-11:00--24297",
      "summary":"Assholes are Killing Your Project",
      "description":"Presented by Donnie Berkholz (RedMonk), Leslie Hawthorn (Red Hat). The strength of your community is the best predictor of your project's long-term viability. What happens when that community is gradually infiltrated by assholes, who infect everyone else with their constant negativity and personal attacks? This talk will teach you about the dramatic impact assholes are having on your organization today and will show you how you can begin to repair it.",
      "id":285
   },
   {
      "dtend":"20120720T123000",
      "dtstart":"20120720T115000",
      "dtstamp":"20120722T041729",
      "location":"F151",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24162",
      "uid":"http://oscon.com/--s2012-07-20-11:50--24162",
      "summary":"How To Multiply Your Community By A Factor Of X",
      "description":"Presented by Brian King (Briks Software), Benjamin Kerensa (Mozilla). Grow, Grow, Grow! People are the life-blood of Open Source Communities. Mozilla has always recognised this in regards to their own success, and are now undertaking a project to expand the community even further with the Mozilla Reps program. This talk will discuss the successes and challenges we have had, and our plans for continued momentum.",
      "id":286
   },
   {
      "dtend":"20120717T170000",
      "dtstart":"20120717T090000",
      "dtstamp":"20120628T171023",
      "location":"F151",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24988",
      "uid":"http://oscon.com/--s2012-07-17-09:00--24988",
      "summary":"Business Leadership Day",
      "description":"Presented by Kevin Shockey (Mis Tribus). So, you want to run a business; or, maybe you want to turn your Open Source project hobby into a day job.  What ever the reason you're reading the Business Leadership Day description, this one-day track has the basics to help bootstrap your business skills.",
      "id":287
   },
   {
      "dtend":"20120719T142000",
      "dtstart":"20120719T134000",
      "dtstamp":"20120728T043626",
      "location":"E141",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/23835",
      "uid":"http://oscon.com/--s2012-07-19-13:40--23835",
      "summary":"Ask A Google Engineer Anything",
      "description":"Presented by Chris DiBona (Google, Inc.). First done at OSCON 2010, we though this session was extremely useful in helping developers work better with Googlers and Google technology and we’ll be able answer most questions that they might be baffled about.",
      "id":288
   },
   {
      "dtend":"20120718T200000",
      "dtstart":"20120718T190000",
      "dtstamp":"20120615T232506",
      "location":"E141",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26322",
      "uid":"http://oscon.com/--s2012-07-18-19:00--26322",
      "summary":"OSU Open Source Lab",
      "description":"The Oregon State University Open Source Lab (OSUOSL) is the home of growing, high-impact open source communities. Its world-class hosting services enable the Linux operating system, Apache web server, the Drupal content management system and more than 160 other leading open source software project. Come meet the team behind the OSUOSL and learn about what we do!",
      "id":289
   },
   {
      "dtend":"20120718T142000",
      "dtstart":"20120718T134000",
      "dtstamp":"20120726T211252",
      "location":"E141",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26343",
      "uid":"http://oscon.com/--s2012-07-18-13:40--26343",
      "summary":"Designing for DevOps: Building Ops at New Relic",
      "description":"Presented by Chris Kelly (New Relic). If you can build a DevOps team from the ground up, what would it look like? How do you hire for DevOps? What tools do you use? What about culture and process? We'll share our experiences from building an operations team designed for DevOps.",
      "id":290
   },
   {
      "dtend":"20120718T112000",
      "dtstart":"20120718T104000",
      "dtstamp":"20120722T011743",
      "location":"E141",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26375",
      "uid":"http://oscon.com/--s2012-07-18-10:40--26375",
      "summary":"A Deeper Look at the Enyo JavaScript Framework",
      "description":"Presented by Dave Freeman (Hewlett Packard). In this session, we will explore the ideas behind the Enyo framework, a new JavaScript framework that takes the ideas of encapsulation and reusable code objects into the web application and mobile worlds.  We will also explore the ecosystem of new libraries build on the Enyo core, especially the Onyx user-interface system which was designed to be beautiful and usable across multiple platforms.",
      "id":291
   },
   {
      "dtend":"20120718T151000",
      "dtstart":"20120718T143000",
      "dtstamp":"20120720T220644",
      "location":"E141",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26403",
      "uid":"http://oscon.com/--s2012-07-18-14:30--26403",
      "summary":"Alfresco: An Open Source Platform for Content Management, On-Premise or in the Cloud",
      "description":"Presented by Jeff Potts (Alfresco Software). Find out how Java-based Alfresco, a rich content repository that is open source and fully standards compliant, can be a building block in your architecture for content-heavy solutions. We'll explore different patterns of implementation in order to get you started on your next project. Includes live demos and code snippets.",
      "id":292
   },
   {
      "dtend":"20120719T112000",
      "dtstart":"20120719T104000",
      "dtstamp":"20120720T040150",
      "location":"E141",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26374",
      "uid":"http://oscon.com/--s2012-07-19-10:40--26374",
      "summary":"Why Open Matters: HP Cloud Services Designed With OpenStack™ Technology",
      "description":"Presented by Blake Yeager (Hewlett Packard). HP’s public cloud is built on OpenStack open-source cloud technology. The OpenStack project has rapidly been adopted as the leading open source cloud solution because it avoids vendor lock-in, and is ubiquitous across public, managed and private clouds.",
      "id":293
   },
   {
      "dtend":"20120717T123000",
      "dtstart":"20120717T090000",
      "dtstamp":"20120719T215729",
      "location":"E141",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26400",
      "uid":"http://oscon.com/--s2012-07-17-09:00--26400",
      "summary":"From Datacenter to the Cloud - Featuring Xen and XCP (Sponsored Tutorial)",
      "description":"Presented by George Dunlap (Citrix Systems, UK), Steven Maresca (Zentific LLC), Josh West (One.com), Patrick F. Wilbur (PFW Research LLC). Do you dream of spinning up ten, twenty, or a thousand virtual machines in an instant? Discover and repair bottlenecks without moving a finger? Dodge the loss of an entire storage array with no-one noticing? This is no sales pitch; during this tutorial, we'll demonstrate how to leverage truly FOSS tools to build a powerful, scalable cloud that easily competes with those proprietary solutions!",
      "id":294
   },
   {
      "dtend":"20120719T121000",
      "dtstart":"20120719T113000",
      "dtstamp":"20120720T040153",
      "location":"E141",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26442",
      "uid":"http://oscon.com/--s2012-07-19-11:30--26442",
      "summary":"Spring in the Cloud",
      "description":"Presented by Josh Long (Pivotal). Let's face it, the cloud's here to stay. Spring's always been about portability and choice, and the cloud is no different. Join Josh Long as he introduces how to use Cloud Foundry and Spring.",
      "id":295
   },
   {
      "dtend":"20120719T151000",
      "dtstart":"20120719T143000",
      "dtstamp":"20120720T011618",
      "location":"E141",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26454",
      "uid":"http://oscon.com/--s2012-07-19-14:30--26454",
      "summary":"Building A Test/Dev Cloud With Apache CoudStack - Part 1",
      "description":"Presented by David Nalley (Apache CloudStack (incubating)). Come learn about Apache CloudStack, its architecture, and how to deploy it - and then how to connect it to your configuration management system and continuous integration to achieve an incredibly robust and flexible dev/test environment.",
      "id":296
   },
   {
      "dtend":"20120719T165000",
      "dtstart":"20120719T161000",
      "dtstamp":"20120720T011527",
      "location":"E141",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26417",
      "uid":"http://oscon.com/--s2012-07-19-16:10--26417",
      "summary":"Building A Test/Dev Cloud With Apache CloudStack - Part 2",
      "description":"Presented by David Nalley (Apache CloudStack (incubating)). Come learn about Apache CloudStack, its architecture, and how to deploy it - and then how to connect it to your configuration management system and continuous integration to achieve an incredibly robust and flexible dev/test environment.",
      "id":297
   },
   {
      "dtend":"20120717T170000",
      "dtstart":"20120717T133000",
      "dtstamp":"20120720T010042",
      "location":"E141",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26433",
      "uid":"http://oscon.com/--s2012-07-17-13:30--26433",
      "summary":"Hacking on Apache CloudStack (Sponsored Tutorial)",
      "description":"Presented by Chiradeep Vittal (Citrix Systems). Apache CloudStack is an infrastructure-as-a-service platform used to deploy Amazon-style cloud computing environments, in this session developers will learn abou the  architecture, plugin framework, and how to get involved in the Apache CloudStack project.",
      "id":298
   },
   {
      "dtend":"20120718T121000",
      "dtstart":"20120718T113000",
      "dtstamp":"20120724T222204",
      "location":"E141",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26456",
      "uid":"http://oscon.com/--s2012-07-18-11:30--26456",
      "summary":"Open Source in the Enterprise: Billing and Payment Processing Systems",
      "description":"Presented by Jason Hall (Bluehost). In this talk, Jason Hall will discuss the problems that every developer misses, why your finance gets frustrated, and the marketing team cries about your existing billing code. He will also show you how to avoid problems by utilizing existing open source billing toolkits like Freeside as the base of your billing and payments system.",
      "id":299
   },
   {
      "dtend":"20120719T200000",
      "dtstart":"20120719T190000",
      "dtstamp":"20120720T153435",
      "location":"E141",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26438",
      "uid":"http://oscon.com/--s2012-07-19-19:00--26438",
      "summary":"Geek Choir",
      "description":"In which we sing, discuss FLOSS tools for music creation, sing, talk about various music public domain archives, and sing.",
      "id":300
   },
   {
      "dtend":"20120720T123000",
      "dtstart":"20120720T100000",
      "dtstamp":"20120729T210541",
      "location":"E141",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26466",
      "uid":"http://oscon.com/--s2012-07-20-10:00--26466",
      "summary":"Lockpicking Play Room",
      "description":"Lockpicking is fun for everyone and demystifies simple mechanical puzzles that we all rely on. Join representatives from the local Portland TOOOL (Open Organization Of Lockpickers) group and sharpen your lockpicking skills.",
      "id":301
   },
   {
      "dtend":"20120718T174000",
      "dtstart":"20120718T170000",
      "dtstamp":"20120808T234138",
      "location":"E141",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26482",
      "uid":"http://oscon.com/--s2012-07-18-17:00--26482",
      "summary":"Building Functional Hybrid Apps For The iPhone And Android",
      "description":"Presented by Carlos Andreu (IBM), Michael Thompson (IBM). Watch as we show you how to rapidly build a functional hybrid mobile app starting from conception to a working application for iOS and Android devices – with time left over to discuss various deployment challenges to developing hybrid applications.",
      "id":302
   },
   {
      "dtend":"20120718T121000",
      "dtstart":"20120718T113000",
      "dtstamp":"20120724T141739",
      "location":"E142",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/25828",
      "uid":"http://oscon.com/--s2012-07-18-11:30--25828",
      "summary":"The HipHop Virtual Machine: PHP Execution At The Speed Of JIT",
      "description":"Presented by Jason Evans (Facebook). The HipHop Virtual Machine (hhvm) is a mostly compatible PHP implementation that Facebook is actively developing.",
      "id":303
   },
   {
      "dtend":"20120718T142000",
      "dtstart":"20120718T134000",
      "dtstamp":"20120724T140545",
      "location":"E142",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/25980",
      "uid":"http://oscon.com/--s2012-07-18-13:40--25980",
      "summary":"Running MongoDB for High Availability",
      "description":"Presented by Greg Brockman (Stripe). Applications are only as reliable as the database they use. At Stripe, we've developed a set of practical techniques for running MongoDB without downtime even in the face of catastophic machine failure. This session will cover a range of these techniques (and the tales behind their development).",
      "id":304
   },
   {
      "dtend":"20120718T112000",
      "dtstart":"20120718T104000",
      "dtstamp":"20120720T225812",
      "location":"E142",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26087",
      "uid":"http://oscon.com/--s2012-07-18-10:40--26087",
      "summary":"Massively Scalable NoSQL with Apache Cassandra",
      "description":"Presented by Jonathan Ellis (DataStax, Inc). This session will explain how Apache Cassandra meets OLTP big data needs, and its relationship with big data analytics. Jonathan will explain why Cassandra is the leading big data OLTP solution and how Cassandra delivers linear scale-out capabilities with true high availability, with examples from real-world production use cases.",
      "id":305
   },
   {
      "dtend":"20120719T121000",
      "dtstart":"20120719T113000",
      "dtstamp":"20120731T203950",
      "location":"E142",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26156",
      "uid":"http://oscon.com/--s2012-07-19-11:30--26156",
      "summary":"ElasticSearch, Your New Best Friend",
      "description":"Presented by Harold Hannon (SoftLayer Technologies). So you have a ton of data that you need to search efficiently. How do you do it?  Make friends with search. Index and search solutions can provide distinct advantages over traditional RDBMS systems for storing and querying large data sets. Learn how to leverage elasticsearch, an open source search solution, for fast and painless indexing and querying  of data.",
      "id":306
   },
   {
      "dtend":"20120719T142000",
      "dtstart":"20120719T134000",
      "dtstamp":"20120724T215558",
      "location":"E142",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26191",
      "uid":"http://oscon.com/--s2012-07-19-13:40--26191",
      "summary":"DRBD -- High Availability Storage Replication for Today and Tomorrow",
      "description":"Presented by Cooper Stevenson (LINBIT). In this session Cooper Stevenson will present DRBD, the Linux kernel  approved high availability storage replication solution.",
      "id":307
   },
   {
      "dtend":"20120717T170000",
      "dtstart":"20120717T133000",
      "dtstamp":"20120723T010007",
      "location":"E142",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26182",
      "uid":"http://oscon.com/--s2012-07-17-13:30--26182",
      "summary":"Service Orchestration with Ubuntu in the Cloud (Sponsored Tutorial)",
      "description":"Presented by Jorge Castro (Canonical Ltd. / Ubuntu). Deploying things at scale can get hard and complicated, wouldn't it be nice if deploying services was as easy as using apt-get? With Ubuntu and juju you can deploy over 80 services to AWS, HP Cloud, OpenStack, or bare metal with really simple commands. This talk will show you what juju is, how it works, and how it can save you time by showing you how to write juju charms.",
      "id":308
   },
   {
      "dtend":"20120718T200000",
      "dtstart":"20120718T190000",
      "dtstamp":"20120615T192150",
      "location":"E142",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26334",
      "uid":"http://oscon.com/--s2012-07-18-19:00--26334",
      "summary":"OpenSocial State of the Union",
      "description":"A state of the union on OpenSocial.",
      "id":309
   },
   {
      "dtend":"20120719T151000",
      "dtstart":"20120719T143000",
      "dtstamp":"20120720T163730",
      "location":"E142",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26388",
      "uid":"http://oscon.com/--s2012-07-19-14:30--26388",
      "summary":"Adventures in Deploying Private Paas on the Open Cloud: Tales from the Enterprise",
      "description":"Presented by Jeff Hobbs (ActiveState), Diane Mueller (ActiveState). In this presentation, ActiveState CTO Jeff Hobbs and Cloud Evangelist Diane Mueller discuss the challenges, drama, and realities of deploying private Platform as a Service (PaaS) on OpenStack and CloudStack.",
      "id":310
   },
   {
      "dtend":"20120717T123000",
      "dtstart":"20120717T090000",
      "dtstamp":"20120724T190647",
      "location":"E142",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26404",
      "uid":"http://oscon.com/--s2012-07-17-09:00--26404",
      "summary":"Build your Own Platform-as-a-Service (PaaS), Just like Red Hat's (Sponsored Tutorial)",
      "description":"Presented by Mark Atwood (HP Cloud Services), Krishna Raman (Red Hat). Here's your chance to learn how to build your own Platform-as-a-Service (PaaS). Come check out this session with Krishna and Mark from the OpenShift team and learn how to install, configure and deploy OpenShift Origin - the open source project that powers the OpenShift service - on your laptop.",
      "id":311
   },
   {
      "dtend":"20120718T165000",
      "dtstart":"20120718T161000",
      "dtstamp":"20120719T172721",
      "location":"E142",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26511",
      "uid":"http://oscon.com/--s2012-07-18-16:10--26511",
      "summary":" Taking the Guesswork Out of Implementing Hadoop",
      "description":"Presented by Audrey Ng (Hewlett-Packard), Steve Watt (Hewlett-Packard). Apache Hadoop is clearly one of the fastest growing big data platforms used by enterprises to store and analyze arbitrarily structured data  in search of business insights. However, Hadoop systems are challenging to configure, manage and scale, and Hadoop expertise is hard to find.",
      "id":312
   },
   {
      "dtend":"20120719T112000",
      "dtstart":"20120719T104000",
      "dtstamp":"20120720T002929",
      "location":"E142",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26457",
      "uid":"http://oscon.com/--s2012-07-19-10:40--26457",
      "summary":"Open Source in the Enterprise: Telecommunications and Contact Centers",
      "description":"Presented by Jared Smith (Bluehost). In his talk, Jared Smith will talk about telecommunications systems built on open source software, and how they can give you better productivity and agility, all while saving you money.  He'll also highlight Bluehost's use of open source software to run its contact centers.",
      "id":313
   },
   {
      "dtend":"20120718T151000",
      "dtstart":"20120718T143000",
      "dtstamp":"20120712T032706",
      "location":"E142",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26474",
      "uid":"http://oscon.com/--s2012-07-18-14:30--26474",
      "summary":"Open Innovation on Demand",
      "description":"Presented by John Igoe (Dell), Winston Damarillo (Morphlabs), Russell P. Reeder (Media Temple, Inc.). Open source software is not just fueling innovation, but leading it, according to a recent 451 Group survey. It's leading innovation in cloud and big data, as well as creating innovative business models such as Open SaaS. In this session, John Igoe, executive director of Dell's open source Cloud and Big Data Solutions, will talk about this exciting new era of open innovation on demand.",
      "id":314
   },
   {
      "dtend":"20120719T200000",
      "dtstart":"20120719T190000",
      "dtstamp":"20120709T185328",
      "location":"E142",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26473",
      "uid":"http://oscon.com/--s2012-07-19-19:00--26473",
      "summary":"xmonad",
      "description":"Many Linux desktop environments try to be easy to use for the average user, but that's not you. You're at your computer all day writing code; you don't want to mess around with _dragging windows_ or (ugh) watching _animated transitions_. Stop by to discuss a great solution to this problem: the tiling window manager xmonad. Free yourself from the tyranny of the mouse.",
      "id":315
   },
   {
      "dtend":"20120719T165000",
      "dtstart":"20120719T161000",
      "dtstamp":"20120720T040222",
      "location":"E142",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26503",
      "uid":"http://oscon.com/--s2012-07-19-16:10--26503",
      "summary":"How X.commerce is building a platform on open source",
      "description":"Presented by Saranyan Vigraham (x.commerce). X.commerce is a new business unit in the eBay Inc. family that is revolutionizing commerce for consumers, merchants and developers. In this presentation, we will look at how our technology strategy aligns with open source principles and how open source is helping X.commerce achieve its vision, with both technical solutions and a community-driven strategy.",
      "id":316
   },
   {
      "dtend":"20120718T142000",
      "dtstart":"20120718T134000",
      "dtstamp":"20120726T231201",
      "location":"E143",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/25963",
      "uid":"http://oscon.com/--s2012-07-18-13:40--25963",
      "summary":"Life After Sharding: Monitoring and Managing a Complex Data Cloud",
      "description":"Presented by Boris Livshutz (Appdynamics). Data systems have struggled to keep up with the rapid growth of application data. As a result, many have turned to sharding their data as a solution. These new complex systems or \"data clouds\" present a new array of challenges. In this session we'll discuss best practices around monitoring and managing your data cloud.",
      "id":317
   },
   {
      "dtend":"20120719T112000",
      "dtstart":"20120719T104000",
      "dtstamp":"20120808T155529",
      "location":"E143",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26347",
      "uid":"http://oscon.com/--s2012-07-19-10:40--26347",
      "summary":"Wrangling Logs with Logstash and ElasticSearch",
      "description":"Presented by Nate Jones (Media Temple), David Castro (Media Temple). Learn how to use open source to build an enterprise grade log processing and searching solution that scales.  We’ll cover the challenges and all the software that makes a diy solution possible:  logstash, elasticsearch, rabbitmq and Kibana.  We’ll cover a practical use case with examples and provide you with everything you need to get up and running.",
      "id":318
   },
   {
      "dtend":"20120718T151000",
      "dtstart":"20120718T143000",
      "dtstamp":"20120721T005927",
      "location":"E143",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26356",
      "uid":"http://oscon.com/--s2012-07-18-14:30--26356",
      "summary":"How to Write Compilers and Optimizers (and solve Data Transformation Problems)",
      "description":"Presented by Shevek . (Nebula). Compilers don't just turn C into binary, they transform data, and the optimizer is a critical decision-maker in the process. If we understand both, we can often solve tedious data transformation, scheduling or logic problems with very little effort. This presentation will teach you the magic, and convey a wealth of experience. Attendees have been known to subsequently write compilers.",
      "id":319
   },
   {
      "dtend":"20120718T112000",
      "dtstart":"20120718T104000",
      "dtstamp":"20120723T211448",
      "location":"E143",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26386",
      "uid":"http://oscon.com/--s2012-07-18-10:40--26386",
      "summary":"Logging as Event Streams",
      "description":"Presented by Brandon Philips (Rackspace, Inc). Logging infrastructures have traditionally been centered around building human readable logging, but as systems have grown, the volume of log data is impractical for a human to consume.",
      "id":320
   },
   {
      "dtend":"20120719T142000",
      "dtstart":"20120719T134000",
      "dtstamp":"20120720T040208",
      "location":"E143",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26401",
      "uid":"http://oscon.com/--s2012-07-19-13:40--26401",
      "summary":"Drupal Commerce: Changing The Course Of eCommerce",
      "description":"Presented by Mike O'Connor (Commerce Guys). With over 15,000 sites in operation right now, Drupal Commerce is changing the course of how eCommerce is done, allowing E-retailers to break the mold of the catalog-and-checkout process, while remaining true to its community roots. This session will provide a point of view on the new innovations of eCommerce and how Drupal Commerce is becoming the framework of choice for eCommerce innovators.",
      "id":321
   },
   {
      "dtend":"20120718T121000",
      "dtstart":"20120718T113000",
      "dtstamp":"20120721T001557",
      "location":"E143",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26439",
      "uid":"http://oscon.com/--s2012-07-18-11:30--26439",
      "summary":"Why The Sequel To NoSQL Is SQL",
      "description":"Presented by Ori Herrnstadt (Akiban). If you are thinking of implementing noSQL because you have no alternative, we’ll show you how to drop Akiban Server into your existing application & solve problematic SQL queries w/o investing in an entirely new approach to storing data. Your applications operate on Objects - we will demonstrate how much performance can be gained when you remove the SQL impedance mismatch with the Akiban Server.",
      "id":322
   },
   {
      "dtend":"20120719T121000",
      "dtstart":"20120719T113000",
      "dtstamp":"20120720T012016",
      "location":"E143",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26489",
      "uid":"http://oscon.com/--s2012-07-19-11:30--26489",
      "summary":"Design and Debug HTML5 Apps for Devices with Rapid Interface Builder (RIB) and Web Simulator",
      "description":"Presented by Gail Frederick (Intel). Learn how to build UI for and debug HTML5 apps for mobile devices using Rapid Interface Builder (RIB) and Web Simulator, two open-source tools recently released by Intel.  This session dives deep into the feature sets of both Web app developer tools, with demos, and shows you how you can influence the future of these open-source projects.",
      "id":323
   },
   {
      "dtend":"20120719T200000",
      "dtstart":"20120719T190000",
      "dtstamp":"20120723T165714",
      "location":"E143",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26477",
      "uid":"http://oscon.com/--s2012-07-19-19:00--26477",
      "summary":"Lightweight messaging for the Internet of Things",
      "description":"A discussion about MQTT, a popular lightweight messaging protocol open sourced through the Eclipse Foundation, and used in a variety of mobile and embedded device applications (from automated mousetraps, to tweeting ferries, and Facebook Messenger).",
      "id":324
   },
   {
      "dtend":"20120719T151000",
      "dtstart":"20120719T143000",
      "dtstamp":"20120720T140532",
      "location":"E143",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26490",
      "uid":"http://oscon.com/--s2012-07-19-14:30--26490",
      "summary":"Working with Python 2.6 and 3.2 on the same machine (without virtualenv)",
      "description":"Presented by Langdon White (Red Hat). Have you ever needed to work on applications in two different versions of the same language at the same time? There are many ways to do this, most of which involve a lot of mechanics or are custom to a single language or both.",
      "id":325
   },
   {
      "dtend":"20120718T210000",
      "dtstart":"20120718T200000",
      "dtstamp":"20120719T070920",
      "location":"E143",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26437",
      "uid":"http://oscon.com/--s2012-07-18-20:00--26437",
      "summary":"EDU BOF",
      "description":"A gathering to discuss issues with FLOSS in EDU (K-12 and post-secondary).",
      "id":326
   },
   {
      "dtend":"20120718T200000",
      "dtstart":"20120718T190000",
      "dtstamp":"20120717T172838",
      "location":"E143",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26539",
      "uid":"http://oscon.com/--s2012-07-18-19:00--26539",
      "summary":"Spatial In The Cloud: 0- Awesome in 5 minutes",
      "description":"We are going to talk some about how to get a spatial application (FourSquare or Google Maps)  running on the cloud for free. We will talk about OpenShift and plenty of other options. Some +s and -s will also be covered. We can also walk through getting it running - so bring your laptop!",
      "id":327
   },
   {
      "dtend":"20120717T123000",
      "dtstart":"20120717T090000",
      "dtstamp":"20120724T190639",
      "location":"E148",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26495",
      "uid":"http://oscon.com/--s2012-07-17-09:00--26495",
      "summary":"GlusterFS Tutorial - Part 1: Gluster Overview",
      "description":"Presented by Anand Babu (Gluster), John Mark Walker (Gluster). GlusterFS is a community produced, open source, distributed file system capable of scaling to several petabytes(actually, 72 brontobytes!) and handling thousands of clients. The morning tutorial will provide attendees with a broad and deep overview of GlusterFS, from history and roadmap to the latest release, v 3.3.",
      "id":328
   },
   {
      "dtend":"20120717T170000",
      "dtstart":"20120717T133000",
      "dtstamp":"20120723T010108",
      "location":"E148",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26496",
      "uid":"http://oscon.com/--s2012-07-17-13:30--26496",
      "summary":"Gluster FS Tutorial - Part 2: Gluster and Big Data; Gluster for Devs and Sys Admins",
      "description":"Presented by Dustin Black (Red Hat), Anand Avati (Red Hat). GlusterFS is a community produced, open source, distributed file system capable of scaling  to several petabytes(actually, 72 brontobytes!) and handling thousands of clients. The afternoon session of the GlusterFS tutorial will focus on Gluster implementation as a big data solution, development platform and tool for systems administrators.",
      "id":329
   },
   {
      "dtend":"20120717T180000",
      "dtstart":"20120717T170000",
      "dtstamp":"20120725T202821",
      "location":"Expo Hall",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24989",
      "uid":"http://oscon.com/--s2012-07-17-17:00--24989",
      "summary":"Expo Hall Opening Reception (sponsored by Bluehost)",
      "description":"Grab a drink and kick off the 14th edition of OSCON by meeting and mingling with exhibitors and fellow attendees.",
      "id":330
   },
   {
      "dtend":"20120718T190000",
      "dtstart":"20120718T174000",
      "dtstamp":"20120725T203947",
      "location":"Expo Hall",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24993",
      "uid":"http://oscon.com/--s2012-07-18-17:40--24993",
      "summary":"Booth Crawl",
      "description":"Quench your thirst with vendor-hosted libations and snacks while you check out all the cool stuff in the expo hall.",
      "id":331
   },
   {
      "dtend":"20120718T174000",
      "dtstart":"20120718T100000",
      "dtstamp":"20120720T233010",
      "location":"Expo Hall",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/25211",
      "uid":"http://oscon.com/--s2012-07-18-10:00--25211",
      "summary":"Wednesday Expo Hall Activities",
      "description":"From products, projects, and parties to snacks, swag, and speakers, the 2012 OSCON Expo Hall will be the place to gather outside of sessions on Wednesday and Thursday. Test drive new tools, compare products, meet with nonprofit volunteers, say hello to speakers and authors, get your Make on, hang out in the lounge, and much more.",
      "id":332
   },
   {
      "dtend":"20120719T170000",
      "dtstart":"20120719T100000",
      "dtstamp":"20120720T035934",
      "location":"Expo Hall",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/25227",
      "uid":"http://oscon.com/--s2012-07-19-10:00--25227",
      "summary":"Thursday Expo Hall Activities",
      "description":"From products, projects, and parties to snacks, swag, and speakers, the 2012 OSCON Expo Hall will be the place to gather outside of sessions on Wednesday and Thursday. Test drive new tools, compare products, meet with nonprofit volunteers, say hello to speakers and authors, get your Make on, hang out in the lounge, and much more.",
      "id":333
   },
   {
      "dtend":"20120716T190000",
      "dtstart":"20120716T173000",
      "dtstamp":"20120726T054454",
      "location":"Portland Ballroom",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24990",
      "uid":"http://oscon.com/--s2012-07-16-17:30--24990",
      "summary":"Ignite OSCON",
      "description":"If you had five minutes on stage what would you say? What if you only got 20 slides and they rotated automatically after 15 seconds? Would you pitch a project? Launch a web site? Teach a hack? We’re going to find out when we conduct our third Ignite event at OSCON.",
      "id":334
   },
   {
      "dtend":"20120718T085000",
      "dtstart":"20120718T084500",
      "dtstamp":"20120726T224627",
      "location":"Portland Ballroom",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/25035",
      "uid":"http://oscon.com/--s2012-07-18-08:45--25035",
      "summary":"Opening Welcome",
      "description":"Presented by Edd Dumbill (Silicon Valley Data Science), Sarah Novotny (Meteor Entertainment), Sam Adams (City of Portland, Oregon). Opening remarks by Portland Mayor Sam Adams, as well as OSCON program chairs, Sarah Novotny and Edd Dumbill.",
      "id":335
   },
   {
      "dtend":"20120718T090500",
      "dtstart":"20120718T085000",
      "dtstamp":"20120726T224751",
      "location":"Portland Ballroom",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24859",
      "uid":"http://oscon.com/--s2012-07-18-08:50--24859",
      "summary":"The Science of Open Source Community Management",
      "description":"Presented by David Eaves (Eaves Consulting). An open source community depends on its capacity to attract people and the efficiency with which it can harness their energy to create great software. While a compelling mission or killer product can be helpful, effective communities must be responsive and efficient in managing the diverse needs and demands of its members.",
      "id":336
   },
   {
      "dtend":"20120718T092000",
      "dtstart":"20120718T090500",
      "dtstamp":"20120808T154712",
      "location":"Portland Ballroom",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/25873",
      "uid":"http://oscon.com/--s2012-07-18-09:05--25873",
      "summary":"The Learning Map",
      "description":"Presented by Danny Hillis (Applied Minds, LLC). Applied Minds CEO, Danny Hillis will offer an introduction to The Learning Map, a Shared Learning Collaborative initiative organizing online learning material to get the right content to the right student at the right time.",
      "id":337
   },
   {
      "dtend":"20120718T093500",
      "dtstart":"20120718T092000",
      "dtstamp":"20120728T042841",
      "location":"Portland Ballroom",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24860",
      "uid":"http://oscon.com/--s2012-07-18-09:20--24860",
      "summary":"The Mudslide Hypothesis of Science",
      "description":"Presented by Kaitlin Thaney (Digital Science). The Web has transformed not only the way we approach modern day science, but a number of other facets of the research cycle: tools for analysis, mediums which now serve as “information inputs”, how we exchange ideas and even discover knowledge. Yet despite the pieces being there, changing practice is like trying to shake a castle.",
      "id":338
   },
   {
      "dtend":"20120718T095000",
      "dtstart":"20120718T093500",
      "dtstamp":"20120728T042845",
      "location":"Portland Ballroom",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26452",
      "uid":"http://oscon.com/--s2012-07-18-09:35--26452",
      "summary":"Scaling OpenStack Technology. Lessons From The Field",
      "description":"Presented by Brian Aker (HP). In this keynote, Brian Aker, HP Fellow,  will share challenges and best practices from his work with OpenStack software, including how a rich set of APIs must be developed in order to drive broad platform adoption as well as the need for formal APIs.",
      "id":339
   },
   {
      "dtend":"20120718T101000",
      "dtstart":"20120718T095000",
      "dtstamp":"20120729T233843",
      "location":"Portland Ballroom",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/25028",
      "uid":"http://oscon.com/--s2012-07-18-09:50--25028",
      "summary":"The Clothesline Paradox and the Sharing Economy",
      "description":"Presented by Tim O'Reilly (O'Reilly Media, Inc.). Open source software was one of the earliest successful examples of a sharing economy that has had huge economic impact. But as alternative energy advocate Steve Baer once noted, ecosystem services are often ignored in economic analysis: when you put your clothes in the dryer the energy you use is measured and counted, but when you hang them on the line, they disappear from the measured economy.",
      "id":340
   },
   {
      "dtend":"20120719T093000",
      "dtstart":"20120719T090500",
      "dtstamp":"20120728T043218",
      "location":"Portland Ballroom",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24861",
      "uid":"http://oscon.com/--s2012-07-19-09:05--24861",
      "summary":"Making Magic From Cloud To Client",
      "description":"Presented by Mark R.  Shuttleworth (Canonical Ltd.). Seamless work and play across phones, tablet and desktops is the goal of Ubuntu's design efforts. Mark will demo some of the latest inventions in UX in Ubuntu, preview new features that will land in 12.10, and outline the key areas of research and discovery as we move into a world where \"personal computing\" is being redefined and reinvented.",
      "id":341
   },
   {
      "dtend":"20120719T090500",
      "dtstart":"20120719T090000",
      "dtstamp":"20120725T204022",
      "location":"Portland Ballroom",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/25037",
      "uid":"http://oscon.com/--s2012-07-19-09:00--25037",
      "summary":"Thursday Welcome",
      "description":"Presented by Edd Dumbill (Silicon Valley Data Science), Sarah Novotny (Meteor Entertainment). Opening remarks by the OSCON program chairs, Sarah Novotny and Edd Dumbill.",
      "id":342
   },
   {
      "dtend":"20120719T094500",
      "dtstart":"20120719T093000",
      "dtstamp":"20120728T043226",
      "location":"Portland Ballroom",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26458",
      "uid":"http://oscon.com/--s2012-07-19-09:30--26458",
      "summary":"Open Source: A Recipe For Success",
      "description":"Presented by John Mone (Endurance International Group). Through its ubiquitous presence in small business, Open Source has become a key, but  unrecognized, driver of the U.S. economy. John will discuss the hidden impact of Open Source and what it means to contributors and project leaders. He’ll also provide important tips on making it easy to increase exposure of projects through code contributors and distribution platforms.",
      "id":343
   },
   {
      "dtend":"20120719T095500",
      "dtstart":"20120719T094500",
      "dtstamp":"20120728T043446",
      "location":"Portland Ballroom",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26459",
      "uid":"http://oscon.com/--s2012-07-19-09:45--26459",
      "summary":"An Interview with Gianugo Rabellino",
      "description":"Presented by Edd Dumbill (Silicon Valley Data Science), Gianugo Rabellino (Microsoft). Microsoft's journey into open source has been eventful, and even unexpected. Ten years ago, few would have predicted the importance to the company of projects such Node.JS, Hadoop and even Linux.",
      "id":344
   },
   {
      "dtend":"20120719T101000",
      "dtstart":"20120719T095500",
      "dtstamp":"20120728T043450",
      "location":"Portland Ballroom",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26445",
      "uid":"http://oscon.com/--s2012-07-19-09:55--26445",
      "summary":"Disrupting Hardware: The Next Era of Openness",
      "description":"Presented by Frank Frankovsky (Facebook). In this talk, Facebook's Frank Frankovsky will examine key moments from the history of open hardware and share learnings from his work on the Open Compute Project — a prominent industry initiative focused on driving greater openness and collaboration in infrastructure technology — to draw out insights on how we can create and sustain open source movements in hardware.",
      "id":345
   },
   {
      "dtend":"20120720T090500",
      "dtstart":"20120720T090000",
      "dtstamp":"20120727T151623",
      "location":"Portland Ballroom",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/25038",
      "uid":"http://oscon.com/--s2012-07-20-09:00--25038",
      "summary":"Friday Welcome",
      "description":"Presented by Edd Dumbill (Silicon Valley Data Science), Sarah Novotny (Meteor Entertainment). Opening remarks by the OSCON program chairs, Sarah Novotny and Edd Dumbill.",
      "id":346
   },
   {
      "dtend":"20120720T092000",
      "dtstart":"20120720T090500",
      "dtstamp":"20120728T044107",
      "location":"Portland Ballroom",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24862",
      "uid":"http://oscon.com/--s2012-07-20-09:05--24862",
      "summary":"How Good Is Your Internet, Really?",
      "description":"Presented by Chris DiBona (Google, Inc.). In this plenary, Google's Chris DiBona will share some of the more interesting results from the project and tell you how you too can use and crunch this data.",
      "id":347
   },
   {
      "dtend":"20120720T092500",
      "dtstart":"20120720T092000",
      "dtstamp":"20120728T044114",
      "location":"Portland Ballroom",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/25098",
      "uid":"http://oscon.com/--s2012-07-20-09:20--25098",
      "summary":"Frank Willison Memorial Award 2012",
      "description":"O'Reilly Media presents the Frank Willison Award annually at OSCON, the O'Reilly Open Source Convention. The recipient is chosen by O'Reilly Media in consultation with Guido van Rossum and delegates of the Python Software Foundation. The award consists of a framed certificate and one free pass to a future OSCON.",
      "id":348
   },
   {
      "dtend":"20120720T094500",
      "dtstart":"20120720T092500",
      "dtstamp":"20120728T044126",
      "location":"Portland Ballroom",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26073",
      "uid":"http://oscon.com/--s2012-07-20-09:25--26073",
      "summary":"This Is the House That Open Source Built",
      "description":"Presented by Irene Ros (Bocoup). Open source fuels engineers' professional and personal development as well as our client work. By doing so, we've created a sustainable environment that is driven by purpose. I will share some of the principles we've adopted and how we managed to make it work.",
      "id":349
   },
   {
      "dtend":"20120720T095000",
      "dtstart":"20120720T094500",
      "dtstamp":"20120728T044218",
      "location":"Portland Ballroom",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26444",
      "uid":"http://oscon.com/--s2012-07-20-09:45--26444",
      "summary":"Saying Yes",
      "description":"Presented by Piers Cawley (Thermeon). \"Piers, do you want to do a keynote at OSCON?\" \"Yes! What should I talk about?\" \"Well... you know xkcd.com?\" \"Yes.\" \"There's this strip over here. It'd be fun if...\" \"Oh! Hell yes!\" So here I am. Saying yes.",
      "id":350
   },
   {
      "dtend":"20120720T131000",
      "dtstart":"20120720T124500",
      "dtstamp":"20120730T163244",
      "location":"Portland Ballroom",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24157",
      "uid":"http://oscon.com/--s2012-07-20-12:45--24157",
      "summary":"Mindware Upgrades For Fun And Profit",
      "description":"Presented by Paul Fenwick (Perl Training Australia). Humans display an immense capacity to act against their own best judgement.  Whether it's putting off healthy lifestyle choices, writing our tests and documentation \"tomorrow\", or having just one more unit of something we know we shouldn't. Learn how to patch your mindware, use cognitive prosthetics, and upgrade your memory to actually get done what you want to be doing.",
      "id":351
   },
   {
      "dtend":"20120720T124500",
      "dtstart":"20120720T124000",
      "dtstamp":"20121009T054932",
      "location":"Portland Ballroom",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/25039",
      "uid":"http://oscon.com/--s2012-07-20-12:40--25039",
      "summary":"O'Reilly Open Source Awards",
      "description":"The 8th Annual O’Reilly Open Source Award winners will be announced.",
      "id":352
   },
   {
      "dtend":"20120720T000000",
      "dtstart":"20120719T210000",
      "dtstamp":"20120722T005344",
      "location":"Exhibit Hall E",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26368",
      "uid":"http://oscon.com/--s2012-07-19-21:00--26368",
      "summary":"Citrix Open Cloud Poker Party (sponsored by Citrix)",
      "description":"Citrix is sponsoring a night of poker, pizza and beer. For one night only, OSCON's Hall E will be transformed into Portland's only poker room complete with professional dealers.",
      "id":353
   },
   {
      "dtend":"20120720T140000",
      "dtstart":"20120720T131500",
      "dtstamp":"20120727T151714",
      "location":"Portland Ballroom Foyer",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24994",
      "uid":"http://oscon.com/--s2012-07-20-13:15--24994",
      "summary":"Closing Get-together",
      "description":"Take the opportunity to network one last time and exchange contact information with one another. Drinks and snacks provided.",
      "id":354
   },
   {
      "dtend":"20120716T220000",
      "dtstart":"20120716T190000",
      "dtstamp":"20120722T204547",
      "location":"See BoF Schedule for Locations",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24995",
      "uid":"http://oscon.com/--s2012-07-16-19:00--24995",
      "summary":"Monday Birds of a Feather Sessions (BoFs)",
      "description":"Birds of a Feather (BoF) sessions provide face to face exposure to those interested in the same projects and concepts. BoFs can be organized for individual projects or broader topics (best practices, open data, standards). BoFs are entirely up to you. We post your topic and provide the space and time. You provide the engaging topic.",
      "id":355
   },
   {
      "dtend":"20120718T230000",
      "dtstart":"20120718T190000",
      "dtstamp":"20120719T183359",
      "location":"See BoF Schedule for Locations",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24997",
      "uid":"http://oscon.com/--s2012-07-18-19:00--24997",
      "summary":"Wednesday Birds of a Feather Sessions (BoFs)",
      "description":"Birds of a Feather (BoF) sessions provide face to face exposure to those interested in the same projects and concepts. BoFs can be organized for individual projects or broader topics (best practices, open data, standards). BoFs are entirely up to you. We post your topic and provide the space and time. You provide the engaging topic.",
      "id":356
   },
   {
      "dtend":"20120719T230000",
      "dtstart":"20120719T190000",
      "dtstamp":"20120329T175748",
      "location":"See BoF Schedule for Locations",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24998",
      "uid":"http://oscon.com/--s2012-07-19-19:00--24998",
      "summary":"Thursday Birds of a Feather Sessions (BoFs)",
      "description":"Birds of a Feather (BoF) sessions provide face to face exposure to those interested in the same projects and concepts. BoFs can be organized for individual projects or broader topics (best practices, open data, standards). BoFs are entirely up to you. We post your topic and provide the space and time. You provide the engaging topic.",
      "id":357
   },
   {
      "dtend":"20120718T210000",
      "dtstart":"20120718T190000",
      "dtstamp":"20120430T151955",
      "location":"MacTarnahan Bar Taproom (2730 NW 31st)",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/25261",
      "uid":"http://oscon.com/--s2012-07-18-19:00--25261",
      "summary":"Braintree Party",
      "description":"We love being at OSCON. And we want to celebrate. So drinks are in order. Because celebration is conducive to meeting interesting people and sharing ideas. Stop by the Tap Room in MacTarnahan Bar. We'll be there from 7-9 and we'll grab you a beer. It's free. It's interesting. It's delicious.",
      "id":358
   },
   {
      "dtend":"20120717T220000",
      "dtstart":"20120717T200000",
      "dtstamp":"20120722T204630",
      "location":"411 NW Park Ave.",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24992",
      "uid":"http://oscon.com/--s2012-07-17-20:00--24992",
      "summary":"Puppet Labs Party",
      "description":"Join Puppet Labs at their headquarters in the Pearl District.  The part is free, as in free beer, food and fun. Two open bars and more! Take the Green or Yellow line (free transit) west to Union Station and walk 2 blocks west to 411 NW Park Ave.",
      "id":359
   },
   {
      "dtend":"20120720T160000",
      "dtstart":"20120720T140000",
      "dtstamp":"20120728T044445",
      "location":"Meet in MLK Lobby of OCC",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26382",
      "uid":"http://oscon.com/--s2012-07-20-14:00--26382",
      "summary":"Portland Walking Tours",
      "description":"Cap off your trip to Portland with one of Portland's award-winning guided walking tours. Tours will leave from the convention center right after the closing keynotes. Please register in advance. Tickets range from $20-$45 per person depending on the tour.",
      "id":360
   },
   {
      "dtend":"20120717T200000",
      "dtstart":"20120717T184500",
      "dtstamp":"20120722T204622",
      "location":"OCC Lloyd parking lot",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26414",
      "uid":"http://oscon.com/--s2012-07-17-18:45--26414",
      "summary":"OSCON Couch to Quantified 5K Run/Walk",
      "description":"Don't forget to pack your running shoes and your self-tracking tech, because we're hosting the first ever Couch to Quantified 5K fun run at OSCON. Whether you are an avid runner or just starting out, you are invited to join other OSCON attendees Tuesday evening for a run/jog/walk through some of the most scenic and emblematic sites of Portland.",
      "id":361
   },
   {
      "dtend":"20120718T230000",
      "dtstart":"20120718T210000",
      "dtstamp":"20120724T175103",
      "location":"Spirit of 77 (500 NE MLK Blvd.)",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26369",
      "uid":"http://oscon.com/--s2012-07-18-21:00--26369",
      "summary":"OpenStack Party",
      "description":"Please join us to celebrate the OpenStack community's success on its 2nd anniversary during OSCON 2012! We will have food, drinks, bar games and of course, OpenStack limited-edition t-shirts!",
      "id":362
   },
   {
      "dtend":"20120719T210000",
      "dtstart":"20120719T180000",
      "dtstamp":"20120721T170304",
      "location":"Green Dragon brewpub (928 SE 9th Ave)",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/26480",
      "uid":"http://oscon.com/--s2012-07-19-18:00--26480",
      "summary":"AWS Developer Resources Beer Social (SOLD OUT)",
      "description":"Come meet the Amazon Web Services Developer Resources team at the Green Dragon brewpub (928 SE 9th Ave) on Thursday evening.  Drinks and snacks are on us!  RSVP required.",
      "id":363
   },
   {
      "dtend":"20120717T200000",
      "dtstart":"20120717T180000",
      "dtstamp":"20120729T232722",
      "location":"Exhibit Hall A",
      "url":"http://www.oscon.com/oscon2012/public/schedule/detail/24991",
      "uid":"http://oscon.com/--s2012-07-17-18:00--24991",
      "summary":"Camp OSCON Attendee Party (sponsored by Microsoft and O'Reilly Media)",
      "description":"We're swapping last year's clown shoes for Camp OSCON t-shirts at this year's attendee party. You don't have to worry about sewing in nametags and forget those long bus rides -- just stroll over Exhibit Hall A (next to the Expo Hall). This is the camp you wish your parents had sent you to. You won't want to miss this; trust us.",
      "id":364
   }
]