[
  {
    "dtstamp": "20130724T234610",
    "location": "Portland  Ballroom",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28875",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-10:40--28875",
    "summary": "More Instantly Better Vim",
    "description": "Presented by Damian Conway (Thoughtstream). Once again Damian Conway returns from the untamed wilderness of deepest Vim, bringing with him yet another collection of tips, tools, and tricks to make your text editing still more unspeakably powerful.",
    "id": 1,
    "begin": "3 Jul 10:40 am",
    "end": "3 Jul 11:20 am",
    "dtstart": "20130724T104000",
    "dtend": "20130724T112000"
  },
  {
    "dtstamp": "20130725T003323",
    "location": "Portland  Ballroom",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28776",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-11:30--28776",
    "summary": "Functional Thinking",
    "description": "Presented by Neal Ford (ThoughtWorks). Learning the syntax of a new language is easy, but learning to think under a different paradigm is hard. This session helps you transition from an object-oriented imperative programmer to a functional programmer, using Java, Clojure and Scala for examples.",
    "id": 2,
    "begin": "3 Jul 11:30 am",
    "end": "3 Jul 12:10 pm",
    "dtstart": "20130724T113000",
    "dtend": "20130724T121000"
  },
  {
    "dtstamp": "20130725T000132",
    "location": "Portland  Ballroom",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/30342",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-13:40--30342",
    "summary": "Introducing the Numenta Platform for Intelligent Computing (NuPIC)",
    "description": "Presented by Scott Purdy (Numenta), Matt Taylor (Numenta). This new open source library is based concepts first described in Jeff Hawkins' book On Intelligence and subsequently developed by Numenta Inc.  NuPIC consists of a set of machine learning algorithms that accurately model layers of neurons in the neocortex.  NuPIC's algorithms continuously learn temporal patterns, make predictions, and detect anomalous behavior within streaming data.",
    "id": 3,
    "begin": "3 Jul 1:40 pm",
    "end": "3 Jul 2:20 pm",
    "dtstart": "20130724T134000",
    "dtend": "20130724T142000"
  },
  {
    "dtstamp": "20130724T234315",
    "location": "Portland  Ballroom",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28859",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-14:30--28859",
    "summary": "Discrete Math You Need to Know",
    "description": "Presented by Tim Berglund (GitHub, Inc.). A quick and fun exploration of prime numbers, Markov chains, graph theory, the underpinnings of public key cryptography, and more. Down with continuous math! Up with the discrete!",
    "id": 4,
    "begin": "3 Jul 2:30 pm",
    "end": "3 Jul 3:10 pm",
    "dtstart": "20130724T143000",
    "dtend": "20130724T151000"
  },
  {
    "dtstamp": "20130725T002944",
    "location": "Portland  Ballroom",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31518",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-16:10--31518",
    "summary": "Depression—Bugs In Your Brain",
    "description": "Presented by Paul Fenwick (Perl Training Australia). Internationally acclaimed public speaker Paul Fenwick talks about depression: What it is, why it sucks, and his own personal experiences in battling it. Drawing from a diverse range of fields, Paul provides insights into the bugs that may exist in your brain, and how some aspects of digital society may even make them worse.",
    "id": 5,
    "begin": "3 Jul 4:10 pm",
    "end": "3 Jul 4:50 pm",
    "dtstart": "20130724T161000",
    "dtend": "20130724T165000"
  },
  {
    "dtstamp": "20130721T045623",
    "location": "Portland  Ballroom",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31477",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-10:40--31477",
    "summary": "Create More Value Than You Capture",
    "description": "Presented by Tim O'Reilly (O'Reilly Media, Inc.). At O'Reilly, we've always tried to live by the slogan \"Create more value than you capture.\" It's a great way to build a sustainable business and a sustainable economy.",
    "id": 6,
    "begin": "4 Jul 10:40 am",
    "end": "4 Jul 11:20 am",
    "dtstart": "20130725T104000",
    "dtend": "20130725T112000"
  },
  {
    "dtstamp": "20130325T185904",
    "location": "Portland  Ballroom",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28783",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-11:30--28783",
    "summary": "Scaling systems configuration at Facebook: the paradigms, design, and software behind managing massive numbers of systems with open source and small teams",
    "description": "Presented by Phil Dibowitz (Facebook). This talk looks at how Facebook has redesigned its configuration management system to handle a massive, dynamic, heterogeneous environment with a tiny team and open source software. We will look at the philosophy we use to manage our systems, the implementation of that philosophy, and how you can apply these ideas to any size server footprint, from a handful of servers to a global environment.",
    "id": 7,
    "begin": "4 Jul 11:30 am",
    "end": "4 Jul 12:10 pm",
    "dtstart": "20130725T113000",
    "dtend": "20130725T121000"
  },
  {
    "dtstamp": "20130724T205050",
    "location": "Portland  Ballroom",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28576",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-13:40--28576",
    "summary": "Reducing Identity Pain",
    "description": "Presented by Tim Bray (Google, Inc.). There are three flavors of identity pain: Users struggling with passwords (which don’t scale to the Net), operators living in fear of being hacked and leaking personal data, and developers fighting with arcane identity APIs. This talk surveys the state of play the in the effort to reduce all three.",
    "id": 8,
    "begin": "4 Jul 1:40 pm",
    "end": "4 Jul 2:20 pm",
    "dtstart": "20130725T134000",
    "dtend": "20130725T142000"
  },
  {
    "dtstamp": "20130506T203504",
    "location": "Portland  Ballroom",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28530",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-14:30--28530",
    "summary": "Reinventing Business",
    "description": "Presented by Bruce Eckel (Mindview, LLC). Imagine an organization designed to create happiness among its workers. I’ll talk about my research for the past several years, companies I’ve visited, struggles against my own preconceptions, the surprising number of others who are pushing on the same ideas and writing books on the subject, things I’ve found that seem like answers, and questions that continue to accumulate.",
    "id": 9,
    "begin": "4 Jul 2:30 pm",
    "end": "4 Jul 3:10 pm",
    "dtstart": "20130725T143000",
    "dtend": "20130725T151000"
  },
  {
    "dtstamp": "20130401T161155",
    "location": "Portland  Ballroom",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29069",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-16:10--29069",
    "summary": "Literacy: The Shift From Reading to Writing",
    "description": "Presented by Robert \"r0ml\" Lefkowitz (Sharewave). The open source movement is part of a larger historic shift in the relative societal value placed on writing over reading.   This talk places the open source movement in the context of the evolution of literacy over the last five thousand years.",
    "id": 10,
    "begin": "4 Jul 4:10 pm",
    "end": "4 Jul 4:50 pm",
    "dtstart": "20130725T161000",
    "dtend": "20130725T165000"
  },
  {
    "dtstamp": "20130424T144402",
    "location": "Portland  Ballroom",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28807",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-17:00--28807",
    "summary": "Hardware Hacking With Your Kids",
    "description": "Presented by Dave Neary (Red Hat). How do you grow the next generation of hackers? As our community gets older, we are making little humans, and we have an excellent opportunity as parents to indoctrinate them with seditious ideas like \"it's better to share\", and \"if you don't like the way things are, change them\". Here's one parent's story of toys and activities for kids from 3 to 10 to grow a new hacker generation.",
    "id": 11,
    "begin": "4 Jul 5:00 pm",
    "end": "4 Jul 5:40 pm",
    "dtstart": "20130725T170000",
    "dtend": "20130725T174000"
  },
  {
    "dtstamp": "20130724T173035",
    "location": "Portland 251",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28958",
    "uid": "http://oscon.com/oscon2013--s2013-07-22-09:00--28958",
    "summary": "Java EE 7 Deep Dive",
    "description": "Presented by Reza Rahman (Oracle). Learn the best practices and design patterns of Java EE 7, JAX-RS 2, WebSocket, JSON processing, JMS 2, Batch Processing, Concurrency Utilities are updating the platform to make it richer and complete. This lab will provide a hands-on experience to different technologies in the Java EE 7 platform using GlassFish and NetBeans.",
    "id": 12,
    "begin": "1 Jul 9:00 am",
    "end": "1 Jul 12:30 pm",
    "dtstart": "20130722T090000",
    "dtend": "20130722T123000"
  },
  {
    "dtstamp": "20130724T203910",
    "location": "Portland 251",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28830",
    "uid": "http://oscon.com/oscon2013--s2013-07-22-13:30--28830",
    "summary": "6 Minute Apps!  Build Your First Modern Web App",
    "description": "Presented by James Ward (Typesafe). This session will get you started building modern web apps with HTML5 and the Play Framework. You will learn how to create a new Play application and add JSON REST back-end using Java and Scala. Then you will learn how to create a front-end with CoffeeScript, jQuery and Bootstrap.",
    "id": 13,
    "begin": "1 Jul 1:30 pm",
    "end": "1 Jul 5:00 pm",
    "dtstart": "20130722T133000",
    "dtend": "20130722T170000"
  },
  {
    "dtstamp": "20130724T221352",
    "location": "Portland 251",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28823",
    "uid": "http://oscon.com/oscon2013--s2013-07-23-09:00--28823",
    "summary": "HTML Canvas Deep Dive",
    "description": "Presented by Joshua Marinacci (Nokia). Games account for about half of the apps in the typical app store and are the first thing ported to any new platform. This year's edition of the popular HTML Canvas Deep Dive will focus on building cross-platform games. We will cover everything needed for basic games with animation, audio, image loading, sprites, and joystick support, then package them for desktop, mobile web, and app stores.",
    "id": 14,
    "begin": "2 Jul 9:00 am",
    "end": "2 Jul 12:30 pm",
    "dtstart": "20130723T090000",
    "dtend": "20130723T123000"
  },
  {
    "dtstamp": "20130724T221622",
    "location": "Portland 251",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29158",
    "uid": "http://oscon.com/oscon2013--s2013-07-23-13:30--29158",
    "summary": "Effective Django",
    "description": "Presented by Nathan Yergler (Eventbrite). Django is a popular, powerful web framework for Python. It has lots of \"batteries\" included, and makes it easy to get started. But all of the power means you can write low quality code that still works. Effective Django means building applications that are testable, maintainable, and scalable. This tutorial will introduce attendees to Django with an emphasis on testing, maintenance, and scale.",
    "id": 15,
    "begin": "2 Jul 1:30 pm",
    "end": "2 Jul 5:00 pm",
    "dtstart": "20130723T133000",
    "dtend": "20130723T170000"
  },
  {
    "dtstamp": "20130724T224335",
    "location": "Portland 251",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28141",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-10:40--28141",
    "summary": "Ubuntu Phone and Tablet - Intro to Design and Development",
    "description": "Presented by Jono Bacon (Canonical Ltd). Ubuntu is the first platform to cover phones, tablets and PCs with a single OS and a family of closely related interfaces. This presentation will introduce you to the Ubuntu system and cover the design and development of applications that work on phones, tablets and the desktop. Hosted by the founder of Ubuntu and Canonical, together with design and engineering leads.",
    "id": 16,
    "begin": "3 Jul 10:40 am",
    "end": "3 Jul 11:20 am",
    "dtstart": "20130724T104000",
    "dtend": "20130724T112000"
  },
  {
    "dtstamp": "20130724T225706",
    "location": "Portland 251",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31039",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-11:30--31039",
    "summary": "Build Your Own Cellphone From Parts",
    "description": "Presented by Matt Biddulph (Product Club). Learn how to build a fully functional GSM phone capable of voice, SMS and data. All you'll need is a SIM card, an Arduino, a few cheap hardware components and a soldering iron. We'll talk about writing a realtime state-machine to act as an operating system, and how to embed this GSM functionality in your own non-phone hardware devices.",
    "id": 17,
    "begin": "3 Jul 11:30 am",
    "end": "3 Jul 12:10 pm",
    "dtstart": "20130724T113000",
    "dtend": "20130724T121000"
  },
  {
    "dtstamp": "20130725T003648",
    "location": "Portland 251",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28043",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-13:40--28043",
    "summary": "Intro To PhoneGap",
    "description": "Presented by Renaun Erickson (Adobe). Did you know that you can use your web development skills to create mobile apps?  PhoneGap (aka Apache Cordova) is an toolset that enables you to build cross-platform mobile apps using 100% web standards technologies – HTML, CSS & JavaScript.  In this session we'll cover everything from \"what is PhoneGap\", to debugging and development environments, to building your first PhoneGap application.",
    "id": 18,
    "begin": "3 Jul 1:40 pm",
    "end": "3 Jul 2:20 pm",
    "dtstart": "20130724T134000",
    "dtend": "20130724T142000"
  },
  {
    "dtstamp": "20130724T234523",
    "location": "Portland 251",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29114",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-14:30--29114",
    "summary": "The good, the bad, and how to avoid the Ugly - PhoneGap on Android",
    "description": "Presented by Lindsey Simon (Google). This talk is primarily for those who are comfortable developing Apps for the web who want to delve into mobile. We'll cover core architecture - frameworks, networking, retries and storage. On the UI front, learn what works and what doesn't from the front-lines and how to degrade gracefully on older devices. Learn which APIs to use and which to avoid to make a stellar app your users will love.",
    "id": 19,
    "begin": "3 Jul 2:30 pm",
    "end": "3 Jul 3:10 pm",
    "dtstart": "20130724T143000",
    "dtend": "20130724T151000"
  },
  {
    "dtstamp": "20130325T171937",
    "location": "Portland 251",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29137",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-16:10--29137",
    "summary": "Synchronization is the Future of Mobile Data",
    "description": "Presented by J Chris Anderson (Couchbase). Mobile devices are the preferred means of data access today, but databases are stuck in the mainframe era. The NoSQL document model can be leveraged for off-line synchronization. See example code to quickly get up to speed building off-line capable applications for major mobile platforms, and learn how you can contribute to the open source projects behind this movement.",
    "id": 20,
    "begin": "3 Jul 4:10 pm",
    "end": "3 Jul 4:50 pm",
    "dtstart": "20130724T161000",
    "dtend": "20130724T165000"
  },
  {
    "dtstamp": "20130406T221803",
    "location": "Portland 251",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28596",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-17:00--28596",
    "summary": "Mobile Consumer Experience: designing for fast response time",
    "description": "Presented by David Elfi (Intel Corporation). When hybrid applications are in the center of the discussion, mobile consumers expect fast response time (less than 3 seconds) in order to not switch to other tasks or lose complete interest. This talk will present how this issue was addressed in the design of the Tizen Common Store and tips which can help developers for considering response time when the application is being designed.",
    "id": 21,
    "begin": "3 Jul 5:00 pm",
    "end": "3 Jul 5:40 pm",
    "dtstart": "20130724T170000",
    "dtend": "20130724T174000"
  },
  {
    "dtstamp": "20130326T213427",
    "location": "Portland 251",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29321",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-10:40--29321",
    "summary": "Android Developer Tools Essentials",
    "description": "Presented by Mike Wolfson (Epocrates). Android development is challenging.  Fortunately, the developer tools provide a great deal of support, making the job more manageable, and a lot easier.  I will show you many essential tools, tips and techniques that will increase your development productivity, and improve the quality of your code.",
    "id": 22,
    "begin": "4 Jul 10:40 am",
    "end": "4 Jul 11:20 am",
    "dtstart": "20130725T104000",
    "dtend": "20130725T112000"
  },
  {
    "dtstamp": "20130329T230450",
    "location": "Portland 251",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28927",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-11:30--28927",
    "summary": "Bust the Android Fragmentation Myth",
    "description": "Presented by Chiu-Ki Chan (Square Island LLC). Designers and developers have been afraid of the variety of Android flavors for way too long. Android borrows a lot of concept from the web, and we can use the same techniques to cater to the different OS versions and form factors.",
    "id": 23,
    "begin": "4 Jul 11:30 am",
    "end": "4 Jul 12:10 pm",
    "dtstart": "20130725T113000",
    "dtend": "20130725T121000"
  },
  {
    "dtstamp": "20130326T185807",
    "location": "Portland 251",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28543",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-13:40--28543",
    "summary": "Android Platform Security Underpinnings",
    "description": "Presented by Marko Gargenta (Marakana). Android Security is quite multifaceted - not surprisingly given the depth and complexity of the Android OS. In this talk, you will learn what makes up the various layers of security and how they work together. By the end of this talk, you’ll have a solid understanding of various security concerns from the low level kernel to the high level app permissions, and everything in between.",
    "id": 24,
    "begin": "4 Jul 1:40 pm",
    "end": "4 Jul 2:20 pm",
    "dtstart": "20130725T134000",
    "dtend": "20130725T142000"
  },
  {
    "dtstamp": "20130326T141947",
    "location": "Portland 251",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29282",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-14:30--29282",
    "summary": "Using Android outside of the Mobile Phone Space",
    "description": "Presented by Jason Kridner (Texas Instruments). We will discuss the benefits & advantages of Android for embedded segments and how to take it outside of the mobile phone space.",
    "id": 25,
    "begin": "4 Jul 2:30 pm",
    "end": "4 Jul 3:10 pm",
    "dtstart": "20130725T143000",
    "dtend": "20130725T151000"
  },
  {
    "dtstamp": "20130709T194251",
    "location": "Portland 251",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31496",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-16:10--31496",
    "summary": "From Maker to China",
    "description": "Presented by Brady Forrest (PCH). You've come up with the next gadget, Kickstarter has found you customers and proven the demand. Now, you're a victim of your own success & you have to get 10,000 made. In this session, Brady Forrest will explain how companies tackle the challenges of actually making something—and the hard realities of scaling your initial prototype to thousands of finished products.",
    "id": 26,
    "begin": "4 Jul 4:10 pm",
    "end": "4 Jul 4:50 pm",
    "dtstart": "20130725T161000",
    "dtend": "20130725T165000"
  },
  {
    "dtstamp": "20130329T164724",
    "location": "Portland 251",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28713",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-17:00--28713",
    "summary": "Location, Location, Location: Mastering Android Geolocation",
    "description": "Presented by Andy Gup (Esri). Join us for an in-depth look at native Android Location and GPS capabilities. You'll learn about the many different aspects of the android.location package and how to use it effectively, starting now. We'll apply real-world use cases and demo the results based on different application configurations. In less than one hour you'll learn what typically takes developers several weeks to figure out.",
    "id": 27,
    "begin": "4 Jul 5:00 pm",
    "end": "4 Jul 5:40 pm",
    "dtstart": "20130725T170000",
    "dtend": "20130725T174000"
  },
  {
    "dtstamp": "20130325T175412",
    "location": "Portland 251",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29159",
    "uid": "http://oscon.com/oscon2013--s2013-07-26-10:00--29159",
    "summary": "Cryptography Pitfalls",
    "description": "Presented by John Downey (Braintree). Once the realm of shadowy government organizations, cryptography now permeates computing. Unfortunately, it is difficult to get correct and most developers know just enough to be harmful for their projects. Together, we’ll go through the basics of modern cryptography and where things can go horribly wrong.",
    "id": 28,
    "begin": "5 Jul 10:00 am",
    "end": "5 Jul 10:40 am",
    "dtstart": "20130726T100000",
    "dtend": "20130726T104000"
  },
  {
    "dtstamp": "20130401T160657",
    "location": "Portland 251",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29416",
    "uid": "http://oscon.com/oscon2013--s2013-07-26-11:00--29416",
    "summary": "The Google Open Source Update",
    "description": "Presented by Chris DiBona (Google, Inc.), Shawn Pearce (Google), Carol Smith (Google, Inc.). In this talk, we'll bring you up to date and answer your questions about the various open source projects at Google. Additionally, Shawn Pearce will update you on Git and Gerrit code review. If you care about the future of Git as a client, you should make time for this talk.",
    "id": 29,
    "begin": "5 Jul 11:00 am",
    "end": "5 Jul 11:40 am",
    "dtstart": "20130726T110000",
    "dtend": "20130726T114000"
  },
  {
    "dtstamp": "20130709T195651",
    "location": "Portland 251",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28999",
    "uid": "http://oscon.com/oscon2013--s2013-07-26-11:50--28999",
    "summary": "Clientside MVC: A Journey",
    "description": "Presented by Tom Cully (BigCommerce Ltd Pty). A presentation on the trials and tribulations of moving to a clientside architecture for the web, using open source software and frameworks.",
    "id": 30,
    "begin": "5 Jul 11:50 am",
    "end": "5 Jul 12:30 pm",
    "dtstart": "20130726T115000",
    "dtend": "20130726T123000"
  },
  {
    "dtstamp": "20130724T221159",
    "location": "Portland 252",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28537",
    "uid": "http://oscon.com/oscon2013--s2013-07-22-09:00--28537",
    "summary": "Puppet Tutorial: A Beginner's Guide",
    "description": "Presented by garrett honeycutt (GH Solutions, LLC). Learn Puppet hands on. We will set up a puppet master and actually write code. No previous Puppet knowledge needed.",
    "id": 31,
    "begin": "1 Jul 9:00 am",
    "end": "1 Jul 12:30 pm",
    "dtstart": "20130722T090000",
    "dtend": "20130722T123000"
  },
  {
    "dtstamp": "20130724T182604",
    "location": "Portland 252",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29306",
    "uid": "http://oscon.com/oscon2013--s2013-07-22-13:30--29306",
    "summary": "MongoDB - From Zero to Sharded",
    "description": "Presented by Shaun Verch (10gen). This tutorial will be a crash course in the basics of how to use MongoDB, as well as an introduction to some of MongoDB's core design principles.  We'll start by going over the fundamentals of what MongoDB is, use that as context for starting a simple application, and finish off by showing how to set up MongoDB Replica Sets and Sharded Clusters.",
    "id": 32,
    "begin": "1 Jul 1:30 pm",
    "end": "1 Jul 5:00 pm",
    "dtstart": "20130722T133000",
    "dtend": "20130722T170000"
  },
  {
    "dtstamp": "20130724T231416",
    "location": "Portland 252",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29002",
    "uid": "http://oscon.com/oscon2013--s2013-07-23-09:00--29002",
    "summary": "Level Up Your Apps: Mobile UX Design and Development",
    "description": "Presented by Paris Buttfield-Addison (Secret Lab Pty. Ltd.), Christopher Neugebauer (chris.neugebauer.id.au), Jonathon Manning (Secret Lab Pty. Ltd.). In this session you'll learn why you can't consider UX and design an optional extra when designing mobile apps, and how to tell an awesome app from a terrible app. In this platform-agnostic design-heavy workshop, you’ll learn how to build wireframes, how to translate those wireframes into actual working Android code, and how to evaluate your designs for future improvement.",
    "id": 33,
    "begin": "2 Jul 9:00 am",
    "end": "2 Jul 12:30 pm",
    "dtstart": "20130723T090000",
    "dtend": "20130723T123000"
  },
  {
    "dtstamp": "20130724T205010",
    "location": "Portland 252",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28168",
    "uid": "http://oscon.com/oscon2013--s2013-07-23-13:30--28168",
    "summary": "Backbone Workshop",
    "description": "Presented by Nathaniel Schutta (ntschutta.com). You may have noticed today's web applications involve more than a few lines of JavaScript. You've probably also figured out JavaScript lacks certain...features...that make writing non-trivial applications more challenging. How do we resolve this conundrum?",
    "id": 34,
    "begin": "2 Jul 1:30 pm",
    "end": "2 Jul 5:00 pm",
    "dtstart": "20130723T133000",
    "dtend": "20130723T170000"
  },
  {
    "dtstamp": "20130725T003228",
    "location": "Portland 252",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28016",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-10:40--28016",
    "summary": "Brackets: An Open Source Code Editor For The Web",
    "description": "Presented by Adam Lehman (Adobe Systems Inc). Brackets is a desktop code editor built in JavaScript, HTML and CSS. MIT-licensed and hosted on GitHub, Brackets is a code editor that challenges the status quo with innovations like inline Quick Editing and live browser connectivity. This session will provide an overview of Brackets and demonstrate how to hack on the project so you can customize and extend it to meet your needs.",
    "id": 35,
    "begin": "3 Jul 10:40 am",
    "end": "3 Jul 11:20 am",
    "dtstart": "20130724T104000",
    "dtend": "20130724T112000"
  },
  {
    "dtstamp": "20130725T000049",
    "location": "Portland 252",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28556",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-11:30--28556",
    "summary": "10 Reasons You'll Love Dart",
    "description": "Presented by Chris Strom (EEE Computes). On the fence about Dart? Sure it's horrible? I will give you no fewer than 10 reasons that you are going to love writing your next application in Dart. Don't believe me? I will prove that your code will be better — bordering on beautiful. Dart is going to change the way you think about programming and web programming—for the better. Starting today.",
    "id": 36,
    "begin": "3 Jul 11:30 am",
    "end": "3 Jul 12:10 pm",
    "dtstart": "20130724T113000",
    "dtend": "20130724T121000"
  },
  {
    "dtstamp": "20130725T002721",
    "location": "Portland 252",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28171",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-13:40--28171",
    "summary": "JavaScript Framework Face Off",
    "description": "Presented by Nathaniel Schutta (ntschutta.com). Developers are flocking to client side frameworks and, as a result, there are more and more JavaScript libraries attempting to solve the rich internet application problem. In a space where new libraries seem to spring up weekly, what framework should you choose for your next project?",
    "id": 37,
    "begin": "3 Jul 1:40 pm",
    "end": "3 Jul 2:20 pm",
    "dtstart": "20130724T134000",
    "dtend": "20130724T142000"
  },
  {
    "dtstamp": "20130725T002855",
    "location": "Portland 252",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28035",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-14:30--28035",
    "summary": "Server-Side Push: Comet, Web Sockets, and Server-Sent Events come of age",
    "description": "Presented by Brian Sam-Bodden (Integrallis Software, LLC.). Server-side browser push technologies have been around for a while in one way or another, ranging from from crude browser polling to Flash enabled frameworks. In this session you'll get a code-driven walk-through on the evolution and mechanics of server-push technologies.",
    "id": 38,
    "begin": "3 Jul 2:30 pm",
    "end": "3 Jul 3:10 pm",
    "dtstart": "20130724T143000",
    "dtend": "20130724T151000"
  },
  {
    "dtstamp": "20130725T000729",
    "location": "Portland 252",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29433",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-16:10--29433",
    "summary": "Automated Testing For Accessibility",
    "description": "Presented by Alice Boxhall (Google), Rachel Shearer (Google). What if we could catch accessibility regressions the way we catch other behavioral regressions? We will describe some tools and techniques that we've used to catch the \"low-hanging\" bugs that can make the difference between accessibility and inaccessibility.",
    "id": 39,
    "begin": "3 Jul 4:10 pm",
    "end": "3 Jul 4:50 pm",
    "dtstart": "20130724T161000",
    "dtend": "20130724T165000"
  },
  {
    "dtstamp": "20130715T150824",
    "location": "Portland 252",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28583",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-17:00--28583",
    "summary": "Translated Strings and Foreign Language Support in JavaScript Web Apps",
    "description": "Presented by Ken Tabor (Sabre Holdings). Popular apps, or even modest ones serving a global enterprise, need implement foreign languages. JavaScript is a core tech of the Internet but lacks built-in support for languages.  String tables are presented as a solution. This energetic presentation shows their implementation and obvious benefit through illustrative slides and interactive demos in context of popular open-source libraries.",
    "id": 40,
    "begin": "3 Jul 5:00 pm",
    "end": "3 Jul 5:40 pm",
    "dtstart": "20130724T170000",
    "dtend": "20130724T174000"
  },
  {
    "dtstamp": "20130410T192356",
    "location": "Portland 252",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28557",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-10:40--28557",
    "summary": "Getting Started with 3D Programming in Three.js",
    "description": "Presented by Chris Strom (EEE Computes), Robin Strom (EEE Computes). Want to learn 3D game programming? Want to learn how to make cool animations with Three.js? Want to make amazing visualizations in 3D? Well, then this is the session for you!  This tutorial will introduce you to: 3D concepts in Three.js, coding for canvas and WebGL, animation techniques, and real world simulation with physics engines. You'll be amazed at what you can create!",
    "id": 41,
    "begin": "4 Jul 10:40 am",
    "end": "4 Jul 11:20 am",
    "dtstart": "20130725T104000",
    "dtend": "20130725T112000"
  },
  {
    "dtstamp": "20130325T173014",
    "location": "Portland 252",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29175",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-11:30--29175",
    "summary": "Deal with multiple types of input in your HTML5/JavaScript code",
    "description": "Presented by Olivier Bloch (Microsoft). An introduction to the emerging standard Pointer Events that will undoubtedly help developers write code that will support multiple input types (mouse, touch, pen,...)",
    "id": 42,
    "begin": "4 Jul 11:30 am",
    "end": "4 Jul 12:10 pm",
    "dtstart": "20130725T113000",
    "dtend": "20130725T121000"
  },
  {
    "dtstamp": "20130325T173153",
    "location": "Portland 252",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28903",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-13:40--28903",
    "summary": "Functional Composition",
    "description": "Presented by Piers Cawley (Thermeon). Making music with CoffeeScript, Node.js and higher order programming.  What could possibly go wrong?",
    "id": 43,
    "begin": "4 Jul 1:40 pm",
    "end": "4 Jul 2:20 pm",
    "dtstart": "20130725T134000",
    "dtend": "20130725T142000"
  },
  {
    "dtstamp": "20130514T175204",
    "location": "Portland 252",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/27992",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-14:30--27992",
    "summary": "Adventures in Node.js",
    "description": "Presented by Faisal Abid (Dynamatik, Inc.). Almost everyone has heard about Node.js, but lots of people dismiss it as being just \"Javascript\". In this talk, you'll learn about what Node.js is, why its important you understand it and learn why it's the most powerful web technology in recent years.",
    "id": 44,
    "begin": "4 Jul 2:30 pm",
    "end": "4 Jul 3:10 pm",
    "dtstart": "20130725T143000",
    "dtend": "20130725T151000"
  },
  {
    "dtstamp": "20130719T175352",
    "location": "Portland 252",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31487",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-16:10--31487",
    "summary": "New Rules For JavaScript",
    "description": "Presented by Kyle Simpson (Getify Solutions). This talk is going to re-visit some of the \"tough parts\" of the language by declaring \"New Rules\" (Bill Maher style) for the language.  For instance: \"New rule: Stop using `this` until you fully understand how it gets assigned.\" This talk is going to be hard-core on coding and expects a solid understanding of the language.",
    "id": 45,
    "begin": "4 Jul 4:10 pm",
    "end": "4 Jul 4:50 pm",
    "dtstart": "20130725T161000",
    "dtend": "20130725T165000"
  },
  {
    "dtstamp": "20130325T202958",
    "location": "Portland 252",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28087",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-17:00--28087",
    "summary": "Offline strategies for HTML5 web applications",
    "description": "Presented by Stephan Hochdörfer (bitExpert AG). There has been a strong connection between the terms \"web\" and \"online\" for years. The rise of HTML5 and the support of offline mode in most modern browsers changed the play of the game. This session will introduce different ways of storing data on the client as well as highlighting the limitations.",
    "id": 46,
    "begin": "4 Jul 5:00 pm",
    "end": "4 Jul 5:40 pm",
    "dtstart": "20130725T170000",
    "dtend": "20130725T174000"
  },
  {
    "dtstamp": "20130326T012830",
    "location": "Portland 252",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28873",
    "uid": "http://oscon.com/oscon2013--s2013-07-26-10:00--28873",
    "summary": "The Conway Channel",
    "description": "Presented by Damian Conway (Thoughtstream). Once again, Perl's Dark Lord unleashes a clowder of new and improved Perl modules on the unsuspecting world. It's Damian-as-usual: doing great and terrible things with Perl.",
    "id": 47,
    "begin": "5 Jul 10:00 am",
    "end": "5 Jul 10:40 am",
    "dtstart": "20130726T100000",
    "dtend": "20130726T104000"
  },
  {
    "dtstamp": "20130502T005545",
    "location": "Portland 252",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28777",
    "uid": "http://oscon.com/oscon2013--s2013-07-26-11:00--28777",
    "summary": "A Short History of Random Numbers, and Why You Need to Care",
    "description": "Presented by Matthew Garrett (Nebula). People have been fascinated with random numbers for millennia. How far have we come in that time, and why are they so important? How did a medieval monk's work end up responsible for decades of questionable science?  How is something we had no trouble doing before recorded history still causing problems in the cloud? All these questions, and more, will be answered.",
    "id": 48,
    "begin": "5 Jul 11:00 am",
    "end": "5 Jul 11:40 am",
    "dtstart": "20130726T110000",
    "dtend": "20130726T114000"
  },
  {
    "dtstamp": "20130626T185413",
    "location": "Portland 252",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28688",
    "uid": "http://oscon.com/oscon2013--s2013-07-26-11:50--28688",
    "summary": "Was It Something I Said? The Art of Giving (and getting) Actionable Critiques",
    "description": "Presented by Emma Jane Westby (Drupalize.Me). In this session we'll explore how to give, and receive, useful critiques of our work. We'll talk about the different kinds of critiques that are necessary as an idea develops. The emphasis will be on reviewing subjective work, not the easy stuff like white space at the end of a line.",
    "id": 49,
    "begin": "5 Jul 11:50 am",
    "end": "5 Jul 12:30 pm",
    "dtstart": "20130726T115000",
    "dtend": "20130726T123000"
  },
  {
    "dtstamp": "20130716T222705",
    "location": "Portland 252",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29226",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-19:00--29226",
    "summary": "State Of The Onion",
    "description": "Presented by R Geoffrey Avery (Platypi Ventures), Larry Wall (The Wall Nuthouse). The annual What's New in the Perl community.",
    "id": 50,
    "begin": "4 Jul 7:00 pm",
    "end": "4 Jul 8:00 pm",
    "dtstart": "20130725T190000",
    "dtend": "20130725T200000"
  },
  {
    "dtstamp": "20130724T232103",
    "location": "Portland 255",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28772",
    "uid": "http://oscon.com/oscon2013--s2013-07-22-09:00--28772",
    "summary": "R Predictive Analytics Workshop",
    "description": "Presented by Ray DiGiacomo, Jr. (Lion Data Systems, LLC). This workshop will provide the attendee an introduction to R, an open-source statistical computing environment that some say is even more powerful and flexible than SAS and SPSS.  Additionally, the session will also provide an introduction to predictive analytics theory and R's ability to apply predictive analytics theory to real-world situations.",
    "id": 51,
    "begin": "1 Jul 9:00 am",
    "end": "1 Jul 12:30 pm",
    "dtstart": "20130722T090000",
    "dtend": "20130722T123000"
  },
  {
    "dtstamp": "20130724T205717",
    "location": "Portland 255",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28539",
    "uid": "http://oscon.com/oscon2013--s2013-07-22-13:30--28539",
    "summary": "Introduction to Apache Hadoop",
    "description": "Presented by Tom Wheeler (Cloudera, Inc.). This is a solid introduction to Apache Hadoop that explains what it is, why it's relevant and how it works.  No previous experience is required, and participants will gain a clear understanding of how Apache Hadoop (and many complementary tools) can be used for scalable data processing as well as approaches for integrating it with existing systems.",
    "id": 52,
    "begin": "1 Jul 1:30 pm",
    "end": "1 Jul 5:00 pm",
    "dtstart": "20130722T133000",
    "dtend": "20130722T170000"
  },
  {
    "dtstamp": "20130725T004827",
    "location": "Portland 255",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29621",
    "uid": "http://oscon.com/oscon2013--s2013-07-23-09:00--29621",
    "summary": "Systems Management with Chef",
    "description": "Presented by Joshua Timberman (Opscode, Inc), James Casey (Opscode, Inc.). One of the most popular configuration and cloud management tools, Chef is a powerful platform for rapid provisioning and deployment of servers. Attend this tutorial to learn  what benefits Chef can bring, how to get started and best use Chef to meet your needs.",
    "id": 53,
    "begin": "2 Jul 9:00 am",
    "end": "2 Jul 12:30 pm",
    "dtstart": "20130723T090000",
    "dtend": "20130723T123000"
  },
  {
    "dtstamp": "20130724T231319",
    "location": "Portland 255",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29620",
    "uid": "http://oscon.com/oscon2013--s2013-07-23-13:30--29620",
    "summary": "OpenStack Tour de Force",
    "description": "Presented by Florian Haas (hastexo). Call us crazy, but here is where you stand up an OpenStack cloud, from scratch, in three and a half hours. Running full throttle through the basics of OpenStack, this fast-paced tutorial will whirl through authentication, image storage, networking, and compute at breakneck speed. Not for the faint at heart.",
    "id": 54,
    "begin": "2 Jul 1:30 pm",
    "end": "2 Jul 5:00 pm",
    "dtstart": "20130723T133000",
    "dtend": "20130723T170000"
  },
  {
    "dtstamp": "20130724T214204",
    "location": "Portland 255",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28994",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-10:40--28994",
    "summary": "Solving Embarrassingly Obvious Problems in Code",
    "description": "Presented by Garrett Smith (CloudBees). How do you know you've written a good program? There are a couple standards most people use: \"works for me\" and \"all tests pass\". If you can get to that point, you're code is in pretty good shape! This talk will go beyond \"it works\" to explore a programming technique where problems are systematically made obvious and code naturally becomes correct, clear, and maintainable!",
    "id": 55,
    "begin": "3 Jul 10:40 am",
    "end": "3 Jul 11:20 am",
    "dtstart": "20130724T104000",
    "dtend": "20130724T112000"
  },
  {
    "dtstamp": "20130329T164750",
    "location": "Portland 255",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28496",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-11:30--28496",
    "summary": "Acmeism - Hacking in all Languages at Once",
    "description": "Presented by Ingy döt Net (Oui Code Software, LLC). The real strength of a modern programming language is its collection of maintained packages: RubyGems, CPAN, PyPI, NPM, PECL. A good idea for programming needs to be gifted to everyone: Ruby Perl Python JS PHP Java etc. Ingy döt Net will show you how he has been hacking and pushing his code (and doc and tests) to all these places at once. Ingy (the YAML guy) calls this style of Openness: Acmeism.",
    "id": 56,
    "begin": "3 Jul 11:30 am",
    "end": "3 Jul 12:10 pm",
    "dtstart": "20130724T113000",
    "dtend": "20130724T121000"
  },
  {
    "dtstamp": "20130724T231004",
    "location": "Portland 255",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28478",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-13:40--28478",
    "summary": "How Learning Go Made Me A Better Programmer",
    "description": "Presented by Johan Euphrosine (Google). It's widely accepted that learning any new programming language will improve your programming skills in general, but we don't often talk about how. This talk will cover some of the my takeaways after learning Go that have improved my Python and Java skills, as well as cover some bits about why Go is a great choice for those itching to learn a new language.",
    "id": 57,
    "begin": "3 Jul 1:40 pm",
    "end": "3 Jul 2:20 pm",
    "dtstart": "20130724T134000",
    "dtend": "20130724T142000"
  },
  {
    "dtstamp": "20130724T230824",
    "location": "Portland 255",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28742",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-14:30--28742",
    "summary": "Go Best Practices",
    "description": "Presented by Francesc Campoy Flores (Google Inc.). In this talk we share these \"best practices\" by building a Go library from the ground up, at each stage discussing the decisions we made and why we made them. In this way the audience should gain an understanding of how to effectively design, build, test, and package their own Go programs and libraries.",
    "id": 58,
    "begin": "3 Jul 2:30 pm",
    "end": "3 Jul 3:10 pm",
    "dtstart": "20130724T143000",
    "dtend": "20130724T151000"
  },
  {
    "dtstamp": "20130724T235748",
    "location": "Portland 255",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29062",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-16:10--29062",
    "summary": "Vestigial software \"best\" practices",
    "description": "Presented by Robert \"r0ml\" Lefkowitz (Sharewave). Open source software can avoid software design patterns that evolved to facilitate software development in a proprietary world.",
    "id": 59,
    "begin": "3 Jul 4:10 pm",
    "end": "3 Jul 4:50 pm",
    "dtstart": "20130724T161000",
    "dtend": "20130724T165000"
  },
  {
    "dtstamp": "20130725T005255",
    "location": "Portland 255",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29205",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-17:00--29205",
    "summary": "Planned Obsolescence: Built to Last, or Build One to Throw Away?",
    "description": "Presented by Ian Dees (Tektronix), Baq Haidri (LinkedIn). We strive to create designs that will last.  But in doing so, we run the risk of over-engineering: building in so many abstractions at the beginning of a project that it degenerates into unmaintainable code. What causes these risks, and what can we do about it?",
    "id": 60,
    "begin": "3 Jul 5:00 pm",
    "end": "3 Jul 5:40 pm",
    "dtstart": "20130724T170000",
    "dtend": "20130724T174000"
  },
  {
    "dtstamp": "20130326T210215",
    "location": "Portland 255",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29145",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-10:40--29145",
    "summary": "Making Functional Programming Approachable",
    "description": "Presented by Simon St. Laurent (O'Reilly Media, Inc.). Distributed computing, resilience, and constant efforts to make code more maintainable are all driving interest in functional programming.  The world needs more programmers who can tackle this.  How can we make the craft seem less arcane?",
    "id": 61,
    "begin": "4 Jul 10:40 am",
    "end": "4 Jul 11:20 am",
    "dtstart": "20130725T104000",
    "dtend": "20130725T112000"
  },
  {
    "dtstamp": "20130722T180750",
    "location": "Portland 255",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28670",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-11:30--28670",
    "summary": "Docker And The Future of Linux Containers",
    "description": "Presented by Solomon Hykes (dotCloud). Compared to KVM or Xen, LXC has very low overhead since it runs processes within a common host kernel, instead of emulating complete machines. LXC relies on kernel namespaces (providing isolation), and control groups (ensuring fair sharing of resources). We will detail their respective roles. We will also show how to use unioning filesystems for fast & lightweight provisioning of environments.",
    "id": 62,
    "begin": "4 Jul 11:30 am",
    "end": "4 Jul 12:10 pm",
    "dtstart": "20130725T113000",
    "dtend": "20130725T121000"
  },
  {
    "dtstamp": "20130329T195223",
    "location": "Portland 255",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28741",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-13:40--28741",
    "summary": "Rust: a modern systems language",
    "description": "Presented by Dave Herman (Mozilla). Anyone who has written a program in C++ knows that simple errors can cause crashes and security vulnerabilities in even innocent looking code. Rust is a new programming language that provides important safety guarantees without sacrificing precise control over the machine. In this talk, Dave Herman demonstrates how Rust can be used to produce high-level, clean code that is also safe and efficient.",
    "id": 63,
    "begin": "4 Jul 1:40 pm",
    "end": "4 Jul 2:20 pm",
    "dtstart": "20130725T134000",
    "dtend": "20130725T142000"
  },
  {
    "dtstamp": "20130326T201004",
    "location": "Portland 255",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29474",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-14:30--29474",
    "summary": "Open Source Automotive Development",
    "description": "Presented by Jeff Payne (OpenCar, Inc.), Sam Skjonsberg (OpenCar, Inc.). We'll cover OS development for a new market: automotive apps. In-car apps are poised to explode for open source developers. The market is transforming from an inefficient, proprietary model to an HTML5-based “app store” model. To enter and participate in this new target category, developers need access to automakers, automotive systems, and knowledge of industry standards and platforms.",
    "id": 64,
    "begin": "4 Jul 2:30 pm",
    "end": "4 Jul 3:10 pm",
    "dtstart": "20130725T143000",
    "dtend": "20130725T151000"
  },
  {
    "dtstamp": "20130325T172426",
    "location": "Portland 255",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29345",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-16:10--29345",
    "summary": "Introduction to Quirrel & R for Dummies",
    "description": "Presented by John A. De Goes (Precog). In this talk, John De Goes will show how Developers and Data Scientists can use Quirrel (statistically-oriented language) to solve problems across large data sets. John will also walk through the core syntax and features of R, providing enough training to give anyone the ability to do simple analysis.",
    "id": 65,
    "begin": "4 Jul 4:10 pm",
    "end": "4 Jul 4:50 pm",
    "dtstart": "20130725T161000",
    "dtend": "20130725T165000"
  },
  {
    "dtstamp": "20130325T172523",
    "location": "Portland 255",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29284",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-17:00--29284",
    "summary": "Using Cascalog to build an app with City of Palo Alto Open Data",
    "description": "Presented by Paco Nathan (Cascading). As new data sets become available through municipal Open Data initiatives, how can these be leveraged to reveal insights and build services for communities? This talk shows Cascalog and Open Data from the City of Palo Alto to create a sample app. Some programming background is helpful, but the emphasis is on process: how to approach large-scale Open Data to build data products for a community.",
    "id": 66,
    "begin": "4 Jul 5:00 pm",
    "end": "4 Jul 5:40 pm",
    "dtstart": "20130725T170000",
    "dtend": "20130725T174000"
  },
  {
    "dtstamp": "20130724T091411",
    "location": "Portland 255",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28669",
    "uid": "http://oscon.com/oscon2013--s2013-07-26-10:00--28669",
    "summary": "dl.google.com: powered by Go",
    "description": "Presented by Brad Fitzpatrick (Google). Google's dl.google.com serves binary downloads for Chrome, Earth, the Android SDK, and thousands of other files. In this talk we discuss how and why the original C++ server was rewritten in Go and take a close look at its design, and introduce the new open source groupcache project. It is a great example of idiomatic Go code that uses the language and libraries very concisely and elegantly.",
    "id": 67,
    "begin": "5 Jul 10:00 am",
    "end": "5 Jul 10:40 am",
    "dtstart": "20130726T100000",
    "dtend": "20130726T104000"
  },
  {
    "dtstamp": "20130429T060948",
    "location": "Portland 255",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29108",
    "uid": "http://oscon.com/oscon2013--s2013-07-26-11:00--29108",
    "summary": "BASH as a Modern Programming Language",
    "description": "Presented by Jason Brittain (eBay Inc.). BASH is a simple multiplatform alternative to Perl, Python, and Ruby.  Join Jason Brittain of eBay's Platform Frameworks group to hear why you should consider using BASH, and when it's the right choice over other programming languages.  You'll also see several code example tips and tricks for coding your common modern tasks in BASH.",
    "id": 68,
    "begin": "5 Jul 11:00 am",
    "end": "5 Jul 11:40 am",
    "dtstart": "20130726T110000",
    "dtend": "20130726T114000"
  },
  {
    "dtstamp": "20130327T223436",
    "location": "Portland 255",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28703",
    "uid": "http://oscon.com/oscon2013--s2013-07-26-11:50--28703",
    "summary": "Developing polyglot persistence applications",
    "description": "Presented by Chris Richardson (Pivotal). Using both SQL and NoSQL databases in the same application enables you to get the benefits of both kind of database: the scalability and performance of NoSQL and ACID transactions of SQL databases. In this talk, you will learn how to design applications that use this approach.",
    "id": 69,
    "begin": "5 Jul 11:50 am",
    "end": "5 Jul 12:30 pm",
    "dtstart": "20130726T115000",
    "dtend": "20130726T123000"
  },
  {
    "dtstamp": "20130724T230551",
    "location": "Portland 256",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28857",
    "uid": "http://oscon.com/oscon2013--s2013-07-22-09:00--28857",
    "summary": "Getting Started with Git",
    "description": "Presented by Tim Berglund (GitHub, Inc.). Get a thorough introduction to Git and GitHub. You'll leave ready to fork, pull-request, clone, push, pull, log, and fetch with the best of them!",
    "id": 70,
    "begin": "1 Jul 9:00 am",
    "end": "1 Jul 12:30 pm",
    "dtstart": "20130722T090000",
    "dtend": "20130722T123000"
  },
  {
    "dtstamp": "20130724T210652",
    "location": "Portland 256",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29618",
    "uid": "http://oscon.com/oscon2013--s2013-07-22-13:30--29618",
    "summary": "Introduction to Go",
    "description": "Presented by Francesc Campoy Flores (Google Inc.). Go is an open source programming language, developed at Google. Optimized for systems programming, Go combines the ease of a dynamic language with the safety of a statically compiled language, along with support for networked and multicore programming.",
    "id": 71,
    "begin": "1 Jul 1:30 pm",
    "end": "1 Jul 5:00 pm",
    "dtstart": "20130722T133000",
    "dtend": "20130722T170000"
  },
  {
    "dtstamp": "20130724T133619",
    "location": "Portland 256",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28933",
    "uid": "http://oscon.com/oscon2013--s2013-07-23-09:00--28933",
    "summary": "Solr Quick Start",
    "description": "Presented by Erik Hatcher (LucidWorks). Apache Solr is a Lucene-based blazing fast, highly scalable search engine used in thousands of applications and projects at organizations such as Zappos, Wells Fargo, Getty Images and many more. This tutorial will provide you with the fundamentals, enabling you to be up and running with Solr in minutes.",
    "id": 72,
    "begin": "2 Jul 9:00 am",
    "end": "2 Jul 12:30 pm",
    "dtstart": "20130723T090000",
    "dtend": "20130723T123000"
  },
  {
    "dtstamp": "20130724T224244",
    "location": "Portland 256",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29619",
    "uid": "http://oscon.com/oscon2013--s2013-07-23-13:30--29619",
    "summary": "Real-time: HTML5 and Node.js",
    "description": "Presented by Kyle Simpson (Getify Solutions). The HTML 5 standard offers powerful features for writing full fledged applications. This tutorial focuses on the newest and most powerful of these: storage, web sockets and WebRTC.",
    "id": 73,
    "begin": "2 Jul 1:30 pm",
    "end": "2 Jul 5:00 pm",
    "dtstart": "20130723T133000",
    "dtend": "20130723T170000"
  },
  {
    "dtstamp": "20130725T003120",
    "location": "Portland 256",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28891",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-10:40--28891",
    "summary": "Building an Impenetrable ZooKeeper",
    "description": "Presented by Kathleen Ting (Cloudera). ZooKeeper is the unsung hero. Although a critical component, ZooKeeper is often noticed only after it’s missing. In this presentation, we'll talk about how to efficiently resolve some of the common issues that can cause ZooKeeper’s unavailability. An impenetrable ZooKeeper makes for a healthy cluster.",
    "id": 74,
    "begin": "3 Jul 10:40 am",
    "end": "3 Jul 11:20 am",
    "dtstart": "20130724T104000",
    "dtend": "20130724T112000"
  },
  {
    "dtstamp": "20130724T235556",
    "location": "Portland 256",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29454",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-11:30--29454",
    "summary": "HDFS - What is New and Future",
    "description": "Presented by Sanjay Radia (Hortonworks), Suresh Srinivas (Hortonworks). Hadoop 2.0 offers major HDFS improvements: new append-pipeline, federation, wire compatibility, NameNode HA, performance improvements, etc. In this session, we'll describe these features, their benefits and the development underway for the next HDFS release. This includes data management features, added support for storage devices and improvements to performance, diagnosability and manageability.",
    "id": 75,
    "begin": "3 Jul 11:30 am",
    "end": "3 Jul 12:10 pm",
    "dtstart": "20130724T113000",
    "dtend": "20130724T121000"
  },
  {
    "dtstamp": "20130724T221146",
    "location": "Portland 256",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29251",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-13:40--29251",
    "summary": "Everyday Numeracy:  Open Data in the World Beyond Geeks",
    "description": "Presented by Dawn Nafus (Intel). How can open source help people get something useful out of the sensor data they generate? Based on social science research, this session will give developers some simple tools to understand how non-geeks make sense of complex data, and offers some approaches to improve user experience of both hardware and software based on that knowledge.",
    "id": 76,
    "begin": "3 Jul 1:40 pm",
    "end": "3 Jul 2:20 pm",
    "dtstart": "20130724T134000",
    "dtend": "20130724T142000"
  },
  {
    "dtstamp": "20130725T003142",
    "location": "Portland 256",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29167",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-14:30--29167",
    "summary": "Doing Data Science On NFL Play by Play",
    "description": "Presented by Jesse Anderson (Cloudera). Gaining insight on data is even more interesting when it comes from the NFL.  See how I take play by play data, combine it with other datasets and gain insight from the data.",
    "id": 77,
    "begin": "3 Jul 2:30 pm",
    "end": "3 Jul 3:10 pm",
    "dtstart": "20130724T143000",
    "dtend": "20130724T151000"
  },
  {
    "dtstamp": "20130724T235403",
    "location": "Portland 256",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28510",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-16:10--28510",
    "summary": "Getting Hadoop, Hive and HBase up and running in less than 15 minutes",
    "description": "Presented by Mark Grover (Cloudera). If you have ever wanted to dabble with Apache Hadoop, Hive, HBase or other projects in the Hadoop ecosystem but have been discouraged by the painful process of installation and configuration of these projects, this talk is for you. We will learn how to install Hadoop, Hive and HBase on a cluster by making use of various packages from Apache Bigtop.",
    "id": 78,
    "begin": "3 Jul 4:10 pm",
    "end": "3 Jul 4:50 pm",
    "dtstart": "20130724T161000",
    "dtend": "20130724T165000"
  },
  {
    "dtstamp": "20130725T003751",
    "location": "Portland 256",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29309",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-17:00--29309",
    "summary": "Map Reduce All the Way Down",
    "description": "Presented by Russell Branca (Cloudant). Map Reduce has become a household name in data processing these days, but is typically used in a backend, batch oriented manner across large data sets. In this talk we'll explore pipelining data sets far too large to fit in the browser through map reduce implementations in CouchDB, server side javascript, and finally directly in the browser, allowing for large scale, yet interactive data analysis.",
    "id": 79,
    "begin": "3 Jul 5:00 pm",
    "end": "3 Jul 5:40 pm",
    "dtstart": "20130724T170000",
    "dtend": "20130724T174000"
  },
  {
    "dtstamp": "20130325T171734",
    "location": "Portland 256",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28989",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-10:40--28989",
    "summary": "Database Performance: What Really Matters ?",
    "description": "Presented by Peter Zaitsev (Percona Inc). In many Performance evaluation studies, you will find comparison made in terms of peak throughput or corresponding response time. This can be misleading. In this brief presentation, we will look into why such metrics can be misleading as well as provide framework and principles about performance evaluation which focuses on being able to provide good service in real world production environments.",
    "id": 80,
    "begin": "4 Jul 10:40 am",
    "end": "4 Jul 11:20 am",
    "dtstart": "20130725T104000",
    "dtend": "20130725T112000"
  },
  {
    "dtstamp": "20130513T164702",
    "location": "Portland 256",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29055",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-11:30--29055",
    "summary": "InnoDB Features in MySQL 5.6 and Beyond",
    "description": "Presented by Calvin Sun (Twitter). MySQL 5.6 is simply a better MySQL with improvements that enhance every functional area of the database kernel. There are many new features in the InnoDB storage engine, including: better performance and scalability, online DDL, persistent statistics, NoSQL access, and many more.",
    "id": 81,
    "begin": "4 Jul 11:30 am",
    "end": "4 Jul 12:10 pm",
    "dtstart": "20130725T113000",
    "dtend": "20130725T121000"
  },
  {
    "dtstamp": "20130401T174837",
    "location": "Portland 256",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29493",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-13:40--29493",
    "summary": "Building a Distributed SQL Database ... from Scratch",
    "description": "Presented by Bradford Stephens (Drawn to Scale). Spire is one of the first open source distributed SQL databases. Architected from the ground up with no legacy code, it's meant to power large-scale applications with 10's of thousands of reads and writes at the petabyte-scale. This talk will cover parts of Spire like distributed computational fabric, distributed indexing, query planning, and more.",
    "id": 82,
    "begin": "4 Jul 1:40 pm",
    "end": "4 Jul 2:20 pm",
    "dtstart": "20130725T134000",
    "dtend": "20130725T142000"
  },
  {
    "dtstamp": "20130328T001030",
    "location": "Portland 256",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29176",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-14:30--29176",
    "summary": "Design Patterns for Large-Scale Database Management",
    "description": "Presented by Robert Hodges (Continuent.com). Successful database applications do not happen by accident.  In this talk we will present a half-dozen design patterns for database management to help implement 24x7 applications that handle 100s of terabytes spread over multiple continents on databases like MYSQL.  Start out using these patterns now and avoid a lot of pain later.",
    "id": 83,
    "begin": "4 Jul 2:30 pm",
    "end": "4 Jul 3:10 pm",
    "dtstart": "20130725T143000",
    "dtend": "20130725T151000"
  },
  {
    "dtstamp": "20130325T204407",
    "location": "Portland 256",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29043",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-16:10--29043",
    "summary": "Large Scale MySQL Migration to PostgreSQL",
    "description": "Presented by Dimitri Fontaine (2ndQuadrant). Once a Top-10 internet audience site. 32 million users. Billions of photos and comments, more than 6TB of them. Migrating away from MySQL to PostgreSQL!",
    "id": 84,
    "begin": "4 Jul 4:10 pm",
    "end": "4 Jul 4:50 pm",
    "dtstart": "20130725T161000",
    "dtend": "20130725T165000"
  },
  {
    "dtstamp": "20130328T172653",
    "location": "Portland 256",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29110",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-17:00--29110",
    "summary": "MySQL Administration for Developers",
    "description": "Presented by Ligaya  Turmelle (MySQL). Many companies need their employees to do more then one job -  Programmer, DBA, SysAdmin.  The more skills you have, the more you can contribute to the overall success of the company and improve your own job marketability.  Learn the basic commands of MySQL Server Administration that every Developer should know, what each does and how to use them.",
    "id": 85,
    "begin": "4 Jul 5:00 pm",
    "end": "4 Jul 5:40 pm",
    "dtstart": "20130725T170000",
    "dtend": "20130725T174000"
  },
  {
    "dtstamp": "20130506T205710",
    "location": "Portland 256",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28853",
    "uid": "http://oscon.com/oscon2013--s2013-07-26-10:00--28853",
    "summary": "Automating Community Contributions to Puppet with Github, Heroku, Trello and Travis",
    "description": "Presented by Jeff McCune (Puppet Labs). Attend this talk and learn how Puppet Labs handles community contributions and the FOSS tools we’ve published to automate much of the process.  Puppet Labs handles thousands of contributions from hundreds of contributors and we’ve integrated Github, TravisCI and Trello to manage all of it.  Come see how we do it and what we’ve built.",
    "id": 86,
    "begin": "5 Jul 10:00 am",
    "end": "5 Jul 10:40 am",
    "dtstart": "20130726T100000",
    "dtend": "20130726T104000"
  },
  {
    "dtstamp": "20130513T151605",
    "location": "Portland 256",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29338",
    "uid": "http://oscon.com/oscon2013--s2013-07-26-11:00--29338",
    "summary": "Discover The Zen Of Writing (Ascii)Docs",
    "description": "Presented by Dan Allen (Red Hat, Inc.). Writing documentation is already hard enough. Why do we make it even more difficult by burying the content in XML or struggling with finicky WSYWIG editors? Drop the angled brackets and discover the zen of writing documentation in AsciiDoc. While the format is plain text, it can still output beautiful HTML 5, DocBook and PDF documents--or even a slide deck like the one used in this presentation!",
    "id": 87,
    "begin": "5 Jul 11:00 am",
    "end": "5 Jul 11:40 am",
    "dtstart": "20130726T110000",
    "dtend": "20130726T114000"
  },
  {
    "dtstamp": "20130325T173743",
    "location": "Portland 256",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29001",
    "uid": "http://oscon.com/oscon2013--s2013-07-26-11:50--29001",
    "summary": "Get Off Your Butt - Tips And Techniques For Those Who Sit A Lot",
    "description": "Presented by Jason Levitt (Spirit.io), Clayton Aynesworth (Alternative Healing of Austin). The time people spend sitting in chairs has increased substantially over the past 30 years, and related health issues such as obesity and musculoskeletal disorders are also on the rise. This is an area of concern for all who sit in chairs a lot, especially those in the computer industry. In this session, we'll look at recent research, and tools for mitigating the effects of sitting too much.",
    "id": 88,
    "begin": "5 Jul 11:50 am",
    "end": "5 Jul 12:30 pm",
    "dtstart": "20130726T115000",
    "dtend": "20130726T123000"
  },
  {
    "dtstamp": "20130724T212346",
    "location": "D135",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28792",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-10:40--28792",
    "summary": "Building an Open Source Cell Network at Burning Man",
    "description": "Presented by Johnny Diggz (Geeks Without Bounds). Overview of the open source tools and techniques employed by the Papa Legba camp in 2012 in Black Rock City, Nevada to build an ad-hoc private GSM cellular network and a preview of this year's plans.",
    "id": 89,
    "begin": "3 Jul 10:40 am",
    "end": "3 Jul 11:20 am",
    "dtstart": "20130724T104000",
    "dtend": "20130724T112000"
  },
  {
    "dtstamp": "20130724T212353",
    "location": "D135",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28787",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-11:30--28787",
    "summary": "My RepRap Printer - The eMaker Huxley",
    "description": "Presented by Edward Snajder (Jive Software). RepRap 3D printing is the concept of making printers that are made from printed parts. I’ll show off my Open Source Huxley model, built from a kit, and discuss the joy and tears associated with building a printer from parts. We'll discuss the hardware, software, where things are now and how bright the future is for 3D printing.",
    "id": 90,
    "begin": "3 Jul 11:30 am",
    "end": "3 Jul 12:10 pm",
    "dtstart": "20130724T113000",
    "dtend": "20130724T121000"
  },
  {
    "dtstamp": "20130724T235438",
    "location": "D135",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28812",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-13:40--28812",
    "summary": "Raspberry Pi Hacks",
    "description": "Presented by Ruth Suehle (Red Hat), Tom \"spot\" Callaway (Red Hat). Tom Callaway and Ruth Suehle, authors of Raspberry Pi Hacks (O'Reilly, expected spring 2013) will share hints and tips for hackers ready to bring their ideas to life with the Raspberry Pi, They'll cover the important basics of doing tricks with your Pi and go on to talk about a few fun projects, from game emulators to cameras in the sky.",
    "id": 91,
    "begin": "3 Jul 1:40 pm",
    "end": "3 Jul 2:20 pm",
    "dtstart": "20130724T134000",
    "dtend": "20130724T142000"
  },
  {
    "dtstamp": "20130725T000804",
    "location": "D135",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29117",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-14:30--29117",
    "summary": "Building a keyboard from scratch",
    "description": "Presented by Jesse Vincent (keyboard.io). Come learn how to design your own keyboard. We'll talk about everything from open source microcontroller firmware options to the basics of fabrication and soldering. You'll walk away from this talk with everything you need to know to build a keyboard from scratch -- even if you've never touched a soldering iron.",
    "id": 92,
    "begin": "3 Jul 2:30 pm",
    "end": "3 Jul 3:10 pm",
    "dtstart": "20130724T143000",
    "dtend": "20130724T151000"
  },
  {
    "dtstamp": "20130327T000536",
    "location": "D135",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29381",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-16:10--29381",
    "summary": "Hacking Embedded Linux: The Caffeinated ARM Course",
    "description": "Presented by Federico Lucifredi (Canonical USA). A quick intro to embedded Linux development and a survey of the capabilities and limits of the most interesting hardware available for experimenting by hardware hackers, and the skills needed to make effective use of it. Ranging from Plug Computers to bare development boards, miniaturized systems and rooted hard drives, the ever-growing bestiary of ARM devices at our disposal for projects is fun!",
    "id": 93,
    "begin": "3 Jul 4:10 pm",
    "end": "3 Jul 4:50 pm",
    "dtstart": "20130724T161000",
    "dtend": "20130724T165000"
  },
  {
    "dtstamp": "20130327T234116",
    "location": "D135",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28940",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-17:00--28940",
    "summary": "Squishymedia's KegBot-based technology testbed",
    "description": "Presented by Eric Miller (Squishymedia). What's better than an office kegerator?  An office kegerator that pumps out real-time data that we can use to test new technologies, learn new techniques, and build our skills creating complex distributed systems and real-time information dashboards.   We'll talk to OSCON attendees about the system and how we've used it internally as a learning and testing tool.",
    "id": 94,
    "begin": "3 Jul 5:00 pm",
    "end": "3 Jul 5:40 pm",
    "dtstart": "20130724T170000",
    "dtend": "20130724T174000"
  },
  {
    "dtstamp": "20130326T235817",
    "location": "D135",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29375",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-10:40--29375",
    "summary": "Arduino Hacking 101: Importing the Universe",
    "description": "Presented by Federico Lucifredi (Canonical USA). This session aims to give you the tools to import the real world into the programming scope of your trusty $30 microcontroller, by covering the technology fundamentals and integration essentials of a wide variety of sensors, as well as providing a few alternative power schemes, some actuator examples and even mobility options to increase the variety of your design arsenal.",
    "id": 95,
    "begin": "4 Jul 10:40 am",
    "end": "4 Jul 11:20 am",
    "dtstart": "20130725T104000",
    "dtend": "20130725T112000"
  },
  {
    "dtstamp": "20130403T001941",
    "location": "D135",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29413",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-11:30--29413",
    "summary": "ArduSat: Open Source In Orbit",
    "description": "Presented by Jonathan Oxer (Freetronics). The ArduSat project will launch two Open Source cubesats into orbit in 2013, carrying a payload combining an extensive sensor suite and cameras with a multi-node processor platform based on Arduino. Hobbyists and students will be able to design experiments using regular Arduino hardware, ready to be uploaded and executed on the satellite. Learn about the satellite and how it works.",
    "id": 96,
    "begin": "4 Jul 11:30 am",
    "end": "4 Jul 12:10 pm",
    "dtstart": "20130725T113000",
    "dtend": "20130725T121000"
  },
  {
    "dtstamp": "20130325T172045",
    "location": "D135",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29184",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-13:40--29184",
    "summary": "Open Sourcing Hardware with GitHub",
    "description": "Presented by Christopher Clark (SparkFun Electronics Inc.). Releasing the source is only half the battle. Collaborating with the community to improve it is what can set an open source project apart. This session details the challenges faced by SparkFun Electronics as it pumped an entire catalog of open hardware projects into GitHub and began collaborating with the community to fix bugs, add features, and advance the technology.",
    "id": 97,
    "begin": "4 Jul 1:40 pm",
    "end": "4 Jul 2:20 pm",
    "dtstart": "20130725T134000",
    "dtend": "20130725T142000"
  },
  {
    "dtstamp": "20130329T162537",
    "location": "D135",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28998",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-14:30--28998",
    "summary": "Open Source Hardware with Creative, Free Software Multimedia Development",
    "description": "Presented by Dana Moser (Massachusetts College of Art and Design). Digital Media educator Dana Moser will take you through a number of popular options for open source software-based interactions with the Arduino microcontroller and the Raspberry Pi. Includes Processing and PureData (Pd) programming environments for multimedia development.",
    "id": 98,
    "begin": "4 Jul 2:30 pm",
    "end": "4 Jul 3:10 pm",
    "dtstart": "20130725T143000",
    "dtend": "20130725T151000"
  },
  {
    "dtstamp": "20130326T134224",
    "location": "D135",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28720",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-16:10--28720",
    "summary": "Project Cheesy Fingers:  OpenCompute Hardware Hacking",
    "description": "Presented by Andrew Cencini (Bennington College), Steven White (Nebula). The OpenCompute Hardware Hackathon was designed to bring together electrical, mechanical and software engineers in order to design a novel, low-cost hardware contribution to the OpenComptue project.  In this talk, we discuss our team's winning submission, as well as the ideas, people, tools and process that went into the hack.",
    "id": 99,
    "begin": "4 Jul 4:10 pm",
    "end": "4 Jul 4:50 pm",
    "dtstart": "20130725T161000",
    "dtend": "20130725T165000"
  },
  {
    "dtstamp": "20130325T172716",
    "location": "D135",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29307",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-17:00--29307",
    "summary": "Who’s there? - Home Automation with Arduino/RaspberryPi",
    "description": "Presented by Rupa Dachere (CodeChix). Have you ever found yourself obsessively checking UPS or FedEx tracking site to see if your package finally got delivered at your doorstep? Or wondered when your contractor/gardener showed up to do their job? Come join me to learn how to build your own gadget to notify you when your package or contractor shows up at your doorstep!",
    "id": 100,
    "begin": "4 Jul 5:00 pm",
    "end": "4 Jul 5:40 pm",
    "dtstart": "20130725T170000",
    "dtend": "20130725T174000"
  },
  {
    "dtstamp": "20130402T135710",
    "location": "D135",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28017",
    "uid": "http://oscon.com/oscon2013--s2013-07-26-10:00--28017",
    "summary": "Losing Transactions: Survival Guide",
    "description": "Presented by Joakim Recht (Tradeshift). Going from a transactional SQL/ACID-based system, to a scalable NoSQL-based system can be both scary and somewhat mysterious. Many developers don't believe it can be done. It can, however. In this talk, we'll see how and to what degree.",
    "id": 101,
    "begin": "5 Jul 10:00 am",
    "end": "5 Jul 10:40 am",
    "dtstart": "20130726T100000",
    "dtend": "20130726T104000"
  },
  {
    "dtstamp": "20130325T174211",
    "location": "D135",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28186",
    "uid": "http://oscon.com/oscon2013--s2013-07-26-11:00--28186",
    "summary": "PostgreSQL as a Non-SQL Database",
    "description": "Presented by Christophe Pettus (PostgreSQL Experts, Inc.). With the addition of JSON functionality, PostgreSQL can hold its trunk high when compared to non-SQL databases. We'll explore the ways you can use the non-structured-data features of PostgreSQL, how they perform... and when you shouldn't use them.",
    "id": 102,
    "begin": "5 Jul 11:00 am",
    "end": "5 Jul 11:40 am",
    "dtstart": "20130726T110000",
    "dtend": "20130726T114000"
  },
  {
    "dtstamp": "20130723T212812",
    "location": "D135",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31561",
    "uid": "http://oscon.com/oscon2013--s2013-07-26-11:50--31561",
    "summary": "The OpenStack Continuous Integration and Code Review Process for other Open Source projects",
    "description": "Presented by Mark Atwood (HP Cloud Services), Monty Taylor (HP), Elizabeth Krumbach Joseph (HP). In this session, a high level overview of the OpenStack Infra Review and CI systems will be presented, and the workaday life of an OpenStack code contributor and an OpenStack code reviewer will be described.  We will then solicit questions from the audience, and hopefully explore ways that this system can help your project.",
    "id": 103,
    "begin": "5 Jul 11:50 am",
    "end": "5 Jul 12:30 pm",
    "dtstart": "20130726T115000",
    "dtend": "20130726T123000"
  },
  {
    "dtstamp": "20130522T180445",
    "location": "D135",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29691",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-19:00--29691",
    "summary": "Small Birds, Big Feathers: Kids Using Open Source Software and Hardware",
    "description": "This session is aimed at providing kids attending OSCON the opportunity to hack on open source software and hardware projects. It's also an opportunity for adults to facilitate kids making these projects their own.",
    "id": 104,
    "begin": "3 Jul 7:00 pm",
    "end": "3 Jul 8:00 pm",
    "dtstart": "20130724T190000",
    "dtend": "20130724T200000"
  },
  {
    "dtstamp": "20130520T170040",
    "location": "D135",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/30218",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-19:00--30218",
    "summary": "Using Wearable Tech and Metaphoric Data Viz to Augment the Experience of Watching Performance Art",
    "description": "As part of my graduate research I've been experimenting with how new media artists can use wearable tech to help tell a story in the realm of performance art. I intend to showcase some of my work, and describe the challenges and opportunities I discovered in this process.",
    "id": 105,
    "begin": "4 Jul 7:00 pm",
    "end": "4 Jul 8:00 pm",
    "dtstart": "20130725T190000",
    "dtend": "20130725T200000"
  },
  {
    "dtstamp": "20130625T171325",
    "location": "D135",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31397",
    "uid": "http://oscon.com/oscon2013--s2013-07-22-19:00--31397",
    "summary": "Private Cloud War Stories",
    "description": "Users have high expectations of what private clouds can do for them. Sometimes the realities are less glamorous. In this session, we'd like to gather real private cloud warriors to tell war stories, show off battle scars, and share tips about how to make the reality live up to the hype.",
    "id": 106,
    "begin": "1 Jul 7:00 pm",
    "end": "1 Jul 8:00 pm",
    "dtstart": "20130722T190000",
    "dtend": "20130722T200000"
  },
  {
    "dtstamp": "20130724T160650",
    "location": "D136",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29623",
    "uid": "http://oscon.com/oscon2013--s2013-07-22-09:00--29623",
    "summary": "Android Up and Running",
    "description": "Presented by Marko Gargenta (Marakana). Android Up and Running tutorial is a fastpaced handson introduction to Android app development for those already proficient in Java. By the end of this tutorial, you should understand how to go about building a very simple Android app.",
    "id": 107,
    "begin": "1 Jul 9:00 am",
    "end": "1 Jul 12:30 pm",
    "dtstart": "20130722T090000",
    "dtend": "20130722T123000"
  },
  {
    "dtstamp": "20130724T203604",
    "location": "D136",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29404",
    "uid": "http://oscon.com/oscon2013--s2013-07-22-13:30--29404",
    "summary": "Building Your First Mobile Application: PhoneGap, jQuery Mobile, and Usergrid",
    "description": "Presented by Tim Anglade (Apigee). An introduction to mobile app development for novices.",
    "id": 108,
    "begin": "1 Jul 1:30 pm",
    "end": "1 Jul 5:00 pm",
    "dtstart": "20130722T133000",
    "dtend": "20130722T170000"
  },
  {
    "dtstamp": "20130724T212943",
    "location": "D136",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28834",
    "uid": "http://oscon.com/oscon2013--s2013-07-23-09:00--28834",
    "summary": "Writing Idiomatic PHP",
    "description": "Presented by David Sklar (Ning (Glam Media)). This tutorial gives you the details you need to become an idiomatic PHP programmer when you're coming from another language. We won't waste time on basics but instead tour the landscape of the \"PHP way\" to approach tasks and concepts that you already know how to do in another language, such as wrangling types, OO, errors, performance, external packages, and development environment.",
    "id": 109,
    "begin": "2 Jul 9:00 am",
    "end": "2 Jul 12:30 pm",
    "dtstart": "20130723T090000",
    "dtend": "20130723T123000"
  },
  {
    "dtstamp": "20130724T214152",
    "location": "D136",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29119",
    "uid": "http://oscon.com/oscon2013--s2013-07-23-13:30--29119",
    "summary": "Erlang 101 - Your Intro to Actor and Multi-Core Programming",
    "description": "Presented by Francesco Cesarini (Erlang Solutions Ltd). Erlang's basic features are a perfect match for massively concurrent, distributed cloud environments. Being rooted in an actor model with no shared memory, the complexity of multi-core programming is hidden from the developers, allowing them to focus on the program. This tutorial will introduce Erlang and its actor model, explaining how it is positioning itself to win the multi-core challenge.",
    "id": 110,
    "begin": "2 Jul 1:30 pm",
    "end": "2 Jul 5:00 pm",
    "dtstart": "20130723T133000",
    "dtend": "20130723T170000"
  },
  {
    "dtstamp": "20130724T233025",
    "location": "D136",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29377",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-10:40--29377",
    "summary": "Scrape the web speedily, reliably, and simply with scrapy",
    "description": "Presented by Asheesh Laroia (OpenHatch). Scrapy lets you straightforwardly pull data out of the web. It helps you retry if the site is down, extract content from pages using CSS selectors (or XPath), and cover your code with tests. It downloads asynchronously with high performance. You program to a simple model, and it's good for web APIs, too. If you use requests, mechanize, or celery for HTTP, you should probably switch to scrapy.",
    "id": 111,
    "begin": "3 Jul 10:40 am",
    "end": "3 Jul 11:20 am",
    "dtstart": "20130724T104000",
    "dtend": "20130724T112000"
  },
  {
    "dtstamp": "20130724T230501",
    "location": "D136",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28597",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-11:30--28597",
    "summary": "Finding cacheable areas in your Web Site using Python and Selenium",
    "description": "Presented by David Elfi (Intel Corporation). Web applications are world wide spread nowadays requesting an acceptable response time across all the GEOs. That can be achieved by the use of caching systems. But, how do you know your data can be cached? And even more, how long? This presentation will show how to use Selenium WebDriver from python and doing web scraping for identifying the datasets and the time frame to use for a web site.",
    "id": 112,
    "begin": "3 Jul 11:30 am",
    "end": "3 Jul 12:10 pm",
    "dtstart": "20130724T113000",
    "dtend": "20130724T121000"
  },
  {
    "dtstamp": "20130325T173941",
    "location": "D136",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28590",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-13:40--28590",
    "summary": "Developers + Designers: Collaborating on your Open Source project",
    "description": "Presented by Mark Lavin (Caktus Consulting Group), Julia Elman (Caktus Consulting Group). Working in teams is an important part of what we do as developers and designers. Whether it's desktop applications or mobile sites, we work hand in hand to create sucessful end products. But how do we work together in different kinds of environments? What is the best work-flow for a mix of skill sets? This talk will outline various methods and work-flows for successful collaboration.",
    "id": 113,
    "begin": "3 Jul 1:40 pm",
    "end": "3 Jul 2:20 pm",
    "dtstart": "20130724T134000",
    "dtend": "20130724T142000"
  },
  {
    "dtstamp": "20130725T000011",
    "location": "D136",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29088",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-14:30--29088",
    "summary": "Supercharged Human-centered Design in Open Source Software",
    "description": "Presented by Tony Santos (Mozilla). The best tech companies know that designing products with their users in mind is the key to success. Everyone says \"Design\" is the new hot skill in the tech world. Not only can open source projects benefit from human-centered design practices, they are in a position to get super charged results. Learn the basics of HCD thinking and practices, and how to incorporate it into your next project.",
    "id": 114,
    "begin": "3 Jul 2:30 pm",
    "end": "3 Jul 3:10 pm",
    "dtstart": "20130724T143000",
    "dtend": "20130724T151000"
  },
  {
    "dtstamp": "20130724T234706",
    "location": "D136",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29030",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-16:10--29030",
    "summary": "Python in an evolving enterprise system: Integration solutions with Hadoop",
    "description": "Presented by Angelica Pando (AppNexus), Steve Kannan (AppNexus), Dave Himrod (AppNexus). We'd like to share our best practices and lessons learned when integrating and scaling Python-based optimization tools with a Hadoop-based data pipeline. In our talk, we'll explore multiple Python-Hadoop integration options, share our evaluation process, and invite an interactive dialogue of lessons learned.",
    "id": 115,
    "begin": "3 Jul 4:10 pm",
    "end": "3 Jul 4:50 pm",
    "dtstart": "20130724T161000",
    "dtend": "20130724T165000"
  },
  {
    "dtstamp": "20130725T005216",
    "location": "D136",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28791",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-17:00--28791",
    "summary": "Distributed Coordination with Python",
    "description": "Presented by Ben Bangert (Mozilla).     Processes in a cluster can require controlled access to shared resources, tracking available processes, and sharing state. Unfortunately most tools in this category are oriented around Java. In this talk I cover how to use Python to interact with Apache Zookeeper -- a fault-tolerant consistent data-store -- to write coordinated distributed fault-tolerant applications in Python.",
    "id": 116,
    "begin": "3 Jul 5:00 pm",
    "end": "3 Jul 5:40 pm",
    "dtstart": "20130724T170000",
    "dtend": "20130724T174000"
  },
  {
    "dtstamp": "20130326T231938",
    "location": "D136",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28694",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-10:40--28694",
    "summary": "\"Good enough\" is good enough!",
    "description": "Presented by Alex Martelli (Google). Our culture's default assumption is that everybody should always be striving for perfection -- settling for anything less is seen as a regrettable compromise. This is wrong in most software development situations: focus instead on keeping the software simple, just \"good enough\", launch it early, and iteratively improve, enhance, and re-factor it. This is how software success is achieved!",
    "id": 117,
    "begin": "4 Jul 10:40 am",
    "end": "4 Jul 11:20 am",
    "dtstart": "20130725T104000",
    "dtend": "20130725T112000"
  },
  {
    "dtstamp": "20130325T172743",
    "location": "D136",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28532",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-11:30--28532",
    "summary": "Rethinking Errors: Learning from Scala and Go",
    "description": "Presented by Bruce Eckel (Mindview, LLC). C++ brought exceptions to mainstream programming; Java goes further with checked exceptions. But are exceptions the one way to report all errors? Scala and Go suggest there is more than one kind of error, so there should be more than one kind of error reporting, and different responses to errors. I’ll show the Scala and Go approaches to the error problem, and how to apply this to Python.",
    "id": 118,
    "begin": "4 Jul 11:30 am",
    "end": "4 Jul 12:10 pm",
    "dtstart": "20130725T113000",
    "dtend": "20130725T121000"
  },
  {
    "dtstamp": "20130708T163739",
    "location": "D136",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28897",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-13:40--28897",
    "summary": "Harvest: Data Discovery for Humans",
    "description": "Presented by Byron Ruth (The Children's Hospital of Philadelphia), Michael Italia (The Children's Hospital of Philadelphia). The biomedical research community is amidst a data revolution driven by the adoption of electronic health records and the arrival of next generation genomic technologies. Researchers require tools that scale with this increase without added complexity. To address this need we have developed Harvest, an open source framework for rapid development of purpose-built data discovery web applications.",
    "id": 119,
    "begin": "4 Jul 1:40 pm",
    "end": "4 Jul 2:20 pm",
    "dtstart": "20130725T134000",
    "dtend": "20130725T142000"
  },
  {
    "dtstamp": "20130331T025600",
    "location": "D136",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28821",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-14:30--28821",
    "summary": "Designing The Internet of Things with the 3 Laws of Robotics",
    "description": "Presented by Joshua Marinacci (Nokia). We are rapidly approaching the age of living spaces filled with smart thermostats, doors, lights, toilets and more. How do we design interfaces for them? How can people manage 200 gadgets each demanding new batteries? What if your networked toaster rats you out to the FBI? We will explore using the classic Three Laws of Robotics to guide interface design of the Internet of Things.",
    "id": 120,
    "begin": "4 Jul 2:30 pm",
    "end": "4 Jul 3:10 pm",
    "dtstart": "20130725T143000",
    "dtend": "20130725T151000"
  },
  {
    "dtstamp": "20130402T073952",
    "location": "D136",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29374",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-16:10--29374",
    "summary": "Python 103: Memory Model & Best Practices",
    "description": "Presented by wesley chun (Google). There's a growing crowd of Python users who don't consider themselves beginners anymore. However some may notice behavior that's hard to explain. Why doesn't code behave like it should? Why doesn't \"correct\" code run correctly? We'll look at Python's memory model & best practices, addressing these issues directly. Let's empower attendees to write good code & not create these bugs to begin with!",
    "id": 121,
    "begin": "4 Jul 4:10 pm",
    "end": "4 Jul 4:50 pm",
    "dtstart": "20130725T161000",
    "dtend": "20130725T165000"
  },
  {
    "dtstamp": "20130404T192022",
    "location": "D136",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29389",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-17:00--29389",
    "summary": "The vanishing pattern: from iterators to generators in Python",
    "description": "Presented by Luciano Ramalho (Oficinas Turing). From the elegant for statement through list/set/dict comprehensions and generator functions, this talk shows how the Iterator pattern is so deeply embedded in the syntax of Python, and so widely supported by its libraries, that some of its most powerful applications can be overlooked by programmers coming from other languages.",
    "id": 122,
    "begin": "4 Jul 5:00 pm",
    "end": "4 Jul 5:40 pm",
    "dtstart": "20130725T170000",
    "dtend": "20130725T174000"
  },
  {
    "dtstamp": "20130425T200717",
    "location": "D136",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28946",
    "uid": "http://oscon.com/oscon2013--s2013-07-26-10:00--28946",
    "summary": "Sound Analysis with the Fourier Transform and Python",
    "description": "Presented by Caleb Madrigal (SpiderLogic). Learn about what has been called \"most important numerical algorithm of our lifetime\" - the Fast Fourier Transform (FFT).  In this talk, you will get foundational knowledge of the Fourier Transform and learn how to use Python to extract useful information from sound clips.",
    "id": 123,
    "begin": "5 Jul 10:00 am",
    "end": "5 Jul 10:40 am",
    "dtstart": "20130726T100000",
    "dtend": "20130726T104000"
  },
  {
    "dtstamp": "20130325T184554",
    "location": "D136",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28941",
    "uid": "http://oscon.com/oscon2013--s2013-07-26-11:00--28941",
    "summary": "The Linux Way: Rebuilding The Unix Way for a New Era",
    "description": "Presented by Andy Grover (Red Hat). The development of GNU/Linux has resulted in major parts of the platform evolving away from UNIX's core tenets.",
    "id": 124,
    "begin": "5 Jul 11:00 am",
    "end": "5 Jul 11:40 am",
    "dtstart": "20130726T110000",
    "dtend": "20130726T114000"
  },
  {
    "dtstamp": "20130709T202455",
    "location": "D136",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28542",
    "uid": "http://oscon.com/oscon2013--s2013-07-26-11:50--28542",
    "summary": "Free Software Contributions Made Easier and Quicker",
    "description": "Presented by Loic Dachary (Upstream University). Contributing to Free Software requires a delicate mixture of technical and social skills. Is the developer upstream not being responsive? Does your manager think you're wasting your time? Upstream University has successfully trained developers to become better contributors to projects such as the kernel Linux, and will give each participant a chance to learn new ways of resolving these problems.",
    "id": 125,
    "begin": "5 Jul 11:50 am",
    "end": "5 Jul 12:30 pm",
    "dtstart": "20130726T115000",
    "dtend": "20130726T123000"
  },
  {
    "dtstamp": "20130516T210355",
    "location": "D136",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29677",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-19:00--29677",
    "summary": "MySQL Community",
    "description": "BOF for all interested in MySQL, the MySQL Community,  and all the surrounding technology that relies on MySQL. Lets talk about the current and future of MySQL -- where you think it should be heading -- and network with others.  Good for all audience levels.",
    "id": 126,
    "begin": "3 Jul 7:00 pm",
    "end": "3 Jul 8:00 pm",
    "dtstart": "20130724T190000",
    "dtend": "20130724T200000"
  },
  {
    "dtstamp": "20130713T071548",
    "location": "D136",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31135",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-19:00--31135",
    "summary": "What is Python?",
    "description": "Python's a simple & robust programming language that has an ever-increasing mindshare & number of worldwide users. It features an easy-to-learn syntax that is clear & concise, making it popular for a wide range of apps. This tutorial provides an in-depth introduction so you can get started right away! Come find out why Google, Yahoo, LucasFilm, VMware, Ubuntu, YouTube, & Red Hat all use Python.",
    "id": 127,
    "begin": "4 Jul 7:00 pm",
    "end": "4 Jul 8:00 pm",
    "dtstart": "20130725T190000",
    "dtend": "20130725T200000"
  },
  {
    "dtstamp": "20130724T205713",
    "location": "D137/138",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28827",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-10:40--28827",
    "summary": "Increasing OSS Adoption and Contribution In Your Company",
    "description": "Presented by Doug Gaff (NPR Digital Services). This talk is for technical leaders and managers who want their companies to do more in open source. I will give you a CC-licensed presentation template and techniques for explaining open source business models, communities, licensing, and contribution processes to executives and lawyers in your company. You can then customize this for your own company and make the pitch for more OSS involvement.",
    "id": 128,
    "begin": "3 Jul 10:40 am",
    "end": "3 Jul 11:20 am",
    "dtstart": "20130724T104000",
    "dtend": "20130724T112000"
  },
  {
    "dtstamp": "20130724T223554",
    "location": "D137/138",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28995",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-11:30--28995",
    "summary": "Internal Open Source: Running internal projects with open-source methods",
    "description": "Presented by Camille Fournier (Rent the Runway). Most companies large and small have shared internal libraries and systems. But ownership of that code often falls onto people with different priorities than the users of the code. We will discuss how you can use open source practices to run internal code bases effectively, provide learning opportunities for employees, and improve your final products.",
    "id": 129,
    "begin": "3 Jul 11:30 am",
    "end": "3 Jul 12:10 pm",
    "dtstart": "20130724T113000",
    "dtend": "20130724T121000"
  },
  {
    "dtstamp": "20130724T232300",
    "location": "D137/138",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28631",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-13:40--28631",
    "summary": "How to Recruit, Hire, and Retain a Diverse Team",
    "description": "Presented by Rikki Endsley (USENIX Association). Many tech companies and hiring managers would like to hire from a more diverse pool of qualified applicants, but they keep getting the same kinds of candidates. This talk provides specific tips for tweaking recruiting practices to attract a diverse pool of candidates, and offers tips for creating a culture that helps retain a diverse team of tech talent.",
    "id": 130,
    "begin": "3 Jul 1:40 pm",
    "end": "3 Jul 2:20 pm",
    "dtstart": "20130724T134000",
    "dtend": "20130724T142000"
  },
  {
    "dtstamp": "20130725T005138",
    "location": "D137/138",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29163",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-14:30--29163",
    "summary": "Burnout and Bickering: a Community Manager's Guide to Conflict",
    "description": "Presented by Jono Bacon (Canonical Ltd). One of the most challenging aspects of growing community is managing conflict and burnout. In this new presentation from Jono Bacon, the Ubuntu Community Manager, he presents a comprehensive guide to the different components of conflict and burnout, signs of problems, conflict resolution, and preventative measures, all wrapped up in his amusing anecdote-laden style.",
    "id": 131,
    "begin": "3 Jul 2:30 pm",
    "end": "3 Jul 3:10 pm",
    "dtstart": "20130724T143000",
    "dtend": "20130724T151000"
  },
  {
    "dtstamp": "20130725T003136",
    "location": "D137/138",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29379",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-16:10--29379",
    "summary": "The Legal Side of the POSS World",
    "description": "Presented by Richard Fontana (Red Hat, Inc.). This talk will explore some of the legal and policy implications of \"post-open source software\" or \"POSS\", a purported phenomenon characterized by development on github, no explicit indication of open source licensing, and no concern for project governance. Is any of this real, and if so, is it actually a problem?",
    "id": 132,
    "begin": "3 Jul 4:10 pm",
    "end": "3 Jul 4:50 pm",
    "dtstart": "20130724T161000",
    "dtend": "20130724T165000"
  },
  {
    "dtstamp": "20130401T165133",
    "location": "D137/138",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28947",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-17:00--28947",
    "summary": "Protecting Open Innovation with the Defensive Patent License",
    "description": "Presented by Jennifer Urban (UC-Berkeley). The Defensive Patent License (DPL) is a new legal mechanism to protect innovators by creating a patent network that is committed to defense and \"de-weaponizing\" patents. It draws from the theories and values of F/OSS licensing to create obligations that \"travel with the patent\"--preventing troll from taking over open technologies and pulling them out of the public domain.",
    "id": 133,
    "begin": "3 Jul 5:00 pm",
    "end": "3 Jul 5:40 pm",
    "dtstart": "20130724T170000",
    "dtend": "20130724T174000"
  },
  {
    "dtstamp": "20130521T222050",
    "location": "D137/138",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28780",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-10:40--28780",
    "summary": "Evolutionary Architecture and Emergent Design",
    "description": "Presented by Neal Ford (ThoughtWorks). This session talks about the tension between architecture & design in agile projects, discussing two key elements of emergent design (utilizing the last responsible moment and harvesting idiomatic patterns) and how to de-brittlize your architecture, so that you can play nicely with others",
    "id": 134,
    "begin": "4 Jul 10:40 am",
    "end": "4 Jul 11:20 am",
    "dtstart": "20130725T104000",
    "dtend": "20130725T112000"
  },
  {
    "dtstamp": "20130329T154621",
    "location": "D137/138",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28139",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-11:30--28139",
    "summary": "Open Government as Open Source",
    "description": "Presented by Jeanne Holm (Jet Propulsion Laboratory, NASA). The governments of the US and India have released the Open Government Platform, an open source capability for any government to use to create an open data portal. Such projects encourage transparency, innovation, and economic growth in nations. The OGPL community encompasses hundreds of individuals from across the world to help further these shared goals.",
    "id": 135,
    "begin": "4 Jul 11:30 am",
    "end": "4 Jul 12:10 pm",
    "dtstart": "20130725T113000",
    "dtend": "20130725T121000"
  },
  {
    "dtstamp": "20130724T204700",
    "location": "D137/138",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29092",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-13:40--29092",
    "summary": "A Tech-Liberty Scorecard",
    "description": "Presented by Dan Gillmor (The Guardian/Arizona State University's Cronkite School of Journalism & Mass Communication). Big companies and governments are recentralizing our computing and communications, giving us convenience but taking away edge-of-network liberties we enjoyed in the Internet's early days. Meanwhile, surveillance and black-hat hacking are growing. Let's create a scorecard that tells us -- users, companies, governments -- what level of liberty we have, or allow.",
    "id": 136,
    "begin": "4 Jul 1:40 pm",
    "end": "4 Jul 2:20 pm",
    "dtstart": "20130725T134000",
    "dtend": "20130725T142000"
  },
  {
    "dtstamp": "20130521T222102",
    "location": "D137/138",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29237",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-14:30--29237",
    "summary": "Can Evil Corporations Embrace Open Source?",
    "description": "Presented by Simon  Phipps (Open Source Initiative). Can a corporate predator become a community herbivore? Perhaps - corporations take a journey from control freak to community contributor. Hear about the journey and the key changes that can make it succeed.",
    "id": 137,
    "begin": "4 Jul 2:30 pm",
    "end": "4 Jul 3:10 pm",
    "dtstart": "20130725T143000",
    "dtend": "20130725T151000"
  },
  {
    "dtstamp": "20130325T172356",
    "location": "D137/138",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29270",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-16:10--29270",
    "summary": "Choose Your Own Adventure - Growing Your Own Career in Open Source",
    "description": "Presented by Amye Scavarda (Acquia), Leslie Hawthorn (Red Hat). You're a fantastic developer/coder of all trades/project manager/designer/sysadmin - but you want to be able to do a little more. What's your strategy for being able to choose your next level up?  We’ll review: strategic and tactical steps, choosing your adventure and acting on it from both a business perspective of a 'career track' as well as ways to be able to participate through open source.",
    "id": 138,
    "begin": "4 Jul 4:10 pm",
    "end": "4 Jul 4:50 pm",
    "dtstart": "20130725T161000",
    "dtend": "20130725T165000"
  },
  {
    "dtstamp": "20130329T155726",
    "location": "D137/138",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29258",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-17:00--29258",
    "summary": "How to Delegate, Like a Boss",
    "description": "Presented by Deb Nicholson (Open Invention Network). Many projects would like to have more people doing more stuff, but delegating seems time-consuming. Meanwhile, new contributor enthusiasm is one of the most valuable commodities in the free software world. Great delegators know how to attract enthusiastic new people and maintain their momentum once they've arrived.",
    "id": 139,
    "begin": "4 Jul 5:00 pm",
    "end": "4 Jul 5:40 pm",
    "dtstart": "20130725T170000",
    "dtend": "20130725T174000"
  },
  {
    "dtstamp": "20130325T172439",
    "location": "D137/138",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29390",
    "uid": "http://oscon.com/oscon2013--s2013-07-26-10:00--29390",
    "summary": "How Not to Make Money in Open Source",
    "description": "Presented by Paul Brown (Multifarious, Inc). This talk progresses through a succession of counterexamples (and a few examples) in combining business and open source.  We will cover ways to divide your community, withhold value from your customers (paying and not), squander good will, and inhibit adoption.",
    "id": 140,
    "begin": "5 Jul 10:00 am",
    "end": "5 Jul 10:40 am",
    "dtstart": "20130726T100000",
    "dtend": "20130726T104000"
  },
  {
    "dtstamp": "20130325T232842",
    "location": "D137/138",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29186",
    "uid": "http://oscon.com/oscon2013--s2013-07-26-11:00--29186",
    "summary": "Once Upon a CVE: Managing Security Events as an Upstream",
    "description": "Presented by Michael Stahnke (Puppet Labs). How should an upstream project react when it discovers a security problem? Projects used by many distributions have lots of exposure when security bugs are identified. Since we can’t keep security events from happening, we need to be good at fixing them in a timely, responsible manner. This talk covers how to handle security events from disclosure to resolution as modeled by the Puppet project.",
    "id": 141,
    "begin": "5 Jul 11:00 am",
    "end": "5 Jul 11:40 am",
    "dtstart": "20130726T110000",
    "dtend": "20130726T114000"
  },
  {
    "dtstamp": "20130326T204516",
    "location": "D137/138",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28558",
    "uid": "http://oscon.com/oscon2013--s2013-07-26-11:50--28558",
    "summary": "Secure Open Source Development",
    "description": "Presented by Josh Bressers (Red Hat Inc.). Open source is often thought of as being secure. While in the past we've had very good luck with security, there's still plenty of room in the area of secure development in open source. Let's start the discussion about where we are today, where we want to be, and how to best get us there for secure development in open source.",
    "id": 142,
    "begin": "5 Jul 11:50 am",
    "end": "5 Jul 12:30 pm",
    "dtstart": "20130726T115000",
    "dtend": "20130726T123000"
  },
  {
    "dtstamp": "20130724T202301",
    "location": "D137/138",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28585",
    "uid": "http://oscon.com/oscon2013--s2013-07-22-09:00--28585",
    "summary": "The Accidental DBA Tutorial",
    "description": "Presented by Josh Berkus (PostgreSQL Experts, Inc.). So, you've inherited a PostgreSQL server.  Congratulations? Thanks to Postgres' popularity as the database for new applications, thousands of developers, system administrators and devops are finding themselves in charge of PostgreSQL servers with no idea what to do next.  This tutorial will cover the essentials.",
    "id": 143,
    "begin": "1 Jul 9:00 am",
    "end": "1 Jul 12:30 pm",
    "dtstart": "20130722T090000",
    "dtend": "20130722T123000"
  },
  {
    "dtstamp": "20130724T232114",
    "location": "D137/138",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28109",
    "uid": "http://oscon.com/oscon2013--s2013-07-22-13:30--28109",
    "summary": "Creating Environments for Innovation to Flourish",
    "description": "Presented by Laszlo Szalvay (CollabNet, Inc. ). Does your organization suck at bringing awesome products to market? Are you wishing that you weren't lagging behind your competitors or struggling to create a culture and environment that would enable building the next killer application?  If so, come to this business track focused workshop to learn from an experienced entrepreneur how to enable your teams to innovate more effectively.",
    "id": 144,
    "begin": "1 Jul 1:30 pm",
    "end": "1 Jul 5:00 pm",
    "dtstart": "20130722T133000",
    "dtend": "20130722T170000"
  },
  {
    "dtstamp": "20130724T220506",
    "location": "D137/138",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28801",
    "uid": "http://oscon.com/oscon2013--s2013-07-23-09:00--28801",
    "summary": "Web Accessibility for the 21st Century",
    "description": "Presented by Denise Paolucci (Dreamwidth Studios), Deborah Kaplan (Dreamwidth Studios). An extensive look at simple, practical, concrete methods to make your website or webapp more accessible for people with disabilities and in all forms of assistive technology. Participants will leave with a number of tips, tricks, and tools they can use on any site, no matter how simple or fancy it is -- and a number of examples of doing it incorrectly.",
    "id": 145,
    "begin": "2 Jul 9:00 am",
    "end": "2 Jul 12:30 pm",
    "dtstart": "20130723T090000",
    "dtend": "20130723T123000"
  },
  {
    "dtstamp": "20130724T181700",
    "location": "D137/138",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29337",
    "uid": "http://oscon.com/oscon2013--s2013-07-23-13:30--29337",
    "summary": "Neo4j Tutorial",
    "description": "Presented by Michael Hunger (Neo Technology). This tutorial covers the core functionality of the Neo4j graph database. With a mixture of theory and hands-on practice sessions, attendees will quickly learn how easy it is to develop a Neo4j-backed application.",
    "id": 146,
    "begin": "2 Jul 1:30 pm",
    "end": "2 Jul 5:00 pm",
    "dtstart": "20130723T133000",
    "dtend": "20130723T170000"
  },
  {
    "dtstamp": "20130604T213404",
    "location": "D137/138",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/30963",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-19:00--30963",
    "summary": "Salt remote execution and config management",
    "description": "SaltStack is a new remote execution and configuration management software platform that is fast, scalable and open. Salt is used by thousands of systems administrators, cloud orchestrators and DevOps pros to manage millions of servers.",
    "id": 147,
    "begin": "3 Jul 7:00 pm",
    "end": "3 Jul 8:00 pm",
    "dtstart": "20130724T190000",
    "dtend": "20130724T200000"
  },
  {
    "dtstamp": "20130611T222203",
    "location": "D137/138",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31387",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-19:00--31387",
    "summary": "Mozilla @ OSCON",
    "description": "Meet and brain with the Mozilla community at OSCON. We’re a global community of users, contributors and developers working to innovate on your behalf.",
    "id": 148,
    "begin": "4 Jul 7:00 pm",
    "end": "4 Jul 8:00 pm",
    "dtstart": "20130725T190000",
    "dtend": "20130725T200000"
  },
  {
    "dtstamp": "20130709T134245",
    "location": "D137/138",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31451",
    "uid": "http://oscon.com/oscon2013--s2013-07-22-19:00--31451",
    "summary": "jclouds: Control Multi-Cloud Infrastructure With Java",
    "description": "Apache jclouds is an open source library that helps you get started in the cloud and utilizes your Java or Clojure development skills. The jclouds API gives you the freedom to use portable abstractions or cloud-specific features. It's a multi-cloud toolkit that works with both public and private clouds, enabling hybrid cloud workloads. Learn more during this BoF.",
    "id": 149,
    "begin": "1 Jul 7:00 pm",
    "end": "1 Jul 8:00 pm",
    "dtstart": "20130722T190000",
    "dtend": "20130722T200000"
  },
  {
    "dtstamp": "20130723T175835",
    "location": "D139/140",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28493",
    "uid": "http://oscon.com/oscon2013--s2013-07-22-09:00--28493",
    "summary": "Moose: A Guide to the New Revolution",
    "description": "Presented by Ricardo Signes (Pobox.com). Moose continues to emerge as the new standard for writing OO libraries in Perl. It provides a powerful, consistent API for building classes with a minimum of code. It can be customized with reusable components, making it easier to refactor your code as you go. This tutorial will explain what Moose is, how its parts work together, and how to start using Moose today to get more done with less.",
    "id": 150,
    "begin": "1 Jul 9:00 am",
    "end": "1 Jul 12:30 pm",
    "dtstart": "20130722T090000",
    "dtend": "20130722T123000"
  },
  {
    "dtstamp": "20130724T221153",
    "location": "D139/140",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28716",
    "uid": "http://oscon.com/oscon2013--s2013-07-22-13:30--28716",
    "summary": "High Availability in MySQL",
    "description": "Presented by Henrik Ingo (10gen). High Availability has become a mandatory feature for databases. MySQL replication is the most used replication solution on the Internet, but a whole family of alternative exists in the MySQL ecosystem. This tutorial walks you through your options and teaches you how to weigh the pro's and con's of each to pick a solution that best matches your use case.",
    "id": 151,
    "begin": "1 Jul 1:30 pm",
    "end": "1 Jul 5:00 pm",
    "dtstart": "20130722T133000",
    "dtend": "20130722T170000"
  },
  {
    "dtstamp": "20130724T052554",
    "location": "D139/140",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29259",
    "uid": "http://oscon.com/oscon2013--s2013-07-23-09:00--29259",
    "summary": "Community-Driven Event Planning",
    "description": "Presented by Christie Koehler (Mozilla / Stumptown Syndicate), Audrey Eschright (Elevated Code / Stumptown Syndicate), Sherri Montgomery (Open Source Bridge / Ignite Portland / Mentor Graphics). A fun, interactive, and comprehensive tutorial on how to host a successful code sprint, hackathon, (un)conference or workshop.",
    "id": 152,
    "begin": "2 Jul 9:00 am",
    "end": "2 Jul 12:30 pm",
    "dtstart": "20130723T090000",
    "dtend": "20130723T123000"
  },
  {
    "dtstamp": "20130724T221140",
    "location": "D139/140",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29335",
    "uid": "http://oscon.com/oscon2013--s2013-07-23-13:30--29335",
    "summary": "Easier Documentation, Simpler Websites And Faster Collaboration",
    "description": "Presented by Dan Allen (Red Hat, Inc.), Sarah White (Asciidoctor Project). Writing e-mail is easy. We do it all the time. But it only reaches a limited audience. Writing documentation is hard. We don't do it as often. But online documentation can reach an unlimited audience. Attend this session to learn how lightweight markup makes documentation easier, static site generators make websites simpler and GitHub makes collaborating on content and publishing it online faster.",
    "id": 153,
    "begin": "2 Jul 1:30 pm",
    "end": "2 Jul 5:00 pm",
    "dtstart": "20130723T133000",
    "dtend": "20130723T170000"
  },
  {
    "dtstamp": "20130724T191025",
    "location": "D139/140",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28086",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-10:40--28086",
    "summary": "Real World Dependency Injection",
    "description": "Presented by Stephan Hochdörfer (bitExpert AG). The Dependency Injection (DI) pattern is getting more and more popular in the PHP world. It focuses on the complete separation of object instantiation and dependency tracking from the business logic resulting in a loosely coupled system. This session will introduce the basics of the DI pattern to the audience as well as sharing real world experience from several projects over the last seven years.",
    "id": 154,
    "begin": "3 Jul 10:40 am",
    "end": "3 Jul 11:20 am",
    "dtstart": "20130724T104000",
    "dtend": "20130724T112000"
  },
  {
    "dtstamp": "20130725T004005",
    "location": "D139/140",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28774",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-11:30--28774",
    "summary": "HipHop VM: PHP on the metal",
    "description": "Presented by Joel Pobar (Facebook). The PHP language resists efficient execution. Like many other web languages, PHP offers programmers the conveniences of dynamic typing, and late binding for functions and classes. Facebook's HipHop VM (HHVM) is a new execution engine for PHP that combines ahead-of-time and just-in-time techniques to try save precious CPU cycles. We'll explore HHVM, and deep dive on the bits that makes it go fast!",
    "id": 155,
    "begin": "3 Jul 11:30 am",
    "end": "3 Jul 12:10 pm",
    "dtstart": "20130724T113000",
    "dtend": "20130724T121000"
  },
  {
    "dtstamp": "20130724T223539",
    "location": "D139/140",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29042",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-13:40--29042",
    "summary": "More Code, More Problems",
    "description": "Presented by Edward Finkler (FictiveKin). Some people will tell you that you need a large, full-stack framework to do web development The Right Way. These people are wrong. In this talk, we'll focus on four core principles to be a better developer and make your projects more manageable: - Learn languages, not frameworks - Build small things - Less code is better than more - Create and use simple, readable code",
    "id": 156,
    "begin": "3 Jul 1:40 pm",
    "end": "3 Jul 2:20 pm",
    "dtstart": "20130724T134000",
    "dtend": "20130724T142000"
  },
  {
    "dtstamp": "20130724T231900",
    "location": "D139/140",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28663",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-14:30--28663",
    "summary": "PHP: Quirks, Gotchas & Wizardry",
    "description": "Presented by Sharon Levy (freelancer; member, PHP Meetups (Orange County: OCPHP and Los Angeles: LAPHP)). This presentation is based on a chapter in a book I'm writing.  I examine how PHP handles hexadecimal, octals and really large numbers.  Unless one is familiar with the C-source code what you see in PHP at times can be difficult to understand and may shock or otherwise surprise you.",
    "id": 157,
    "begin": "3 Jul 2:30 pm",
    "end": "3 Jul 3:10 pm",
    "dtstart": "20130724T143000",
    "dtend": "20130724T151000"
  },
  {
    "dtstamp": "20130725T003840",
    "location": "D139/140",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29012",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-16:10--29012",
    "summary": "PHP in 2013: generators, and password hashing, and finally (oh my!)",
    "description": "Presented by Adam Harvey (N/A). Far from the days of PHP 3 and 4, PHP has developed into a modern object oriented programming language that trades features with many more hyped alternatives and runs an astonishingly high percentage of the world's Web sites. PHP 5.5 brings another round of improvements on top of those that came in PHP 5.4, and this talk will discuss how these can be used to improve your code base.",
    "id": 158,
    "begin": "3 Jul 4:10 pm",
    "end": "3 Jul 4:50 pm",
    "dtstart": "20130724T161000",
    "dtend": "20130724T165000"
  },
  {
    "dtstamp": "20130725T004137",
    "location": "D139/140",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28788",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-17:00--28788",
    "summary": "Daemonizing PHP",
    "description": "Presented by Andy Blyler (Barracuda Networks), Jonathan Kuperman (Barracuda Networks). PHP is commonly thought of as a programming language that is used in web development.  However, it is also a approachable and powerful language to use for creating daemons.  In this session we will discuss why and how we use PHP to run everything from our web interface to our backend processes as part of the Barracuda Backup Service.",
    "id": 159,
    "begin": "3 Jul 5:00 pm",
    "end": "3 Jul 5:40 pm",
    "dtstart": "20130724T170000",
    "dtend": "20130724T174000"
  },
  {
    "dtstamp": "20130328T143304",
    "location": "D139/140",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29142",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-10:40--29142",
    "summary": "The End Of Object Inheritance & The Beginning Of Anti-Rumsfeldian Modularity",
    "description": "Presented by Augie Fackler (Google), Nathaniel Manista (Google). After fifteen years combined experience developing software of all types we are done with object inheritance and the compromises that it forces on us. Come learn about elegant, superior solutions to the problems inheritance claims to adequately solve.",
    "id": 160,
    "begin": "4 Jul 10:40 am",
    "end": "4 Jul 11:20 am",
    "dtstart": "20130725T104000",
    "dtend": "20130725T112000"
  },
  {
    "dtstamp": "20130325T172829",
    "location": "D139/140",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28856",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-11:30--28856",
    "summary": "Finite State Machines - Why the fear?",
    "description": "Presented by Mahesh Paolini-Subramanya (Ubiquiti Networks, Inc.). Finite State Machines are rarely used, and virtually always dismissed as \"too complex\" .  This is a tragedy since FSMs aren't just about Door Locks, but are invaluable in defining _any_ communication protocols.  This talk will provide a crash course in FSMs using erlang's \"gen_fsm\" behavior as a template, hopefully leaving you with a better appreciation of its uses.",
    "id": 161,
    "begin": "4 Jul 11:30 am",
    "end": "4 Jul 12:10 pm",
    "dtstart": "20130725T113000",
    "dtend": "20130725T121000"
  },
  {
    "dtstamp": "20130325T172242",
    "location": "D139/140",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29211",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-13:40--29211",
    "summary": "Interactive debugging in PHP: stealing the good bits from Ruby and JavaScript",
    "description": "Presented by Justin Hileman (Presentate). It's sad that in 2013, var_dump and die are still two of the most common debugging and reflection techniques in PHP. Let's explore the state of interactive debugging in PHP, compare it with what's available in other languages, and apply this with practical tools and techniques which can be used today.",
    "id": 162,
    "begin": "4 Jul 1:40 pm",
    "end": "4 Jul 2:20 pm",
    "dtstart": "20130725T134000",
    "dtend": "20130725T142000"
  },
  {
    "dtstamp": "20130625T182615",
    "location": "D139/140",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29171",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-14:30--29171",
    "summary": "Beginning Drupal for Non-Developers",
    "description": "Presented by Cassandra Wolff (Softlayer an IBM Company). In this 40-minute session, I’d like to discuss the basic business needs in several use-case scenarios that would demonstrate the flexibility of an open-source platform called Drupal, which has made a breakthrough in the CMS community for its extreme flexibility and scalability in rapid development.",
    "id": 163,
    "begin": "4 Jul 2:30 pm",
    "end": "4 Jul 3:10 pm",
    "dtstart": "20130725T143000",
    "dtend": "20130725T151000"
  },
  {
    "dtstamp": "20130325T205805",
    "location": "D139/140",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29106",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-16:10--29106",
    "summary": "OTP, the Middleware for Concurrent Distributed Scalable Architectures",
    "description": "Presented by Francesco Cesarini (Erlang Solutions Ltd). A programming language is not enough to build massively scalable fault tolerant cloud based solutions. You need middleware, architectural patterns and tools fit for the purpose. Erlang is no exception. This talk introduces OTP, the defacto framework that comes as part of the Erlang distribution and for decades, has stopped programmers from reinventing the wheel.",
    "id": 164,
    "begin": "4 Jul 4:10 pm",
    "end": "4 Jul 4:50 pm",
    "dtstart": "20130725T161000",
    "dtend": "20130725T165000"
  },
  {
    "dtstamp": "20130426T144123",
    "location": "D139/140",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28103",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-17:00--28103",
    "summary": "Lightweight Messaging For Web And Mobile With Apache ActiveMQ",
    "description": "Presented by Dejan Bosanac (RedHat). New generation of mobile and web applications use asynchronous messaging extensively. This session will cover protocols and techniques available to use messaging infrastructure directly from web browsers and native mobile applications.",
    "id": 165,
    "begin": "4 Jul 5:00 pm",
    "end": "4 Jul 5:40 pm",
    "dtstart": "20130725T170000",
    "dtend": "20130725T174000"
  },
  {
    "dtstamp": "20130325T173439",
    "location": "D139/140",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28712",
    "uid": "http://oscon.com/oscon2013--s2013-07-26-10:00--28712",
    "summary": "Mobile HTML5: Real Life HTML5 Use Cases for Mobile",
    "description": "Presented by Tomomi Imura (Nokia USA). Showcasing the capabilities of the Web platform and more specifically of the subset of features that mobile platforms can take advantage of, by using an open source mobile app called Coremob Camera, using HTML5 to explain the real-life use cases of HTML5 in mobile. The technology behind the app is purely in HTML, CSS and JavaScript.",
    "id": 166,
    "begin": "5 Jul 10:00 am",
    "end": "5 Jul 10:40 am",
    "dtstart": "20130726T100000",
    "dtend": "20130726T104000"
  },
  {
    "dtstamp": "20130325T172811",
    "location": "D139/140",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28775",
    "uid": "http://oscon.com/oscon2013--s2013-07-26-11:00--28775",
    "summary": "Testing Hybrid Applications on Android",
    "description": "Presented by Joe Bowser (Adobe Systems). This talk will review various approaches to testing a hybrid application, such as a PhoneGap application, on Android.  It will explore the development of testing techniques for Apache Cordova, the open source framework that Adobe PhoneGap is based on, with a focus on both unit testing and functional testing.",
    "id": 167,
    "begin": "5 Jul 11:00 am",
    "end": "5 Jul 11:40 am",
    "dtstart": "20130726T110000",
    "dtend": "20130726T114000"
  },
  {
    "dtstamp": "20130710T143035",
    "location": "D139/140",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29378",
    "uid": "http://oscon.com/oscon2013--s2013-07-26-11:50--29378",
    "summary": "Google, Developers, and Education",
    "description": "Presented by wesley chun (Google). Google's mission is to organize the world's information & make it universally accessible & useful. Education's in our DNA, so we gladly provide resources for coders, students & teachers: teaching tools, developer products, education events, research grants, academic awards/prizes, support, coding competitions, etc. In this talk, I'll give an overview of some of our current education programs/tools",
    "id": 168,
    "begin": "5 Jul 11:50 am",
    "end": "5 Jul 12:30 pm",
    "dtstart": "20130726T115000",
    "dtend": "20130726T123000"
  },
  {
    "dtstamp": "20130611T214352",
    "location": "D139/140",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31363",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-19:00--31363",
    "summary": "Google Summer of Code Birds of a Feather",
    "description": "This is a BoF for all former, current, and potential participants in Google Summer of Code. If you are a student, a mentor, or represent an interested organization, come meet us to talk about the program! Hear from other participants what their experience was like.",
    "id": 169,
    "begin": "3 Jul 7:00 pm",
    "end": "3 Jul 8:00 pm",
    "dtstart": "20130724T190000",
    "dtend": "20130724T200000"
  },
  {
    "dtstamp": "20130715T172205",
    "location": "D139/140",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31466",
    "uid": "http://oscon.com/oscon2013--s2013-07-22-19:00--31466",
    "summary": "An introduction to Unicode",
    "description": "Unicode has been around for a while but it is often poorly understood. This session explores how things used to work before we had Unicode, why we need Unicode, and as programmers, how we can work with it.",
    "id": 170,
    "begin": "1 Jul 7:00 pm",
    "end": "1 Jul 8:00 pm",
    "dtstart": "20130722T190000",
    "dtend": "20130722T200000"
  },
  {
    "dtstamp": "20130709T051423",
    "location": "D139/140",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31476",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-19:00--31476",
    "summary": "So you want to collect lots of metrics? Join the discussion around Blueflood from Rackspace",
    "description": "Please join to learn and/or contribute to the topic around software metrics gathering and analyzing, as we celebrate the first release of Blueflood project. Blueflood is the component that has been the backbone of Cloud Monitoring from Rackspace and it is designed to meet the special need of cloud applications.",
    "id": 171,
    "begin": "4 Jul 7:00 pm",
    "end": "4 Jul 8:00 pm",
    "dtstart": "20130725T190000",
    "dtend": "20130725T200000"
  },
  {
    "dtstamp": "20130724T231109",
    "location": "E143/144",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28877",
    "uid": "http://oscon.com/oscon2013--s2013-07-22-09:00--28877",
    "summary": "Presentation Aikido",
    "description": "Presented by Damian Conway (Thoughtstream). The class explains the seven basic principles of good presentation: from selecting the right format and content, through preparing your dialogue and visual materials, to delivery techniques and how to handle questions (or the lack thereof). It also provides a dozen simple and practical techniques for making your slides not suck.",
    "id": 172,
    "begin": "1 Jul 9:00 am",
    "end": "1 Jul 12:30 pm",
    "dtstart": "20130722T090000",
    "dtend": "20130722T123000"
  },
  {
    "dtstamp": "20130724T061358",
    "location": "E143/144",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28878",
    "uid": "http://oscon.com/oscon2013--s2013-07-22-13:30--28878",
    "summary": "Optimizing Your Perl Development",
    "description": "Presented by Damian Conway (Thoughtstream). This tutorial explores how Dr Damian Conway -- one of the most prolific and successful contributors to the Perl community and to the CPAN -- manages his own development and maintenance processes. It explains and explores some of the many tools he has designed and constructed to make developing in Perl quicker, cleaner, and more enjoyable.",
    "id": 173,
    "begin": "1 Jul 1:30 pm",
    "end": "1 Jul 5:00 pm",
    "dtstart": "20130722T133000",
    "dtend": "20130722T170000"
  },
  {
    "dtstamp": "20130724T052613",
    "location": "E143/144",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29115",
    "uid": "http://oscon.com/oscon2013--s2013-07-23-09:00--29115",
    "summary": "Service Orchestration In The Cloud With Juju",
    "description": "Presented by Jorge Castro (Canonical Ltd. / Ubuntu), Mark Mims (Canonical Ltd / Ubuntu). In this session we'll quickly go over the basic concepts of juju and spend the rest of the time walking through explicit examples of juju in action.  We'll look at stacks of services and the charms behind those services.",
    "id": 174,
    "begin": "2 Jul 9:00 am",
    "end": "2 Jul 12:30 pm",
    "dtstart": "20130723T090000",
    "dtend": "20130723T123000"
  },
  {
    "dtstamp": "20130724T214319",
    "location": "E143/144",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29263",
    "uid": "http://oscon.com/oscon2013--s2013-07-23-13:30--29263",
    "summary": "Introduction to Apache Drill",
    "description": "Presented by Ted Dunning (MapR), Jacques Nadeau (MapR Technologies). We’ll start the session by giving users an overview of the Apache Drill and its key extension APIs.  Afterwards, we’ll describe an example use case where Apache Drill’s native capabilities are lacking.  We’ll then work through design and development using Java and scripting to add extensions to the Apache Drill platform.",
    "id": 175,
    "begin": "2 Jul 1:30 pm",
    "end": "2 Jul 5:00 pm",
    "dtstart": "20130723T133000",
    "dtend": "20130723T170000"
  },
  {
    "dtstamp": "20130716T111747",
    "location": "E143/144",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31517",
    "uid": "http://oscon.com/oscon2013--s2013-07-22-19:00--31517",
    "summary": "Cloud Foundry community",
    "description": "Cloud Foundry is the Open Platform-as-a-Service sponsored by Pivotal, with a growing and rapidly-evolving community and ecosystem. Come along to find out what's new in the Cloud Foundry community, and to network with other users of the platform.",
    "id": 176,
    "begin": "1 Jul 7:00 pm",
    "end": "1 Jul 8:00 pm",
    "dtstart": "20130722T190000",
    "dtend": "20130722T200000"
  },
  {
    "dtstamp": "20130724T184539",
    "location": "E144",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28591",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-10:40--28591",
    "summary": "I Wish I Knew How to Quit You: 10 Secrets to Sustainable Open Source Communities",
    "description": "Presented by Elizabeth Leddy (East of Eaton). Plone is one of the oldest open source Python communities that still releases today. Despite a decade of trials and tribulations, the community is stronger than ever thanks to a unique Python subculture that is passed from \"generation to generation\". This talk will cover 10 lessons over 10 years on nurturing an open source community that builds character in addition to software.",
    "id": 177,
    "begin": "3 Jul 10:40 am",
    "end": "3 Jul 11:20 am",
    "dtstart": "20130724T104000",
    "dtend": "20130724T112000"
  },
  {
    "dtstamp": "20130724T215120",
    "location": "E144",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29327",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-11:30--29327",
    "summary": "Bringing More Women to Free and Open Source Software",
    "description": "Presented by Karen Sandler (GNOME Foundation). Many have speculated about why there are so few women in free and open source software. GNOME, in its Outreach Program for Women, addresses many of these issues with impressive success at attracting and then retaining talented women. 10 other organizations have now joined the OPW. In this talk, Karen will discuss why this Program is necessary and why it has been so successful.",
    "id": 178,
    "begin": "3 Jul 11:30 am",
    "end": "3 Jul 12:10 pm",
    "dtstart": "20130724T113000",
    "dtend": "20130724T121000"
  },
  {
    "dtstamp": "20130724T221354",
    "location": "E144",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29234",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-13:40--29234",
    "summary": "Should Campaign Technology be Open Sourced? OSS During a Presidential Election",
    "description": "Presented by Ryan Resella (Upworthy). During the 2012 presidential election Obama For America created an Open Source Voter Registration application.  The open source application was released by the Democratic National Committee using an open source license.  This was the first time that a national presidential campaign had released technology as an open source license.   There was much debate on the licensing of this application.",
    "id": 179,
    "begin": "3 Jul 1:40 pm",
    "end": "3 Jul 2:20 pm",
    "dtstart": "20130724T134000",
    "dtend": "20130724T142000"
  },
  {
    "dtstamp": "20130724T230553",
    "location": "E144",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29239",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-14:30--29239",
    "summary": "Non-Profits Organizations for FLOSS Projects: There Is No Place Like Home",
    "description": "Presented by Bradley Kuhn (Software Freedom Conservancy), Josh Berkus (PostgreSQL Experts, Inc.), Paula Hunter (Outercurve Foundation), Nóirín Plunkett (Eucalyptus Systems), Ian Skerrett (Eclipse Foundation), Jim Zemlin (The Linux Foundation). Successful Open Source and Free Software projects have an abundance of great contributors.  A common challenge, however, are those tasks outside the expertise or interest of those contributors.  Non-profit organizational homes provide an excellent way to solve that aspect of Open Source and Free Software.  This session introduces many options that projects can choose from for a non-profit home.",
    "id": 180,
    "begin": "3 Jul 2:30 pm",
    "end": "3 Jul 3:10 pm",
    "dtstart": "20130724T143000",
    "dtend": "20130724T151000"
  },
  {
    "dtstamp": "20130725T000253",
    "location": "E144",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29402",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-16:10--29402",
    "summary": "Become a Digital Humanitarian Open Data and Open Source for Good",
    "description": "Presented by Kate Chapman (Humanitarian OpenStreetMap Team), Heather Leson (Ushahidi), Thea Aldrich (SecondMuse ), Pat Tressel (Sahana Software Foundation), Lindsay Oliver (Geeks Without Bounds), Sara Farmer (Change Assembly). Have you been involved in open source for a long time but you’d like it to directly impact peoples’ live? Just beginning and want to help others? Access to free and open software can allow communities to make better decisions in case of disaster, help respond to local crises and use the tools in ways you never dreamed. Learn about some of the projects being used and how you can help.",
    "id": 181,
    "begin": "3 Jul 4:10 pm",
    "end": "3 Jul 4:50 pm",
    "dtstart": "20130724T161000",
    "dtend": "20130724T165000"
  },
  {
    "dtstamp": "20130725T000823",
    "location": "E144",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29494",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-17:00--29494",
    "summary": "An Overview of Open Source in East Asia (China, Korea, Japan)",
    "description": "Presented by Minwoo Park (Inmobi), Sung-ju Jin (KT). Do you know any open source project from Korea? or China / Japan? Language barriers and cultural differences makes open-source in East Asia very unique and different from what you may be used to. Join us to learn more what’s happening in open-source outside of the western world!",
    "id": 182,
    "begin": "3 Jul 5:00 pm",
    "end": "3 Jul 5:40 pm",
    "dtstart": "20130724T170000",
    "dtend": "20130724T174000"
  },
  {
    "dtstamp": "20130401T233342",
    "location": "E144",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29370",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-10:40--29370",
    "summary": "Quantitative community management",
    "description": "Presented by Asheesh Laroia (OpenHatch). In recent years, communities as wide-ranging as Wikihow to Thunderbird have been surveying participants and using this information to improve the experiences of participants. Learn how open source projects are tracking contributors to identify where people fall away, and to nudge them forward, with an eye toward actionable data and addressing possible sources of bias.",
    "id": 183,
    "begin": "4 Jul 10:40 am",
    "end": "4 Jul 11:20 am",
    "dtstart": "20130725T104000",
    "dtend": "20130725T112000"
  },
  {
    "dtstamp": "20130325T173640",
    "location": "E144",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29315",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-11:30--29315",
    "summary": "Minimum Viable Bureaucracy",
    "description": "Presented by Laura Thomson (Mozilla Corporation). As your team grows and your projects become more complex, you're going to need a certain amount of process. In this talk I'll explain how to add enough engineering management to be effective without driving engineers crazy.",
    "id": 184,
    "begin": "4 Jul 11:30 am",
    "end": "4 Jul 12:10 pm",
    "dtstart": "20130725T113000",
    "dtend": "20130725T121000"
  },
  {
    "dtstamp": "20130722T221913",
    "location": "E144",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29000",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-13:40--29000",
    "summary": "Rebooting the Team:  Lessons Learned in an Introspective Year",
    "description": "Presented by Fran Fabrizio (Minnesota Population Center, U of Minnesota), Peter Clark (Minnesota Population Center, U of Mn). When our dev team hit a rut recently, we spent a year examining ourselves - our motivations and values, our processes and tools, our relationships to each other and our customers, even our physical space.  We put what we learned to good use and reenergized the team.  In this talk we'll share how we did it, some surprises along the way, and techniques that you can use to help reboot your own team.",
    "id": 185,
    "begin": "4 Jul 1:40 pm",
    "end": "4 Jul 2:20 pm",
    "dtstart": "20130725T134000",
    "dtend": "20130725T142000"
  },
  {
    "dtstamp": "20130325T174728",
    "location": "E144",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29032",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-14:30--29032",
    "summary": "Creating a User Journey for Your Open Source Community",
    "description": "Presented by Francesca Krihely (10gen). In this session, we will go through how to design a community path to increase user involvement over time. Much of this will go through how to initiate early user engagement through a value proposition and build on that momentum over time. By creating a strong value proposition, in turn you create opportunity and access for your users and build a stronger, more vibrant community.",
    "id": 186,
    "begin": "4 Jul 2:30 pm",
    "end": "4 Jul 3:10 pm",
    "dtstart": "20130725T143000",
    "dtend": "20130725T151000"
  },
  {
    "dtstamp": "20130328T130556",
    "location": "E144",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28809",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-16:10--28809",
    "summary": "How We Built Our Community in GitHub",
    "description": "Presented by Uri Cohen (GigaSpaces Technologies). GitHub isn’t just for Git anymore.  With new projects, as well as open source and SaaS tools you can get back to basics and build websites the old school way.  By foregoing the common CMS platform, you can increase agility and transparency, and put the control of your site back in your hands.",
    "id": 187,
    "begin": "4 Jul 4:10 pm",
    "end": "4 Jul 4:50 pm",
    "dtstart": "20130725T161000",
    "dtend": "20130725T165000"
  },
  {
    "dtstamp": "20130329T154953",
    "location": "E144",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29099",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-17:00--29099",
    "summary": "WebPlatform.org: A Case Study in Open Technical Documentation",
    "description": "Presented by Doug Schepers (W3C), Janet Swisher (Mozilla), Eliot Graff (Microsoft). WebPlatform.org is a community-based documentation site for web developers and designers, based on open principles, process, and software, convened by W3C with stewardship by web industry leaders. This session will explore the pragmatic decisions and challenges faced by creating an open documentation project around technology and standards.",
    "id": 188,
    "begin": "4 Jul 5:00 pm",
    "end": "4 Jul 5:40 pm",
    "dtstart": "20130725T170000",
    "dtend": "20130725T174000"
  },
  {
    "dtstamp": "20130325T172333",
    "location": "E144",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29059",
    "uid": "http://oscon.com/oscon2013--s2013-07-26-10:00--29059",
    "summary": "Case Study: What to do when your project outgrows your company",
    "description": "Presented by Lars Kurth (Citrix Systems Ltd). To succeed in a world of increased competition, open source projects need to deploy many tools including community management, marketing, governance and tooling. We will show, using Xen as a case study, what happens when a project fails to do this well, and demonstrate how a it can recover from past mistakes through good change management.",
    "id": 189,
    "begin": "5 Jul 10:00 am",
    "end": "5 Jul 10:40 am",
    "dtstart": "20130726T100000",
    "dtend": "20130726T104000"
  },
  {
    "dtstamp": "20130326T222834",
    "location": "E144",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29344",
    "uid": "http://oscon.com/oscon2013--s2013-07-26-11:00--29344",
    "summary": "Engage! Open Source Social Coding for Good, for Personal Growth, and for Sustainable Impact",
    "description": "Presented by Gerardo Capiel (Benetech), Edward Cable (The Community for Open Source Microfinance), Deanna McCusker (VMware). Contributing to Humanitarian FOSS (HFOSS) projects can provide tangible product benefit to organizations building technology for good, and tremendous impact to their beneficiaries. But it can also offer intangible, and often unexpected, benefit to volunteer contributors, helping them expand beyond their core competencies in ways they may never have imagined.",
    "id": 190,
    "begin": "5 Jul 11:00 am",
    "end": "5 Jul 11:40 am",
    "dtstart": "20130726T110000",
    "dtend": "20130726T114000"
  },
  {
    "dtstamp": "20130507T141106",
    "location": "E144",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29138",
    "uid": "http://oscon.com/oscon2013--s2013-07-26-11:50--29138",
    "summary": "Ease User Engagement With Cloud Based Trials",
    "description": "Presented by Ross Gardler (Microsoft Open Technologies, Inc.). Techniques for community development using pre-built cloud based virtual machines that demonstrate your projects strengths and community engagement.",
    "id": 191,
    "begin": "5 Jul 11:50 am",
    "end": "5 Jul 12:30 pm",
    "dtstart": "20130726T115000",
    "dtend": "20130726T123000"
  },
  {
    "dtstamp": "20130709T012127",
    "location": "E144",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31468",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-19:00--31468",
    "summary": "Intelligent Computing BOF",
    "description": "A meetup for people interested in talking about Intelligent Computing including NuPIC and other proposed models influenced by the biological model of the human brain.  This BoF is intended to bring together OSCON attendees and interested locals not otherwise attending OSCON for a spirited conversation about the potential embodied in Deep Learning, Machine Learning and Intelligent Computing.",
    "id": 192,
    "begin": "3 Jul 7:00 pm",
    "end": "3 Jul 8:00 pm",
    "dtstart": "20130724T190000",
    "dtend": "20130724T200000"
  },
  {
    "dtstamp": "20130716T191117",
    "location": "E144",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31532",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-19:00--31532",
    "summary": "What WebRTC means for The Web",
    "description": "Not even a year ago, the first WebRTC browser implementation landed. Now just halfway through 2013, there are a BILLION connected endpoints, easily becoming the hottest HTML5 technology today. So what is the big deal? What does this peer to peer real time technology enable? How does it work and how can you put it to use in your future products?  This is the next frontier of the web.",
    "id": 193,
    "begin": "4 Jul 7:00 pm",
    "end": "4 Jul 8:00 pm",
    "dtstart": "20130725T190000",
    "dtend": "20130725T200000"
  },
  {
    "dtstamp": "20130724T210302",
    "location": "E145/146",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28521",
    "uid": "http://oscon.com/oscon2013--s2013-07-22-09:00--28521",
    "summary": "Introduction to Scala",
    "description": "Presented by Dianne Marsh (Netflix), Bruce Eckel (Mindview, LLC). Scala is an amazing and elegant language. It's also powerful, and overwhelming if you try to absorb it all at once. Our goal, based on our book Atomic Scala, is to present the language in small bites you can quickly grasp, to give you a foundation on which to build more knowledge. You’ll finish this half-day tutorial feeling strong and ready to learn more about Scala.",
    "id": 194,
    "begin": "1 Jul 9:00 am",
    "end": "1 Jul 12:30 pm",
    "dtstart": "20130722T090000",
    "dtend": "20130722T123000"
  },
  {
    "dtstamp": "20130724T230442",
    "location": "E145/146",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28974",
    "uid": "http://oscon.com/oscon2013--s2013-07-22-13:30--28974",
    "summary": "Beginner's Guide To Computer Vision",
    "description": "Presented by Jayneil Dalal (INTEL), Sohil Patel ( Azoi Mobile Technology Pvt Ltd). Ever wanted to do some cool \"Minority Report\"-like project to detect hand gestures, face detection etc and that too using open source software? In this hands-on tutorial we will teach the basics of the world's most popular open source computer vision libraries, OpenCV and OpenNI library for 2D/3D image processing. We will also show some cool demos on the same using Pandaboard, Kinect etc.",
    "id": 195,
    "begin": "1 Jul 1:30 pm",
    "end": "1 Jul 5:00 pm",
    "dtstart": "20130722T133000",
    "dtend": "20130722T170000"
  },
  {
    "dtstamp": "20130724T224142",
    "location": "E145/146",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29622",
    "uid": "http://oscon.com/oscon2013--s2013-07-23-09:00--29622",
    "summary": "Building A Distributed Sensor Network",
    "description": "Presented by Alasdair Allan (Babilim Light Industries), Kipp Bradford (Kippworks). This hands-on workshop will walk you through building a simple distributed sensor network. Using an Arduino board, off-the-shelf sensors, and XBee radios, we'll show you how to put together an individual sensor platform (commonly known as a \"mote\") and how to network more than one of these platforms together to build a small scale distributed network.",
    "id": 196,
    "begin": "2 Jul 9:00 am",
    "end": "2 Jul 12:30 pm",
    "dtstart": "20130723T090000",
    "dtend": "20130723T123000"
  },
  {
    "dtstamp": "20130724T232215",
    "location": "E145/146",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29157",
    "uid": "http://oscon.com/oscon2013--s2013-07-23-13:30--29157",
    "summary": "Get Started with the Arduino - A Hands-On Introductory Workshop",
    "description": "Presented by Philip Lindsay (rancidbacon.com). Have you always wanted to create hardware devices to interact with the real world? When you attend this workshop you will: set up an Arduino board and software; learn how the Arduino fits into the field of physical computing; and make your Arduino respond to button presses and blink lights. Hardware is fun! Note: Cost of the kit (USD $57) is included in the registration price for this tutorial.",
    "id": 197,
    "begin": "2 Jul 1:30 pm",
    "end": "2 Jul 5:00 pm",
    "dtstart": "20130723T133000",
    "dtend": "20130723T170000"
  },
  {
    "dtstamp": "20130724T225618",
    "location": "E145",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28858",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-10:40--28858",
    "summary": "GitHub Power Tools",
    "description": "Presented by Tim Berglund (GitHub, Inc.). GitHub has a number of important collaborative features beyond here Git hosting. Come to this talk for a whilrwind tour of forks, pull requests, project sites, and more!",
    "id": 198,
    "begin": "3 Jul 10:40 am",
    "end": "3 Jul 11:20 am",
    "dtstart": "20130724T104000",
    "dtend": "20130724T112000"
  },
  {
    "dtstamp": "20130725T002917",
    "location": "E145",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29302",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-11:30--29302",
    "summary": "Practicing Deployment",
    "description": "Presented by Laura Thomson (Mozilla Corporation). Deployment can be a real bugbear for many web developers. From building something easy to deploy and manage; to coming up with a repeatable, consistent process; to continuous deployment…deployment can keep you up at night for months on end.  In this talk I'll go through how to get better at deployment, best practices, and lessons learned.",
    "id": 199,
    "begin": "3 Jul 11:30 am",
    "end": "3 Jul 12:10 pm",
    "dtstart": "20130724T113000",
    "dtend": "20130724T121000"
  },
  {
    "dtstamp": "20130724T215330",
    "location": "E145",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29049",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-13:40--29049",
    "summary": "Half my life with Perl",
    "description": "Presented by Randal L. Schwartz (Stonehenge Consulting Services, Inc.). Randal Schwartz recounts how he has spent half his life with Perl.",
    "id": 200,
    "begin": "3 Jul 1:40 pm",
    "end": "3 Jul 2:20 pm",
    "dtstart": "20130724T134000",
    "dtend": "20130724T142000"
  },
  {
    "dtstamp": "20130724T230837",
    "location": "E145",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28535",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-14:30--28535",
    "summary": "Start Contributing to Perl, It's Easy!",
    "description": "Presented by Augustina Ragwitz (Mediamath). The Perl community wants YOU to contribute! Whether you can barely write a line of code or have been hacking for years, you can make meaningful contributions!",
    "id": 201,
    "begin": "3 Jul 2:30 pm",
    "end": "3 Jul 3:10 pm",
    "dtstart": "20130724T143000",
    "dtend": "20130724T151000"
  },
  {
    "dtstamp": "20130724T234210",
    "location": "E145",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29197",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-16:10--29197",
    "summary": "Carton: Manage CPAN dependencies without the mess",
    "description": "Presented by Tatsuhiko Miyagawa (COOKPAD). You have hundreds of CPAN module dependencies in your Perl application code, and want to always run it with the exact same version on your development, testing and production environments. Carton, with the power of cpanminus 1.6, lets you exactly do that.",
    "id": 202,
    "begin": "3 Jul 4:10 pm",
    "end": "3 Jul 4:50 pm",
    "dtstart": "20130724T161000",
    "dtend": "20130724T165000"
  },
  {
    "dtstamp": "20130725T003821",
    "location": "E145",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28100",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-17:00--28100",
    "summary": "Giving LWP::UserAgent Its Well Deserved Golden Watch",
    "description": "Presented by Mark Allen (Mark Allen). The UserAgent module in the perl web library is tried and true, battle tested (and battle scarred), but sometimes you just want more from your web library - more speed, more features. And sometimes you want less - less typing, less boilerplate.  This talk examines four excellent alternatives to LWP::UserAgent: HTTP::Tiny, Mojo::UserAgent, LWP::Curl and Furl.",
    "id": 203,
    "begin": "3 Jul 5:00 pm",
    "end": "3 Jul 5:40 pm",
    "dtstart": "20130724T170000",
    "dtend": "20130724T174000"
  },
  {
    "dtstamp": "20130708T205457",
    "location": "E145",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29018",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-10:40--29018",
    "summary": "To Infinity and Beyond - Storing your Moose herd in Elasticsearch",
    "description": "Presented by Clinton Gormley (Elasticsearch BV). Elastic::Model is a new framework to store your Moose objects, which uses ElasticSearch as a NoSQL document store and flexible search engine. It is designed to make small beginnings simple, but to scale easily to Big Data requirements without needing to rearchitect your application. No job too big or small!",
    "id": 204,
    "begin": "4 Jul 10:40 am",
    "end": "4 Jul 11:20 am",
    "dtstart": "20130725T104000",
    "dtend": "20130725T112000"
  },
  {
    "dtstamp": "20130329T171334",
    "location": "E145",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28062",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-11:30--28062",
    "summary": "Implementing Trampoline Objects in Perl",
    "description": "Presented by Steven Lembark (Workhorse Computing). Object Trampolines are a flyweight pattern: the object is inexpensive to construct and transforms itself on demand. Perl's OO structure makes these relatively easy to implement and use.  This talk describes the Object::Trampoline module with applications using DBI and data objects.",
    "id": 205,
    "begin": "4 Jul 11:30 am",
    "end": "4 Jul 12:10 pm",
    "dtstart": "20130725T113000",
    "dtend": "20130725T121000"
  },
  {
    "dtstamp": "20130331T002404",
    "location": "E145",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29443",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-13:40--29443",
    "summary": "The Perl Renaissance",
    "description": "Presented by Paul Fenwick (Perl Training Australia). The Perl Renaissance is in full swing. Object frameworks and syntax have been undated, web frameworks are easy and powerful, and modules are easy to manage and install. White Camel Award winner Paul Fenwick will be covering the best technologies of the recent age. No prior Perl experience required!",
    "id": 206,
    "begin": "4 Jul 1:40 pm",
    "end": "4 Jul 2:20 pm",
    "dtstart": "20130725T134000",
    "dtend": "20130725T142000"
  },
  {
    "dtstamp": "20130325T172033",
    "location": "E145",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28494",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-14:30--28494",
    "summary": "Perl 5: Postcards from the Edge",
    "description": "Presented by Ricardo Signes (Pobox.com). What's new in Perl 5?  This talk, given by the Perl 5 project manager (aka, \"the pumpking\") summarizes developments in the latest stable release of Perl 5, changes being worked on for next year, and an overview of life amidst the members of the perl5 development community.",
    "id": 207,
    "begin": "4 Jul 2:30 pm",
    "end": "4 Jul 3:10 pm",
    "dtstart": "20130725T143000",
    "dtend": "20130725T151000"
  },
  {
    "dtstamp": "20130723T181948",
    "location": "E145",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28902",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-16:10--28902",
    "summary": "Situation Normal Everything Must Change",
    "description": "Presented by Simon Wardley (Leading Edge Forum (CSC)). .",
    "id": 208,
    "begin": "4 Jul 4:10 pm",
    "end": "4 Jul 4:50 pm",
    "dtstart": "20130725T161000",
    "dtend": "20130725T165000"
  },
  {
    "dtstamp": "20130325T172018",
    "location": "E145",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28684",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-17:00--28684",
    "summary": "Mobilize Your MongoDB! Developing full stack Javascript applications.",
    "description": "Presented by Grant Shipley (Red Hat). Grant Shipley, lead Evangelist for OpenShift, will demonstrate how to develop iPhone and Android apps with MongoDB and Node.js backends for the cloud. Let's skip having to learn three different languages and jumpstart the development process using what you already know. Nothing complicated, nothing convoluted. Just straight ahead mobile development goodness with MongoDB, Node.js, and javascript.",
    "id": 209,
    "begin": "4 Jul 5:00 pm",
    "end": "4 Jul 5:40 pm",
    "dtstart": "20130725T170000",
    "dtend": "20130725T174000"
  },
  {
    "dtstamp": "20130703T162743",
    "location": "E145",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28970",
    "uid": "http://oscon.com/oscon2013--s2013-07-26-10:00--28970",
    "summary": "MongoDB on Amazon Web Services: Operational Best Practices",
    "description": "Presented by Charity Majors (Parse). MongoDB on AWS is a very popular, flexible backend option for application storage, however best practices in the industry are still young.  We will talk about how to run on AWS efficiently and cost-effectively with minimal manual intervention.  We will also talk about how to tune your cluster for optimal performance on EC2 and how to recover quickly from any downtime.",
    "id": 210,
    "begin": "5 Jul 10:00 am",
    "end": "5 Jul 10:40 am",
    "dtstart": "20130726T100000",
    "dtend": "20130726T104000"
  },
  {
    "dtstamp": "20130703T162755",
    "location": "E145",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28956",
    "uid": "http://oscon.com/oscon2013--s2013-07-26-11:00--28956",
    "summary": "Mirage: Extreme Specialization Of Cloud Appliances",
    "description": "Presented by Anil Madhavapeddy (University of Cambridge), Richard Mortier (University of Nottingham). Mirage is a new operating system for the cloud which compiles source code in a functional language (OCaml) into type-safe microkernels that run directly on the public cloud.  The compiler specialises appliances such as a web server or database into hundreds of kilobytes, marking a radical shift in how we can manage online services that are always struggling with security isusues.",
    "id": 211,
    "begin": "5 Jul 11:00 am",
    "end": "5 Jul 11:40 am",
    "dtstart": "20130726T110000",
    "dtend": "20130726T114000"
  },
  {
    "dtstamp": "20130703T162759",
    "location": "E145",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29398",
    "uid": "http://oscon.com/oscon2013--s2013-07-26-11:50--29398",
    "summary": "Open Source Systems Performance",
    "description": "Presented by Brendan Gregg (Joyent). This talk is about systems performance for enterprise and cloud computing environments. This covers the performance of operating systems themselves, and the performance of applications from operating system context. This talk is intended for any open source operating system, especially the illumos and Linux kernels.",
    "id": 212,
    "begin": "5 Jul 11:50 am",
    "end": "5 Jul 12:30 pm",
    "dtstart": "20130726T115000",
    "dtend": "20130726T123000"
  },
  {
    "dtstamp": "20130709T014535",
    "location": "E145",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31472",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-19:00--31472",
    "summary": "Roleplaying Games",
    "description": "It's not technical, but it's fun! Come meet other OSCON attendees interested in playing RPGs and play a game. No experience needed. I'll bring a favorite fantasy RPG; bring your own games, too. We can discuss the open source/open publishing movement in RPGs to be relevant.",
    "id": 213,
    "begin": "3 Jul 7:00 pm",
    "end": "3 Jul 8:00 pm",
    "dtstart": "20130724T190000",
    "dtend": "20130724T200000"
  },
  {
    "dtstamp": "20130718T182050",
    "location": "E145",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31537",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-19:00--31537",
    "summary": "Choosing a Search Engine - Best Practices/War Stories",
    "description": "A community or like-minded discussion via examples/user-stories & best-practices relating to how organizations and users alike choose a search engine that 'scales' with their needs.",
    "id": 214,
    "begin": "4 Jul 7:00 pm",
    "end": "4 Jul 8:00 pm",
    "dtstart": "20130725T190000",
    "dtend": "20130725T200000"
  },
  {
    "dtstamp": "20130724T211827",
    "location": "E146",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29196",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-10:40--29196",
    "summary": "Monitoring with Ganglia",
    "description": "Presented by Vladimir Vuksan (Fastly). Talk will focus on some of the challenges of monitoring a CDN infrastructure and approaches everyone can use to get better at monitoring their own infrastructure using Ganglia including identifying metrics to track, using monitoring for enhanced communication inside the company and better understanding of ones own infrastructure.",
    "id": 215,
    "begin": "3 Jul 10:40 am",
    "end": "3 Jul 11:20 am",
    "dtstart": "20130724T104000",
    "dtend": "20130724T112000"
  },
  {
    "dtstamp": "20130724T221211",
    "location": "E146",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28726",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-11:30--28726",
    "summary": "Orchestration and Configuration Management with Ansible",
    "description": "Presented by Michael DeHaan (AnsibleWorks). Ansible is a radically simple data-driven configuration management, orchestration, and task management framework.  It requires no agents on your remote machines, requires no bootstrapping, and works over SSH.",
    "id": 216,
    "begin": "3 Jul 11:30 am",
    "end": "3 Jul 12:10 pm",
    "dtstart": "20130724T113000",
    "dtend": "20130724T121000"
  },
  {
    "dtstamp": "20130724T223541",
    "location": "E146",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28110",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-13:40--28110",
    "summary": "Agile and IT Operations: How to Coexist and Not Get Lost",
    "description": "Presented by Marcin Mazurek (Allegro Group). The presentation will summarise the experiences of introducing Agile methodologies (Scrum, Kanban) in e-commerce organisation (+1000 employees) that had a strong basis in waterfall project management and ITIL based operations. I would like to show what difficulties we have faced and how we are trying to overcome them.",
    "id": 217,
    "begin": "3 Jul 1:40 pm",
    "end": "3 Jul 2:20 pm",
    "dtstart": "20130724T134000",
    "dtend": "20130724T142000"
  },
  {
    "dtstamp": "20130725T003358",
    "location": "E146",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28481",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-14:30--28481",
    "summary": "Unsung Tools of DevOps",
    "description": "Presented by Jonathan Thurman (New Relic). Puppet and Chef have grown to have their own conferences, but what about the other tools you use?  Lets talk about some unsung tools of DevOps that you should be using to augment your existing toolset.",
    "id": 218,
    "begin": "3 Jul 2:30 pm",
    "end": "3 Jul 3:10 pm",
    "dtstart": "20130724T143000",
    "dtend": "20130724T151000"
  },
  {
    "dtstamp": "20130725T002832",
    "location": "E146",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28934",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-16:10--28934",
    "summary": "while (true) do;  how hard can it be to keep running?",
    "description": "Presented by Caskey Dickson (GOOGLE). One of the simplest seeming problems is just keeping a daemon running.  However, it turns out that keeping a long-lived service simply online can take more than you expect. There are a plethora of different tools for doing this, and each has their own unique failure modes and requirements.  Come explore the pitfalls we've encountered and workarounds we use to keep a daemon running at all times.",
    "id": 219,
    "begin": "3 Jul 4:10 pm",
    "end": "3 Jul 4:50 pm",
    "dtstart": "20130724T161000",
    "dtend": "20130724T165000"
  },
  {
    "dtstamp": "20130325T174310",
    "location": "E146",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29473",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-17:00--29473",
    "summary": "Demystifying SELinux: WTF is it saying?",
    "description": "Presented by Dave Quigley (KEYW Corporation). SELinux is a mandatory access control mechanism for Linux systems found in several main stream distributions. All those fancy security terms may be scary but in truth with a little bit of knowledge its possible to find out WTF SELinux is saying to you. I'll provide an introduction to SELinux to help ordinary people understand basic SELinux concepts and deal with basic SELinux issues.",
    "id": 220,
    "begin": "3 Jul 5:00 pm",
    "end": "3 Jul 5:40 pm",
    "dtstart": "20130724T170000",
    "dtend": "20130724T174000"
  },
  {
    "dtstamp": "20130403T075825",
    "location": "E146",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29240",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-10:40--29240",
    "summary": "PUP201: How to use Puppet like an adult",
    "description": "Presented by Benjamin Kero (Mozilla Corporation), Daniel Maher (Mozilla). Puppet is an immensely powerful tool, but it's not always obvious how to use Puppet correctly. I will explain guiding principles  of responsible Puppet design and architecture, walk through real-life examples to illustrate solid approaches, and illuminate Puppeteers of all skill levels. As a bonus, I will demonstrate ho w to integrate into continuous integration platforms!",
    "id": 221,
    "begin": "4 Jul 10:40 am",
    "end": "4 Jul 11:20 am",
    "dtstart": "20130725T104000",
    "dtend": "20130725T112000"
  },
  {
    "dtstamp": "20130325T183722",
    "location": "E146",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28151",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-11:30--28151",
    "summary": "LogStash: Yes, Logging Can Be Awesome",
    "description": "Presented by James Turnbull (Puppet Labs). Logging. Everyone does it. Many don't know why they do it. It is often considered a boring chore. A chore that is done by habit rather than for a purpose. But it doesn't have to be! Learn how to build a powerful, scalable open source logging environment with LogStash.",
    "id": 222,
    "begin": "4 Jul 11:30 am",
    "end": "4 Jul 12:10 pm",
    "dtstart": "20130725T113000",
    "dtend": "20130725T121000"
  },
  {
    "dtstamp": "20130403T215452",
    "location": "E146",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28098",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-13:40--28098",
    "summary": "Go Language for Ops and Site Reliability Engineering",
    "description": "Presented by Gustavo Franco (Google). How the Go programming language can help you to build reliable, scalable and easier to maintain systems.",
    "id": 223,
    "begin": "4 Jul 1:40 pm",
    "end": "4 Jul 2:20 pm",
    "dtstart": "20130725T134000",
    "dtend": "20130725T142000"
  },
  {
    "dtstamp": "20130325T181401",
    "location": "E146",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28099",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-14:30--28099",
    "summary": "DTrace Your Application (Not Your Operating System)",
    "description": "Presented by Mark Allen (Mark Allen). DTrace is a facility for dynamically tracing operating system level code paths in real time in production (if you so desire.) But what you may not know is that many programming languages support DTrace as well, including Perl, Python and Erlang.  This talk will show you how DTrace helps you find and solve tricky application problems quickly and safely even in production environments.",
    "id": 224,
    "begin": "4 Jul 2:30 pm",
    "end": "4 Jul 3:10 pm",
    "dtstart": "20130725T143000",
    "dtend": "20130725T151000"
  },
  {
    "dtstamp": "20130329T052006",
    "location": "E146",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29349",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-16:10--29349",
    "summary": "Tuning TCP for the Web",
    "description": "Presented by Jason Cook (Fastly). The performance of the network underlying our applications can have a dramatic effect on the experience of our users. This session will cover how to tune some of the interactions between TCP and your application to deliver solid performance over the public internet.",
    "id": 225,
    "begin": "4 Jul 4:10 pm",
    "end": "4 Jul 4:50 pm",
    "dtstart": "20130725T161000",
    "dtend": "20130725T165000"
  },
  {
    "dtstamp": "20130326T190048",
    "location": "E146",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29100",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-17:00--29100",
    "summary": "Introducing Locksmith - an open source tool for detecting potential deadlocks in C and C++",
    "description": "Presented by Colin McCabe (Cloudera). Debugging concurrency errors can be difficult.  Fortunately, Locksmith can help.  Locksmith is an open source tool for detecting potential deadlocks in C, C++, and Objective C programs.  It can detect common concurrency mistakes.",
    "id": 226,
    "begin": "4 Jul 5:00 pm",
    "end": "4 Jul 5:40 pm",
    "dtstart": "20130725T170000",
    "dtend": "20130725T174000"
  },
  {
    "dtstamp": "20130703T162809",
    "location": "E146",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29297",
    "uid": "http://oscon.com/oscon2013--s2013-07-26-10:00--29297",
    "summary": "Coulda Been a Contributor: Making a difference through open source software",
    "description": "Presented by Vanessa Hurst (CodeMontage). Last year in CNNMoney’s Best Jobs for Fast Growth, software jobs were 7 of the top 20, but averaged a “C” for benefit to society. We’re calling BS.",
    "id": 227,
    "begin": "5 Jul 10:00 am",
    "end": "5 Jul 10:40 am",
    "dtstart": "20130726T100000",
    "dtend": "20130726T104000"
  },
  {
    "dtstamp": "20130718T182851",
    "location": "E146",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28861",
    "uid": "http://oscon.com/oscon2013--s2013-07-26-11:00--28861",
    "summary": "WordPress.com and the Future of Work",
    "description": "Presented by Scott Berkun (Berkun Media, Inc.). Imagine a workplace with no email, where everyone works from home, and new software is released dozens of times a day. This is life at WordPress.com, the 15th most popular website on the planet, where Berkun managed a team of programmers from 2010 to 2012. He'll share insights into creativity, management and applying open source ideals to the world (the subject of his forthcoming book.)",
    "id": 228,
    "begin": "5 Jul 11:00 am",
    "end": "5 Jul 11:40 am",
    "dtstart": "20130726T110000",
    "dtend": "20130726T114000"
  },
  {
    "dtstamp": "20130703T162805",
    "location": "E146",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29097",
    "uid": "http://oscon.com/oscon2013--s2013-07-26-11:50--29097",
    "summary": "Open Sourcing Depression",
    "description": "Presented by Edward Finkler (FictiveKin). In the spirit of open source, I'd like to shine a spotlight on depression. Not because it's easy, but because it's important. Mental illness affects many of us, but the stigma attached to it dissuades most people from talking about it openly. That's not how we make progress. With this talk, I want to do my part.",
    "id": 229,
    "begin": "5 Jul 11:50 am",
    "end": "5 Jul 12:30 pm",
    "dtstart": "20130726T115000",
    "dtend": "20130726T123000"
  },
  {
    "dtstamp": "20130716T111755",
    "location": "E146",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31516",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-19:00--31516",
    "summary": "Eclipse Internet of Things / Machine-to-Machine",
    "description": "The Eclipse Foundation has a growing number of projects which aim at the M2M/IoT space, and an Industry Working Group dedicated to this area. Come and learn more at this BoF and find out how Open Source code from Eclipse can help your Internet of Things project.",
    "id": 230,
    "begin": "3 Jul 7:00 pm",
    "end": "3 Jul 8:00 pm",
    "dtstart": "20130724T190000",
    "dtend": "20130724T200000"
  },
  {
    "dtstamp": "20130719T140942",
    "location": "E146",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31538",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-19:00--31538",
    "summary": "AppScale: Flexible, Scalable, and Portable Deployment of Web Apps, Services, and Mobile App Endpoints",
    "description": "At this BOF, we present and discuss AppScale, an open source implementation of Google App Engine -- think Google's cloud platform under your control.  AppScale executes App Engine apps without modification, automatically manages and scales apps and their service ecosystems, and enables developers to plug in alternative services (e.g. NoSQL, SQL, analytics, search,..) without rewriting the code.",
    "id": 231,
    "begin": "4 Jul 7:00 pm",
    "end": "4 Jul 8:00 pm",
    "dtstart": "20130725T190000",
    "dtend": "20130725T200000"
  },
  {
    "dtstamp": "20130724T171001",
    "location": "E147",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28506",
    "uid": "http://oscon.com/oscon2013--s2013-07-22-09:00--28506",
    "summary": "Coreboot Tutorial",
    "description": "Presented by Bill Richardson (Google, Inc), Stefan Reinauer (Google). Coreboot is a GPL'ed BIOS that is now available in Chromebooks. In this tutorial, we'll teach you how to tear into a chromebook and rebuild it from the firmware up to a login prompt. Not for the faint-hearted but you *will* learn a lot!",
    "id": 232,
    "begin": "1 Jul 9:00 am",
    "end": "1 Jul 12:30 pm",
    "dtstart": "20130722T090000",
    "dtend": "20130722T123000"
  },
  {
    "dtstamp": "20130724T231119",
    "location": "E147",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29004",
    "uid": "http://oscon.com/oscon2013--s2013-07-22-13:30--29004",
    "summary": "How Do I Game Design?",
    "description": "Presented by Paris Buttfield-Addison (Secret Lab Pty. Ltd.), Jonathon Manning (Secret Lab Pty. Ltd.). In this workshop, you'll learn how to apply the art and science of constructing enjoyable, engaging games. This is entirely non-electronic; we're not talking about programming, game engine development, or how to approach a publisher with your totally rad idea about how you can have, like Mario only there's explosions. Everything you'll work on will be done with pens, paper, and human brain-meat.",
    "id": 233,
    "begin": "1 Jul 1:30 pm",
    "end": "1 Jul 5:00 pm",
    "dtstart": "20130722T133000",
    "dtend": "20130722T170000"
  },
  {
    "dtstamp": "20130724T182708",
    "location": "E147",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29249",
    "uid": "http://oscon.com/oscon2013--s2013-07-23-09:00--29249",
    "summary": "Community Foundations 101",
    "description": "Presented by Simon  Phipps (Open Source Initiative), Josh Berkus (PostgreSQL Experts, Inc.), Deborah Bryant (Bryant Group), Steve Holden (Holden Web LLC), Paula Hunter (Outercurve Foundation), Bradley Kuhn (Software Freedom Conservancy), Dave Neary (Red Hat), Deb Nicholson (Open Invention Network), Cédric  Thomas (OW2), Ian Skerrett (Eclipse Foundation). Presented by leaders of multiple open source non-profit foundations, this session introduces choices of governance and organisation for those considering anchoring their community with a non-profit organisation.",
    "id": 234,
    "begin": "2 Jul 9:00 am",
    "end": "2 Jul 12:30 pm",
    "dtstart": "20130723T090000",
    "dtend": "20130723T123000"
  },
  {
    "dtstamp": "20130724T212807",
    "location": "E147",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28923",
    "uid": "http://oscon.com/oscon2013--s2013-07-23-13:30--28923",
    "summary": "Perl: The First Three Days",
    "description": "Presented by Peter Scott (Pacific Systems Design Technologies). Normally it takes three days of classes for a beginner to get familiar with Perl.  We don't have three days, so we're going to speed things up... just a bit.  This tutorial will cover the basics and enough of the more advanced features to bootstrap the learning process for Perl novices.",
    "id": 235,
    "begin": "2 Jul 1:30 pm",
    "end": "2 Jul 5:00 pm",
    "dtstart": "20130723T133000",
    "dtend": "20130723T170000"
  },
  {
    "dtstamp": "20130724T210020",
    "location": "E147",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28491",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-10:40--28491",
    "summary": "The Spring Update: Looking at Spring 3.1, 3.2 and Spring.next",
    "description": "Presented by Josh Long (Pivotal). The Spring framework, the most widely used enterprise Java technology, has just been updated to 3.2, and work is already underway towards the next generation of Spring.  Join Josh Long for a look at the amazing new features in Sprint 3.1 and 3.2, as well as a look at what's in the works.",
    "id": 236,
    "begin": "3 Jul 10:40 am",
    "end": "3 Jul 11:20 am",
    "dtstart": "20130724T104000",
    "dtend": "20130724T112000"
  },
  {
    "dtstamp": "20130724T223834",
    "location": "E147",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29496",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-11:30--29496",
    "summary": "An Introduction to the Vert.x Framework",
    "description": "Presented by Nate McCall (Apigee). With a simple concurrency model, polyglot execution environment and powerful message passing framework, Vert.x is one of those projects that will make you go in search of a problem to solve just to learn more about it. This talk will walk through these features, introducing attendees to a powerful new way of writing applications.",
    "id": 237,
    "begin": "3 Jul 11:30 am",
    "end": "3 Jul 12:10 pm",
    "dtstart": "20130724T113000",
    "dtend": "20130724T121000"
  },
  {
    "dtstamp": "20130724T234348",
    "location": "E147",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28523",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-13:40--28523",
    "summary": "Sneaking Scala Through the Back Door",
    "description": "Presented by Dianne Marsh (Netflix). Is your organization committed to the power of the Java platform but stuck on the Java language? Do you spend your time wishing you could use Scala at work? You’ll learn strategies ranging from using Scala for non-production code to easing your fellow programmers into functional programming. You will hear stories of how other organizations have done this and succeeded.",
    "id": 238,
    "begin": "3 Jul 1:40 pm",
    "end": "3 Jul 2:20 pm",
    "dtstart": "20130724T134000",
    "dtend": "20130724T142000"
  },
  {
    "dtstamp": "20130724T223958",
    "location": "E147",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31430",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-14:30--31430",
    "summary": "How To Make Money On Open Source Today",
    "description": "Presented by Michael Widenius (Monty Program Ab). Time has changed since the start of Open Source. Companies has now started to understand that they can use open source without having to pay for it.  How can one today create a viable business around open source software?",
    "id": 239,
    "begin": "3 Jul 2:30 pm",
    "end": "3 Jul 3:10 pm",
    "dtstart": "20130724T143000",
    "dtend": "20130724T151000"
  },
  {
    "dtstamp": "20130725T005218",
    "location": "E147",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29462",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-16:10--29462",
    "summary": "Create Elegant Builds at Scale with Gradle",
    "description": "Presented by Tim O'Brien (O'Reilly Media), Hans Dockter (Gradleware). How do the largest projects scale development?   That’s the question answered in this presentation.   We’ll take a look at build environments at the largest scale and discuss the choices these organizations made to create builds and projects that can scale across hundreds or thousands of developers.  We'll draw conclusion from specific case studies such as Netflix and LinkedIn.",
    "id": 240,
    "begin": "3 Jul 4:10 pm",
    "end": "3 Jul 4:50 pm",
    "dtstart": "20130724T161000",
    "dtend": "20130724T165000"
  },
  {
    "dtstamp": "20130725T005231",
    "location": "E147",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29342",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-17:00--29342",
    "summary": "Real World Behavior Driven Design (BDD)",
    "description": "Presented by Aslak Knutsen (Red Hat). Stakeholders often get criticized for not knowing what they want. If they don't know what they want, how do you know what to code? It's a two way street and you both need to be on it. In this session, we'll explore agile techniques such as BDD and ATDD as well as tools from the Arquillian Universe that can help us produce clearer tests that show real behavior and give measurable results.",
    "id": 241,
    "begin": "3 Jul 5:00 pm",
    "end": "3 Jul 5:40 pm",
    "dtstart": "20130724T170000",
    "dtend": "20130724T174000"
  },
  {
    "dtstamp": "20130325T231443",
    "location": "E147",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29135",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-10:40--29135",
    "summary": "Fundamentals of Tuning OpenJDK's GC",
    "description": "Presented by Charlie Hunt (Salesforce.com). There is a small set of fundamentals that, when well understood, can empower any one to tune any of the garbage collectors in OpenJDK's HotSpot JVM. This is what attendees of this session can expect to learn.",
    "id": 242,
    "begin": "4 Jul 10:40 am",
    "end": "4 Jul 11:20 am",
    "dtstart": "20130725T104000",
    "dtend": "20130725T112000"
  },
  {
    "dtstamp": "20130326T134536",
    "location": "E147",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28815",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-11:30--28815",
    "summary": "Divide & Conquer : Efficient Java for multi-core world",
    "description": "Presented by Velmurugan Periasamy (Verisign), Sunil Mundluri (Verisign). The future hardware trend is clear.Moore’s Law will be delivering more cores per chip rather than higher clock rates. As multi-core, multiprocessor systems become cheaper and readily available, more of our applications need to exploit the hardware parallelism to realize exponential performance gains.This is all about how to write efficient java code in the multi core world",
    "id": 243,
    "begin": "4 Jul 11:30 am",
    "end": "4 Jul 12:10 pm",
    "dtstart": "20130725T113000",
    "dtend": "20130725T121000"
  },
  {
    "dtstamp": "20130401T130811",
    "location": "E147",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28961",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-13:40--28961",
    "summary": "Getting Started with WebSocket and Server-Sent Events using Java",
    "description": "Presented by Reza Rahman (Oracle). This session provides a primer on WebSocket and Server-Sent Events and their supported use cases. The attendees will learn how to leverage them in their web applications using several code samples through out the talk. Development, deployment, and debugging techniques will be shared with the attendees.",
    "id": 244,
    "begin": "4 Jul 1:40 pm",
    "end": "4 Jul 2:20 pm",
    "dtstart": "20130725T134000",
    "dtend": "20130725T142000"
  },
  {
    "dtstamp": "20130530T165115",
    "location": "E147",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31322",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-14:30--31322",
    "summary": "Resiliency Through Failure",
    "description": "Presented by Ariel Tseitlin (Netflix). Failure is inevitable. It's only through frequent and ongoing failure that we can keep our web application resilient. Taking example from the Netflix Simian Army, we'll discuss how inducing failure in your production environment is one way to test fault-tolerance on a regular basis.",
    "id": 245,
    "begin": "4 Jul 2:30 pm",
    "end": "4 Jul 3:10 pm",
    "dtstart": "20130725T143000",
    "dtend": "20130725T151000"
  },
  {
    "dtstamp": "20130513T174141",
    "location": "E147",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29673",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-16:10--29673",
    "summary": "TripleO: OpenStack on OpenStack",
    "description": "Presented by Monty Taylor (HP). Turn your datacenter into a cloud, and then use that cloud to run a cloud. It's clouds all the way down!",
    "id": 246,
    "begin": "4 Jul 4:10 pm",
    "end": "4 Jul 4:50 pm",
    "dtstart": "20130725T161000",
    "dtend": "20130725T165000"
  },
  {
    "dtstamp": "20130513T194553",
    "location": "E147",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28055",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-17:00--28055",
    "summary": "Introducing Apache CloudStack",
    "description": "Presented by Kevin Kluge (Elasticsearch). Apache CloudStack, a project in Incubation, helps an admin or devops engineer build an IaaS cloud. This talk provides a technical description of the CloudStack feature set, deployment options, and integration points with the data center. The project's status and possible future directions will be presented as well.",
    "id": 247,
    "begin": "4 Jul 5:00 pm",
    "end": "4 Jul 5:40 pm",
    "dtstart": "20130725T170000",
    "dtend": "20130725T174000"
  },
  {
    "dtstamp": "20130703T165317",
    "location": "E147",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31463",
    "uid": "http://oscon.com/oscon2013--s2013-07-26-10:00--31463",
    "summary": "OSCON Town Hall",
    "description": "Presented by Edd Dumbill (Silicon Valley Data Science), Sarah Novotny (Meteor Entertainment), Matthew McCullough (GitHub, Inc.), Gina Blaber (O'Reilly Media, Inc.), Simon St. Laurent (O'Reilly Media, Inc.). OSCON belongs to its attendees, and we want to hear what you think of this year’s show. Join the organizers to talk about what you loved and hated about OSCON, and what you’d like to see next year.",
    "id": 248,
    "begin": "5 Jul 10:00 am",
    "end": "5 Jul 10:40 am",
    "dtstart": "20130726T100000",
    "dtend": "20130726T104000"
  },
  {
    "dtstamp": "20130716T183153",
    "location": "E147",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31520",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-19:00--31520",
    "summary": "The DevOps Pay Raise: Quantifying Your Value to Move Up the Ladder",
    "description": "DevOps, when done right, usually goes unnoticed. It’s only when something breaks that all eyes turn to IT. If your boss only sees you when the app is down, however, that’s not really doing your career any favors.",
    "id": 249,
    "begin": "3 Jul 7:00 pm",
    "end": "3 Jul 8:00 pm",
    "dtstart": "20130724T190000",
    "dtend": "20130724T200000"
  },
  {
    "dtstamp": "20130718T203147",
    "location": "E147",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31549",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-19:00--31549",
    "summary": "MongoDB community",
    "description": "Interested in MongoDB? This BOF is for the MongoDB community and for those who want to learn more about it. Come to this session to talk about tools, libraries, best practices, and production deployments. Join us!",
    "id": 250,
    "begin": "4 Jul 7:00 pm",
    "end": "4 Jul 8:00 pm",
    "dtstart": "20130725T190000",
    "dtend": "20130725T200000"
  },
  {
    "dtstamp": "20130723T190008",
    "location": "E  141",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29589",
    "uid": "http://oscon.com/oscon2013--s2013-07-22-09:00--29589",
    "summary": "Community Management Training",
    "description": "Presented by Jono Bacon (Canonical Ltd). This day long event aims to provide high-quality training seminars about community management before/during major conferences. This training would provide organizations and individuals an opportunity to have their community-facing staff attend the training and join the conference in the same trip.",
    "id": 251,
    "begin": "1 Jul 9:00 am",
    "end": "1 Jul 5:00 pm",
    "dtstart": "20130722T090000",
    "dtend": "20130722T170000"
  },
  {
    "dtstamp": "20130625T171014",
    "location": "E  141",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31393",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-19:00--31393",
    "summary": "MySQL, NoSQL, BigData - Better Together ?",
    "description": "Increasing number of applications use multiple technologies for data storage and processing.  Come to this BOF to share your experience of using multiple technologies together",
    "id": 252,
    "begin": "3 Jul 7:00 pm",
    "end": "3 Jul 8:00 pm",
    "dtstart": "20130724T190000",
    "dtend": "20130724T200000"
  },
  {
    "dtstamp": "20130724T233826",
    "location": "F150",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29387",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-10:40--29387",
    "summary": "Building a Cloud Culture at Yelp",
    "description": "Presented by Jim Blomo (Yelp). How is Yelp handling its transition into the cloud?  Yelp is a big consumer of Amazon’s Elastic MapReduce service for batch jobs, but still self-hosts for its website.  What are the advantages and pitfalls of a split cloud/server model?  This talk will discuss the open source tools used by Yelp that have enabled the embrace of cloud technology, and the areas where data centers still have an edge.",
    "id": 253,
    "begin": "3 Jul 10:40 am",
    "end": "3 Jul 11:20 am",
    "dtstart": "20130724T104000",
    "dtend": "20130724T112000"
  },
  {
    "dtstamp": "20130325T180403",
    "location": "F150",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29143",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-11:30--29143",
    "summary": "Connecting the client to the cloud  - The Sputnik Story",
    "description": "Presented by Barton George (Dell), Michael Coté (Dell). By linking together an Ubuntu-based laptop and cloud back-end, developers are able to model an entire environment on their client and then launch it to the cloud. Add to that a community-based library of language profiles to down load and auto-install and you have fluid Open Source end-to-end environment to build test and deploy.",
    "id": 254,
    "begin": "3 Jul 11:30 am",
    "end": "3 Jul 12:10 pm",
    "dtstart": "20130724T113000",
    "dtend": "20130724T121000"
  },
  {
    "dtstamp": "20130724T212525",
    "location": "F150",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29394",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-13:40--29394",
    "summary": "The Hitchiker’s Guide to Open Source Cloud Computing",
    "description": "Presented by Mark Hinkle (Citrix). Imagine it’s eight o’clock on a Thursday morning and you awake to see a bulldozer out your window ready to plow over your data center. Normally you might consult the Encyclopedia Galáctica to discern the best course of action but your copy is likely out of date. That’s why you need to attend this talk to understand what to do when the Vogons threaten to destroy your data center.",
    "id": 255,
    "begin": "3 Jul 1:40 pm",
    "end": "3 Jul 2:20 pm",
    "dtstart": "20130724T134000",
    "dtend": "20130724T142000"
  },
  {
    "dtstamp": "20130507T140831",
    "location": "F150",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29080",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-14:30--29080",
    "summary": "Open Source Services on Windows Azure",
    "description": "Presented by Ross Gardler (Microsoft Open Technologies, Inc.). A growing number of OSS technologies are available as services on Windows Azure, including database services for MySQL, MongoDB, and CouchDB developers, enterprise search based on Solr/Lucene, caching via the memcached wire protocol, and others. In this session you'll see examples of how to take advantage of these services from applications running on any cloud platform.",
    "id": 256,
    "begin": "3 Jul 2:30 pm",
    "end": "3 Jul 3:10 pm",
    "dtstart": "20130724T143000",
    "dtend": "20130724T151000"
  },
  {
    "dtstamp": "20130725T003219",
    "location": "F150",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29257",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-16:10--29257",
    "summary": "Quick Prototyping with the Cloud",
    "description": "Presented by Kirsten Jones (Princess Polymath). The ability to create quick prototypes is fantastic, whether you're at a hackathon, trying to create a proof of concept for work, or just playing on your own.  This talk will show you how to create quick applications using python, php and node.js on Heroku, Appfog and Nodejitsu.",
    "id": 257,
    "begin": "3 Jul 4:10 pm",
    "end": "3 Jul 4:50 pm",
    "dtstart": "20130724T161000",
    "dtend": "20130724T165000"
  },
  {
    "dtstamp": "20130327T075346",
    "location": "F150",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29346",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-17:00--29346",
    "summary": "Deploying your application on OpenStack using bosh",
    "description": "Presented by Jeffrey Peckham (Pivotal). Bosh is an open source cloud orchestration tool chain, which will let you deploy your application to a number of clouds, and manage the whole application lifecycle - release engineering, VM creation, VM resizing, operating system upgrades, database & application upgrades.",
    "id": 258,
    "begin": "3 Jul 5:00 pm",
    "end": "3 Jul 5:40 pm",
    "dtstart": "20130724T170000",
    "dtend": "20130724T174000"
  },
  {
    "dtstamp": "20130401T184313",
    "location": "F150",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28938",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-10:40--28938",
    "summary": "AppScale -- Google App Engine in Open Source",
    "description": "Presented by Chandra Krintz (UCSB and AppScale Systems). In this talk, we present AppScale, an open source implementation of Google App Engine -- think Google's cloud platform under your control.  AppScale executes App Engine apps without modification, automatically manages and scales apps and their service ecosystems, and enables developers to plug in different service alternatives  (e.g. NoSQL, SQL, analytics, search,..) without rewriting their code.",
    "id": 259,
    "begin": "4 Jul 10:40 am",
    "end": "4 Jul 11:20 am",
    "dtstart": "20130725T104000",
    "dtend": "20130725T112000"
  },
  {
    "dtstamp": "20130329T160230",
    "location": "F150",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28601",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-11:30--28601",
    "summary": "Distributed Patterns in Action",
    "description": "Presented by Eric Redmond (Basho). Scalability today is no longer a question of architecture, or programming language, but instead two things: message passing and data distribution. With the following patterns under your belt, anyone is well on their way to solving both. * Message patterns: request-reply, publish-subscribe, push-pull, exclusive pair. * Data structures: DHTs, Vector clocks, Merkel trees, CRDTs.",
    "id": 260,
    "begin": "4 Jul 11:30 am",
    "end": "4 Jul 12:10 pm",
    "dtstart": "20130725T113000",
    "dtend": "20130725T121000"
  },
  {
    "dtstamp": "20130329T155821",
    "location": "F150",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28973",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-13:40--28973",
    "summary": "Netflix API: Supporting Billions in the Cloud",
    "description": "Presented by Daniel Jacobson (Netflix). Netflix has seen tremendous growth in recent years, supporting 800+ device types for more than 30M streaming customers. This growth presents amazing technical challenges. At the center of it all is the Netflix Internal API, quietly handling billions of requests a day. In this session, I will discuss the challenges & solutions, including cloud development, resiliency, scaling, UI support & more.",
    "id": 261,
    "begin": "4 Jul 1:40 pm",
    "end": "4 Jul 2:20 pm",
    "dtstart": "20130725T134000",
    "dtend": "20130725T142000"
  },
  {
    "dtstamp": "20130328T130508",
    "location": "F150",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28805",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-14:30--28805",
    "summary": "Running Your Open Source Project on Any Cloud Directly from GitHub",
    "description": "Presented by Uri Cohen (GigaSpaces Technologies), Nati Shalom (Gigaspaces). Just developed a new feature, and looking to try it out? The process of testing new features can be tedious and time consuming. This session will present a new open source solution that enables you to demo your features as a service with a javascript embed code.",
    "id": 262,
    "begin": "4 Jul 2:30 pm",
    "end": "4 Jul 3:10 pm",
    "dtstart": "20130725T143000",
    "dtend": "20130725T151000"
  },
  {
    "dtstamp": "20130719T175304",
    "location": "F150",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31022",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-16:10--31022",
    "summary": "Building Scalable PHP Applications Using Google’s App Engine",
    "description": "Presented by Stuart Langley (Google), Amy Unruh (Google). Google App Engine allows you to build web applications on the same scalable systems that power Google applications. In this session we’ll dive into the best practices for writing scalable PHP applications on the App Engine platform.",
    "id": 263,
    "begin": "4 Jul 4:10 pm",
    "end": "4 Jul 4:50 pm",
    "dtstart": "20130725T161000",
    "dtend": "20130725T165000"
  },
  {
    "dtstamp": "20130328T201316",
    "location": "F150",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28745",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-17:00--28745",
    "summary": "Breaking through with Cloud Foundry",
    "description": "Presented by Andy Piper (Cloud Foundry, Pivotal). Public, private, and hybrid; software, platform, and infrastructure. This talk will discuss the current state of the Platform-as-a-Service space, and why the keys to success lie in enabling developer productivity, and providing openness and choice. We'll do this by considering the success of Open Source in general, and then look at the Cloud Foundry project and its growing ecosystem.",
    "id": 264,
    "begin": "4 Jul 5:00 pm",
    "end": "4 Jul 5:40 pm",
    "dtstart": "20130725T170000",
    "dtend": "20130725T174000"
  },
  {
    "dtstamp": "20130724T210758",
    "location": "F150",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28779",
    "uid": "http://oscon.com/oscon2013--s2013-07-23-09:00--28779",
    "summary": "Introduction to Clojure",
    "description": "Presented by Neal Ford (ThoughtWorks). Clojure is the most interesting new language on the JVM, both from a syntactic and capabilities standpoint. This workshop teaches attendees Clojure syntax, Java interoperability, and how to build applications, both Swing and Web, using Clojure.",
    "id": 265,
    "begin": "2 Jul 9:00 am",
    "end": "2 Jul 12:30 pm",
    "dtstart": "20130723T090000",
    "dtend": "20130723T123000"
  },
  {
    "dtstamp": "20130724T230933",
    "location": "F150",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28753",
    "uid": "http://oscon.com/oscon2013--s2013-07-23-13:30--28753",
    "summary": "Improve Your Team With Improv",
    "description": "Presented by Andrew Berkowitz (TeamSnap), Wade Minter (TeamSnap). Getting everyone in your company or development team on the same page can be a challenge. This on-your-feet workshop will teach fast, fun improv techniques for helping your group to bond and work better together. Learn the secrets of improv-based team building from two professionals who have decades of experience working in open source, Internet start-ups and corporate training.",
    "id": 266,
    "begin": "2 Jul 1:30 pm",
    "end": "2 Jul 5:00 pm",
    "dtstart": "20130723T133000",
    "dtend": "20130723T170000"
  },
  {
    "dtstamp": "20130723T191552",
    "location": "D 135",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31508",
    "uid": "http://oscon.com/oscon2013--s2013-07-22-09:00--31508",
    "summary": "Code-a-Thon / inBloom LRI – Learning Resource Discovery Engine",
    "description": "Presented by Jason Hoekstra  (inBloom). inBloom releases open-source for a core educational service at OSCon 2013. Released under the Apache 2 license, come learn how to use this service in your apps and contribute to improving the core search service for usage in school districts across the nation.",
    "id": 267,
    "begin": "1 Jul 9:00 am",
    "end": "1 Jul 5:00 pm",
    "dtstart": "20130722T090000",
    "dtend": "20130722T170000"
  },
  {
    "dtstamp": "20130724T160814",
    "location": "D 135",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31509",
    "uid": "http://oscon.com/oscon2013--s2013-07-23-09:00--31509",
    "summary": "Code-a-Thon / inBloom LRI – Learning Resource Discovery Engine",
    "description": "Presented by Jason Hoekstra  (inBloom). inBloom releases open-source for a core educational service at OSCon 2013. Released under the Apache 2 license, come learn how to use this service in your apps and contribute to improving the core search service for usage in school districts across the nation.",
    "id": 268,
    "begin": "2 Jul 9:00 am",
    "end": "2 Jul 5:00 pm",
    "dtstart": "20130723T090000",
    "dtend": "20130723T170000"
  },
  {
    "dtstamp": "20130724T204535",
    "location": "F151",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29105",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-10:40--29105",
    "summary": "Hackerspaces: the new face of school",
    "description": "Presented by Nathan Dotz (All Hands Active). Hackerspaces are changing the face of education by applying a DIY principle of Do-ocracy to deficits in the education systems around them and providing places where students can learn engaging topics useful in their lives and careers. Come learn how maker communities worldwide are helping to teach the world, and how we can legitimize the enrichment that goes on behind the shop doors.",
    "id": 269,
    "begin": "3 Jul 10:40 am",
    "end": "3 Jul 11:20 am",
    "dtstart": "20130724T104000",
    "dtend": "20130724T112000"
  },
  {
    "dtstamp": "20130724T210343",
    "location": "F151",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28968",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-11:30--28968",
    "summary": "Using Open Source in the Classroom Every Single Day",
    "description": "Presented by Jon Roberts (Davis School District). With growing use of computers in schools, tightening district budgets, evolving learning objectives, and the plethora of available applications, it makes sense to leverage open source software to support public education. Hear of the tales of a hacker turned teacher as he uses a variety of purely open source tools and techniques to enhance math and computer education in an alternative setting.",
    "id": 270,
    "begin": "3 Jul 11:30 am",
    "end": "3 Jul 12:10 pm",
    "dtstart": "20130724T113000",
    "dtend": "20130724T121000"
  },
  {
    "dtstamp": "20130724T230917",
    "location": "F151",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29148",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-13:40--29148",
    "summary": "Collaborative Teaching for More Effective Learning",
    "description": "Presented by Brent Beer (GitHub). Everyone wins when everyone is smarter, so why is it so difficult to share and collaborate on teaching materials? Attend this session to see how having your courseware and other teaching materials stored in Git and on GitHub allows students to stay in touch, learn collaboratively, extract more knowledge, and potentially even give back to the course materials.",
    "id": 271,
    "begin": "3 Jul 1:40 pm",
    "end": "3 Jul 2:20 pm",
    "dtstart": "20130724T134000",
    "dtend": "20130724T142000"
  },
  {
    "dtstamp": "20130724T230854",
    "location": "F151",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29383",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-14:30--29383",
    "summary": "Android U",
    "description": "Presented by Brian Capouch (Saint Josephs College). An outreach project at Saint Joseph's College strives to bring low-cost Android-based technology to a wide swath of the college community.  Various projects are using Android smartphones as sensors, data collection and media generation, as well as providing an alternative to carrier-based telephony, SMS, and Internet bandwidth.",
    "id": 272,
    "begin": "3 Jul 2:30 pm",
    "end": "3 Jul 3:10 pm",
    "dtstart": "20130724T143000",
    "dtend": "20130724T151000"
  },
  {
    "dtstamp": "20130724T233622",
    "location": "F151",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28799",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-16:10--28799",
    "summary": "How To Get More Kids To Code",
    "description": "Presented by Regina ten Bruggencate (iPROFS / Duchess), Kim Spiritus (Info Support). This talk will highlight some of the great tools that are available to teach children how much fun coding is. Also some of the different formats used for reaching kids.",
    "id": 273,
    "begin": "3 Jul 4:10 pm",
    "end": "3 Jul 4:50 pm",
    "dtstart": "20130724T161000",
    "dtend": "20130724T165000"
  },
  {
    "dtstamp": "20130525T184810",
    "location": "F151",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29681",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-17:00--29681",
    "summary": "Crowdfunding FOSS Companies",
    "description": "Presented by Fred Trotter (FredTrotter.com), Ashish Patel (Not Only Dev), Rick Trotter (Not Only Dev), Renee DiResta (OATV), Clayton Trotter (University of Alaska). The JOBS act will change the rules for public offerings of stock, making the crowdfunding of stock sales legal.  This will allow Open Source developers and makers to create new technology companies by leveraging their existing communities for initial funding.  Join us to discuss what we know, and what we don't about this new funding option.",
    "id": 274,
    "begin": "3 Jul 5:00 pm",
    "end": "3 Jul 5:40 pm",
    "dtstart": "20130724T170000",
    "dtend": "20130724T174000"
  },
  {
    "dtstamp": "20130724T063002",
    "location": "F151",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29460",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-10:40--29460",
    "summary": "Hacking Your Health",
    "description": "Presented by David Uhlman (clearhealth inc.). Most technology people have a unique perspective on problem solving and DIY. \"Hacking Your Health\" shows you how to put those same principles to use with your health and body. Get your labs done directly (for \"science\" or to save money), fun and profitable things to do with MRI/CAT like 3D Printing your head, \"being the best patient you can be\" and inner secrets about health care as a whole.",
    "id": 275,
    "begin": "4 Jul 10:40 am",
    "end": "4 Jul 11:20 am",
    "dtstart": "20130725T104000",
    "dtend": "20130725T112000"
  },
  {
    "dtstamp": "20130328T001515",
    "location": "F151",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29324",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-11:30--29324",
    "summary": "Quantifying your Fitness",
    "description": "Presented by Kirsten Jones (Princess Polymath). The Quantified Self movement is all about keeping measurements about your life in order to track progress in various ways.  As geeks we all enjoy playing with new toys, and there are a variety of devices and applications out there to help measure steps, activity and fitness.  Combining the data from these devices can help you build tools to track your fitness in a way that makes sense for you.",
    "id": 276,
    "begin": "4 Jul 11:30 am",
    "end": "4 Jul 12:10 pm",
    "dtstart": "20130725T113000",
    "dtend": "20130725T121000"
  },
  {
    "dtstamp": "20130325T171625",
    "location": "F151",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28802",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-13:40--28802",
    "summary": "Kicking Impostor Syndrome In the Head",
    "description": "Presented by Denise Paolucci (Dreamwidth Studios). Impostor syndrome -- the persistent belief that any minute everyone around you is going to figure out you're not at all qualified -- happens to a majority of the tech industry; nobody talks about it, because nobody wants to be the first to admit it. This talk confronts that feeling head-on, and addresses ways to readjust your perceptions of your accomplishments to accurately reflect reality.",
    "id": 277,
    "begin": "4 Jul 1:40 pm",
    "end": "4 Jul 2:20 pm",
    "dtstart": "20130725T134000",
    "dtend": "20130725T142000"
  },
  {
    "dtstamp": "20130329T160724",
    "location": "F151",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29326",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-14:30--29326",
    "summary": "Everything Counts",
    "description": "Presented by Mari Huertas (Obama for America). \"Everything counts, and people matter most of all.\" I wrote these words in my journal at the start of 2012, after I first joined the Obama campaign. Now, one year later, I'm realizing how prescient they were for our work – its development, shape, and shipment – and how acutely they apply to what we do in technology every day.",
    "id": 278,
    "begin": "4 Jul 2:30 pm",
    "end": "4 Jul 3:10 pm",
    "dtstart": "20130725T143000",
    "dtend": "20130725T151000"
  },
  {
    "dtstamp": "20130325T181917",
    "location": "F151",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29222",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-16:10--29222",
    "summary": "The Open Privacy Stack: Privly",
    "description": "Presented by Sean McGregor (The Privly Foundation), Jennifer Davidson (Oregon State University). Come learn how to take back your internet privacy on services you hate to trust, but love to use! We created Privly, an open source privacy stack, to allow you to post private content to any website without trusting the host site. We will cover how Privly is a general solution to internet privacy, discuss the beta, and describe a new type of app infrastructure.",
    "id": 279,
    "begin": "4 Jul 4:10 pm",
    "end": "4 Jul 4:50 pm",
    "dtstart": "20130725T161000",
    "dtend": "20130725T165000"
  },
  {
    "dtstamp": "20130401T181320",
    "location": "F151",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29415",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-17:00--29415",
    "summary": "Using the Realtime Web for Awesome Presentations",
    "description": "Presented by Wesley Hales (Apigee). How can you keep the audience engaged and motivated throughout an entire presentation? It’s simple: keep them on their smart phone.  The days of asking the audience to raise their hand for an on-the-fly survey is over. An entire stream of engagement platforms for presentations are coming, and this talk will prepare you for the future.",
    "id": 280,
    "begin": "4 Jul 5:00 pm",
    "end": "4 Jul 5:40 pm",
    "dtstart": "20130725T170000",
    "dtend": "20130725T174000"
  },
  {
    "dtstamp": "20130612T161943",
    "location": "E141",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31390",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-10:40--31390",
    "summary": "Stage 2 Management Systems | Building A Foundation For Flexible Service Delivery",
    "description": "Presented by Kelcey Damage (Backbone Technology Inc.). The presentation will discuss the building of a management system for the services and application layer of a cloud-application infrastructure. It will focus on the three key components in open source cloud-computing that don’t come in the box: o\tSelf-healing application infrastructure o\tDynamic auto-scaling o\tAutomated guest administration",
    "id": 281,
    "begin": "4 Jul 10:40 am",
    "end": "4 Jul 11:20 am",
    "dtstart": "20130725T104000",
    "dtend": "20130725T112000"
  },
  {
    "dtstamp": "20130612T162009",
    "location": "E141",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31391",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-10:40--31391",
    "summary": "Software Defined Networking: Adding Network Agility to the Cloud",
    "description": "Presented by Sebastien Goasguen (Citrix). Software Defined Networking is essential to allow for complete cloud automation and agility and is rapidly evolving to become an invaluable tool for cloud operators. In this talk we will discuss the challenges of virtual machine networking, present techniques developed in the last ten years and show how they led to the third leg of virtualization in the datacenter: network virtualization.",
    "id": 282,
    "begin": "3 Jul 10:40 am",
    "end": "3 Jul 11:20 am",
    "dtstart": "20130724T104000",
    "dtend": "20130724T112000"
  },
  {
    "dtstamp": "20130625T164712",
    "location": "E141",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31427",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-14:30--31427",
    "summary": "Its All About Me! Scaling Personalizable Content at Hulu",
    "description": "Presented by Dallas Mahrt (Hulu). It's great knowing what is on TV, but what I really want is how that applies to me. This talk discusses how Hulu has built a scalable content metadata API that can incorporate user specific data.",
    "id": 283,
    "begin": "4 Jul 2:30 pm",
    "end": "4 Jul 3:10 pm",
    "dtstart": "20130725T143000",
    "dtend": "20130725T151000"
  },
  {
    "dtstamp": "20130701T181132",
    "location": "E141",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31442",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-11:30--31442",
    "summary": "Code Review for Systems Administrators",
    "description": "Presented by Elizabeth Krumbach Joseph (HP). Using the public code review and automated testing infrastructure built for the OpenStack project itself, systems administrators for the core infrastructure also take advantage of this system to do systems administration for the project's core infrastructure in the open as well. Will discuss the infrastructure, tests we run against our changes and the challenges and successes we've encountered.",
    "id": 284,
    "begin": "4 Jul 11:30 am",
    "end": "4 Jul 12:10 pm",
    "dtstart": "20130725T113000",
    "dtend": "20130725T121000"
  },
  {
    "dtstamp": "20130724T231503",
    "location": "E141",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31436",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-11:30--31436",
    "summary": "Provisioning Bare Metal with OpenStack",
    "description": "Presented by Devananda van der Veen (HP Cloud Services). Would you be excited to have a single API and single pipeline for developing, testing, and deploying your applications on both physical and virtual servers? OpenStack can now do this. I am leading the development effort behind OpenStack's Bare Metal Provisioning (Ironic) project, and will talk about the project history, current status, and our plans as it continues to mature.",
    "id": 285,
    "begin": "3 Jul 11:30 am",
    "end": "3 Jul 12:10 pm",
    "dtstart": "20130724T113000",
    "dtend": "20130724T121000"
  },
  {
    "dtstamp": "20130708T204752",
    "location": "E141",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31475",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-16:10--31475",
    "summary": "Tizen Overview and Architecture",
    "description": "Presented by Alvin Kim (Samsung Electronics). Tizen is an open-source, standards-based platform targeting multiple device categories such as smartphones, in-vehicle infotainment devices, and smart TVs. Tizen 2.2 has been recently announced with upgraded Web application framework and Native application framework. This talk will present an overview of the latest platform features and SDK provided by Tizen, along with its architecture.",
    "id": 286,
    "begin": "3 Jul 4:10 pm",
    "end": "3 Jul 4:50 pm",
    "dtstart": "20130724T161000",
    "dtend": "20130724T165000"
  },
  {
    "dtstamp": "20130709T140817",
    "location": "E141",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31473",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-16:10--31473",
    "summary": "Rust for the Jungle",
    "description": "Presented by Sanghyeon Seo (Samsung Electronics). Rust is a system programming language with emphasis on safety, concurrency, and speed. Herb Sutter, in an article \"Welcome to the Jungle\", likened multi-core, heterogeneous many-core computing environment to the jungle. Have a trusty rusty knife for all your jungle needs.",
    "id": 287,
    "begin": "4 Jul 4:10 pm",
    "end": "4 Jul 4:50 pm",
    "dtstart": "20130725T161000",
    "dtend": "20130725T165000"
  },
  {
    "dtstamp": "20130723T225340",
    "location": "E141",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31471",
    "uid": "http://oscon.com/oscon2013--s2013-07-22-19:00--31471",
    "summary": "AWS Elastic Beanstalk: Zero to Cloud in Sixty Minutes",
    "description": "Learn about and use AWS Elastic Beanstalk, a service that lets developers quickly deploy and manage their applications in the AWS Cloud. Geared towards developers new to AWS, this session will provide a brief overview of the technology. After the overview, you will build and deploy a Node.js or Python app to Elastic Beanstalk. Zero to cloud in sixty minutes!",
    "id": 288,
    "begin": "1 Jul 7:00 pm",
    "end": "1 Jul 8:00 pm",
    "dtstart": "20130722T190000",
    "dtend": "20130722T200000"
  },
  {
    "dtstamp": "20130716T212948",
    "location": "E141",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31491",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-19:00--31491",
    "summary": "Ceph: Community Status and Getting Involved",
    "description": "A quick overview of the Ceph project, current community development plans, and how anyone can get involved from the novice to the seasoned expert.",
    "id": 289,
    "begin": "4 Jul 7:00 pm",
    "end": "4 Jul 8:00 pm",
    "dtstart": "20130725T190000",
    "dtend": "20130725T200000"
  },
  {
    "dtstamp": "20130712T195101",
    "location": "E141",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31514",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-13:40--31514",
    "summary": "Android-IA Scalability Features To Support A Single Build Target",
    "description": "Presented by Andrew Boie (Intel ). Android-IA is an open source dsitribution of Android for devices with Intel Core processors distributed on 01.org. This presentation will describe some of the enhancements made to Android so that a single binary image runs well on a variety of off-the-shelf tablets and convertible notebooks.",
    "id": 290,
    "begin": "3 Jul 1:40 pm",
    "end": "3 Jul 2:20 pm",
    "dtstart": "20130724T134000",
    "dtend": "20130724T142000"
  },
  {
    "dtstamp": "20130724T223247",
    "location": "E141",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31530",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-14:30--31530",
    "summary": "Planning an OpenStack Cloud",
    "description": "Presented by Tom Fifield (OpenStack Foundation). Are you considering an OpenStack cloud implementation? Add this timely session to your OSCON calendar. Tom Fifield, a co-author of the OpenStack Operations Guide, will discuss what it takes, including an introduction to OpenStack, advice on how to interact with the community, deployment approaches, storage and networking decisions, and automating deployment and configuration with popular tools.",
    "id": 291,
    "begin": "3 Jul 2:30 pm",
    "end": "3 Jul 3:10 pm",
    "dtstart": "20130724T143000",
    "dtend": "20130724T151000"
  },
  {
    "dtstamp": "20130719T225131",
    "location": "E141",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31558",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-13:40--31558",
    "summary": "Class's Class is Class: Metaprogramming Ruby",
    "description": "Presented by Chris Kelly (New Relic). Ruby's open class structure makes metaprogramming simple and powerful. At New Relic, we leverage metaprogramming in our Ruby agent to extract deep metrics about your code automatically. In this session, we'll start with the Ruby Object Model and work through the most common callbacks for efficient metaprogramming.",
    "id": 292,
    "begin": "4 Jul 1:40 pm",
    "end": "4 Jul 2:20 pm",
    "dtstart": "20130725T134000",
    "dtend": "20130725T142000"
  },
  {
    "dtstamp": "20130724T053309",
    "location": "E141",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31559",
    "uid": "http://oscon.com/oscon2013--s2013-07-23-13:30--31559",
    "summary": "Turn The Lights On Your Application Performance",
    "description": "Presented by Gautam Mulchandani (New Relic). New Relic provides deep application monitoring for your web & mobile apps without the time-consuming configuration. With a complete SaaS delivery model and an easy to use Interface, you can quickly be up and running with New Relic.",
    "id": 293,
    "begin": "2 Jul 1:30 pm",
    "end": "2 Jul 5:00 pm",
    "dtstart": "20130723T133000",
    "dtend": "20130723T170000"
  },
  {
    "dtstamp": "20130618T195146",
    "location": "E142",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31410",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-13:40--31410",
    "summary": "From Proprietary to Community: The Open Sourcing of Enyo",
    "description": "Presented by Ben Combee (LG Electronics, webOS Framework Team). It was just two years ago that the first version of the Enyo library was introduced to the world as a proprietary JavaScript library, tied to the HP TouchPad and its SDK. Now, it’s a thriving framework running on everything from phones to tablets to desktops to TVs, with a contributor community spanning two major companies (LG and HP) and a vibrant collection of independent developers.",
    "id": 294,
    "begin": "4 Jul 1:40 pm",
    "end": "4 Jul 2:20 pm",
    "dtstart": "20130725T134000",
    "dtend": "20130725T142000"
  },
  {
    "dtstamp": "20130724T214851",
    "location": "E142",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31107",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-13:40--31107",
    "summary": "Flash Aware Applications",
    "description": "Presented by Nisha Talagala (Fusion-io). ‘Flash-aware’ means an application knows that it is running on flash, which enables it to make configuration or code changes to leverage flash for performance gains and return on investment.  In this session, Fusion-io describes several examples of open-source applications that have recently become flash-aware, including our work to make the Linux virtual memory swap subsystem flash-aware.",
    "id": 295,
    "begin": "3 Jul 1:40 pm",
    "end": "3 Jul 2:20 pm",
    "dtstart": "20130724T134000",
    "dtend": "20130724T142000"
  },
  {
    "dtstamp": "20130724T152109",
    "location": "E142",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31425",
    "uid": "http://oscon.com/oscon2013--s2013-07-23-09:00--31425",
    "summary": "“Butter” Up Your Application",
    "description": "Presented by Wayne Walls (Rackspace Hosting), Alex Brandt  (Rackspace Hosting). The Rackspace Unlocked team will cover the Five Pillars of Cloudiness, the five key tenets that dive into how to navigate uncharted territory and design cloud applications. Learn how public, private and hybrid clouds can be leveraged to your advantage to free your application(s) from a one-size-fits-all cloud in favor of one that is a perfect fit.",
    "id": 296,
    "begin": "2 Jul 9:00 am",
    "end": "2 Jul 12:30 pm",
    "dtstart": "20130723T090000",
    "dtend": "20130723T123000"
  },
  {
    "dtstamp": "20130724T183537",
    "location": "E142",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31445",
    "uid": "http://oscon.com/oscon2013--s2013-07-23-13:30--31445",
    "summary": "Build Your Own Heroku With Open Source Cloud Foundry - A Hands On Tutorial",
    "description": "Presented by Dr. Nic Williams (Stark & Wayne). If you use Heroku for your pet projects, then you can now use open source Cloud Foundry for your work projects. By the end of this tutorial, you will have your own entire Platform as a Service running on AWS!",
    "id": 297,
    "begin": "2 Jul 1:30 pm",
    "end": "2 Jul 5:00 pm",
    "dtstart": "20130723T133000",
    "dtend": "20130723T170000"
  },
  {
    "dtstamp": "20130708T182924",
    "location": "E142",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31462",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-10:40--31462",
    "summary": "Open Source in the Enterprise: Telecommunications and Contact Centers",
    "description": "Presented by Jared Smith (Bluehost). In his talk, Jared Smith will talk about telecommunications systems built on open source software such as Asterisk and Kamailio, and how they can give you better productivity and agility, all while saving you money.  He will also highlight Bluehost's use of open source software to run its contact centers.",
    "id": 298,
    "begin": "3 Jul 10:40 am",
    "end": "3 Jul 11:20 am",
    "dtstart": "20130724T104000",
    "dtend": "20130724T112000"
  },
  {
    "dtstamp": "20130708T205507",
    "location": "E142",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31480",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-10:40--31480",
    "summary": "Using And Extending The Freeside Billing Toolkit",
    "description": "Presented by Jason Hall (Bluehost). When marketing, finance, and legislation collide, developers often get stuck with the short end of the stick. Instead of reinventing the wheel, there is an open source answer. Learn how developers can use the Freeside toolkit to create a flexible billing and payment controller.",
    "id": 299,
    "begin": "4 Jul 10:40 am",
    "end": "4 Jul 11:20 am",
    "dtstart": "20130725T104000",
    "dtend": "20130725T112000"
  },
  {
    "dtstamp": "20130713T071606",
    "location": "E142",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31433",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-19:00--31433",
    "summary": "Teaching the open source-friendly Google App Engine (and friends)",
    "description": "When you think of vendor software, typically open source doesn't come to mind, but in this train-the-trainer session, we'll discuss how to teach the open source-friendly Google App Engine in your courses on web, mobile, or internal applications as well as cover some auxiliary open source apps & services related to App Engine plus cover some best practices in teaching this revolutionary technology.",
    "id": 300,
    "begin": "3 Jul 7:00 pm",
    "end": "3 Jul 8:00 pm",
    "dtstart": "20130724T190000",
    "dtend": "20130724T200000"
  },
  {
    "dtstamp": "20130725T002847",
    "location": "E142",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31501",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-14:30--31501",
    "summary": "Modern Cassandra",
    "description": "Presented by Jonathan Ellis (DataStax). Many people still think of Cassandra as a \"key value store\" or a \"map of maps.\"  These early descriptions no longer do justice to Cassandra after five years of intense development. This talk will cover new features in Cassandra 2.0 including lightweight transactions, virtual nodes, CQL (the Cassandra query language), as well as an updated look at performance.",
    "id": 301,
    "begin": "3 Jul 2:30 pm",
    "end": "3 Jul 3:10 pm",
    "dtstart": "20130724T143000",
    "dtend": "20130724T151000"
  },
  {
    "dtstamp": "20130710T235246",
    "location": "E142",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/28488",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-16:10--28488",
    "summary": "Build Your Own PaaS",
    "description": "Presented by Steven Citron-Pousty (Red Hat OpenShift), Grant Shipley (Red Hat). Learn all about OpenShift Origin – the FOSS platform as a service (PaaS). This session is intended for anyone who wants to learn more about the cool things we do under the hoods to make a true multi-tenant secure PaaS.",
    "id": 302,
    "begin": "4 Jul 4:10 pm",
    "end": "4 Jul 5:40 pm",
    "dtstart": "20130725T161000",
    "dtend": "20130725T174000"
  },
  {
    "dtstamp": "20130724T205948",
    "location": "E142",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31510",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-11:30--31510",
    "summary": "inBloom Developer Jumpstart",
    "description": "Presented by Jason Hoekstra  (inBloom). Learn how inBloom's secure, open-source APIs and services can connect your applications into the ed tech marketplace.  Hear how this will enable new learning technologies for students and parents.  Examples of early developers that are utilizing this technology to accelerate application development will be showcased.",
    "id": 303,
    "begin": "3 Jul 11:30 am",
    "end": "3 Jul 12:10 pm",
    "dtstart": "20130724T113000",
    "dtend": "20130724T121000"
  },
  {
    "dtstamp": "20130715T171450",
    "location": "E142",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31507",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-19:00--31507",
    "summary": "OpenStack Distro Smackdown",
    "description": "There are dozens of distributions of OpenStack, from Linux vendors like Red Hat, Suse, Canonical, hosting or hardware companies like Rackspace, Dell, Cisco, or from start-ups Piston Cloud, Nebula, Cloudscaling and more. Come along to hear about the focus and differences between a myriad of OpenStack distributions, where they're different and how we can work together on common needs upstream.",
    "id": 304,
    "begin": "4 Jul 7:00 pm",
    "end": "4 Jul 8:00 pm",
    "dtstart": "20130725T190000",
    "dtend": "20130725T200000"
  },
  {
    "dtstamp": "20130715T215315",
    "location": "E142",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31524",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-14:30--31524",
    "summary": "Easy Scaling with Open Source Data Structures",
    "description": "Presented by Talip Ozturk (Hazelcast). In this session, we will discuss how you can easily scale your applications by using scalable data structures such as distributed map, queue and atomiclong implementations provided by Hazelcast, an open source in-memory data grid solution.",
    "id": 305,
    "begin": "4 Jul 2:30 pm",
    "end": "4 Jul 3:10 pm",
    "dtstart": "20130725T143000",
    "dtend": "20130725T151000"
  },
  {
    "dtstamp": "20130719T231019",
    "location": "E142",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31560",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-11:30--31560",
    "summary": "Calling All Geniuses: Developing Apps for Cars",
    "description": "Presented by Nick Pudar (General Motors). Hear first-hand how automakers are re-thinking their structure and business models to move in-sync with the broader connected ecosystem and consumer trends. Explore how the GM SDK will expand access to the infotainment environment and engage the developer community through enabling multiple opportunities for app monetization.",
    "id": 306,
    "begin": "4 Jul 11:30 am",
    "end": "4 Jul 12:10 pm",
    "dtstart": "20130725T113000",
    "dtend": "20130725T121000"
  },
  {
    "dtstamp": "20130611T181852",
    "location": "E143",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31396",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-13:40--31396",
    "summary": "Exploiting your File System to Build Robust & Efficient Workflows",
    "description": "Presented by Jason Johnson (SoftLayer). If your software writes to disk, you can never know too much about your file system! File systems offer a feature set often replicated, usually with less performance and reliability. In this talk, we will cover the file system notification infrastructure (inotify), locking (mandatory vs advisory and implications of distribution), movement guarantees (atomicity), and basic performance tuning.",
    "id": 307,
    "begin": "4 Jul 1:40 pm",
    "end": "4 Jul 2:20 pm",
    "dtstart": "20130725T134000",
    "dtend": "20130725T142000"
  },
  {
    "dtstamp": "20130724T215429",
    "location": "E143",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31422",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-10:40--31422",
    "summary": "Federated Services, POSSE, and You",
    "description": "Presented by Chason Chaffin (Media Temple ). Two subjects, one session. First, we'll be speaking about how we manage hundreds of git repositories and still get work done.  Second, learn about federated services, and how running them can free you from walled gardens.",
    "id": 308,
    "begin": "3 Jul 10:40 am",
    "end": "3 Jul 11:20 am",
    "dtstart": "20130724T104000",
    "dtend": "20130724T112000"
  },
  {
    "dtstamp": "20130724T222341",
    "location": "E143",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31374",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-13:40--31374",
    "summary": "Choosing A Shard Key In MongoDB",
    "description": "Presented by Shaun Verch (10gen). Choosing a shard key can be difficult, and the factors involved largely depend on your use case.  In fact, there is no such thing as a perfect shard key;  there are design tradeoffs inherent in every decision.  This talk will discuss those tradeoffs, as well as the different types of shard keys available in MongoDB, such as hashed and compound shard keys.",
    "id": 309,
    "begin": "3 Jul 1:40 pm",
    "end": "3 Jul 2:20 pm",
    "dtstart": "20130724T134000",
    "dtend": "20130724T142000"
  },
  {
    "dtstamp": "20130724T190835",
    "location": "E143",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31432",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-11:30--31432",
    "summary": "Cloud Portability With Multi-Cloud Toolkits",
    "description": "Presented by Everett Toews (Rackspace). In this session you'll learn how to effectively use software development toolkits that operate across multiple clouds. Find out how to distinguish between the layers of abstraction to achieve maximum portability or utilize cloud specific features. I'll show examples of multi-cloud toolkit code for Java (jclouds), Node.js (pkgcloud), Python (libcloud), and Ruby (fog).",
    "id": 310,
    "begin": "3 Jul 11:30 am",
    "end": "3 Jul 12:10 pm",
    "dtstart": "20130724T113000",
    "dtend": "20130724T121000"
  },
  {
    "dtstamp": "20130627T220531",
    "location": "E143",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31434",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-11:30--31434",
    "summary": "Luigi - Batch Data Processing at Large Scale",
    "description": "Presented by Erik Bernhardsson (Spotify). Luigi is a Python module that helps you build complex pipelines of batch jobs. It handles dependency resolution, workflow management, visualization etc. It also comes with Hadoop support built in.",
    "id": 311,
    "begin": "4 Jul 11:30 am",
    "end": "4 Jul 12:10 pm",
    "dtstart": "20130725T113000",
    "dtend": "20130725T121000"
  },
  {
    "dtstamp": "20130709T000036",
    "location": "E143",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31459",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-19:00--31459",
    "summary": "The Spring BOF",
    "description": "There's been a lot of great new stuff coming or recently released for Spring developers: Spring 4, Spring XD, Spring for Hadoop, and a lot of improvements to the Java configuration support across Spring Security, Spring Batch, Spring Data, Spring Data REST, Spring HATEOAS, Spring Social and more. Let's talk about these changes and anything related to Spring at this Spring BOF.",
    "id": 312,
    "begin": "3 Jul 7:00 pm",
    "end": "3 Jul 8:00 pm",
    "dtstart": "20130724T190000",
    "dtend": "20130724T200000"
  },
  {
    "dtstamp": "20130712T033918",
    "location": "E143",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31511",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-10:40--31511",
    "summary": "inBloom Open Source Roadmap",
    "description": "Presented by Jason Hoekstra  (inBloom). inBloom has built a suite of secure services to improve personalized learning for K-12 education.  The source code for these services will be released under an Apache license later this year.  Come participate in a discussion of our long-term plans of open-source community building and code governance.",
    "id": 313,
    "begin": "4 Jul 10:40 am",
    "end": "4 Jul 11:20 am",
    "dtstart": "20130725T104000",
    "dtend": "20130725T112000"
  },
  {
    "dtstamp": "20130712T195116",
    "location": "E143",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31515",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-14:30--31515",
    "summary": "Must Haves for your Cloud Toolbox: Driving to DevOps with Crowbar and Dasein",
    "description": "Presented by Joseph  George (Dell, Inc.), James  Urquhart (Dell), Tim Cook (Hightail Inc. (formerly YouSendIt.com)). In this session, discover how the community-driven open source projects, Crowbar and Dasein, can enhance the agility of your cloud and big data initiatives. Learn first-hand how users and community members are applying these tools to specific use cases, including OpenStack and Hadoop environments. Also, benefit from our discussion of best practices and lessons learned from real-world deployments.",
    "id": 314,
    "begin": "3 Jul 2:30 pm",
    "end": "3 Jul 3:10 pm",
    "dtstart": "20130724T143000",
    "dtend": "20130724T151000"
  },
  {
    "dtstamp": "20130716T181315",
    "location": "E143",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31519",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-19:00--31519",
    "summary": "Scaling PHP in the real world!",
    "description": "PHP is used by the likes of Facebook, Yahoo, Zynga, Tumblr, Etsy, and Wikipedia. Join this session and find out how to use the latest tools in PHP for developing high performance applications.",
    "id": 315,
    "begin": "4 Jul 7:00 pm",
    "end": "4 Jul 8:00 pm",
    "dtstart": "20130725T190000",
    "dtend": "20130725T200000"
  },
  {
    "dtstamp": "20130716T233952",
    "location": "E143",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31541",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-14:30--31541",
    "summary": "Building and Selling a Company Using Open Source",
    "description": "Presented by Lucas Carlson (AppFog). Ever thought of starting your own company around Open Source tools? Lucas Carlson did just that with AppFog (a popular polyglot PaaS built with Cloud Foundry). Over 100,000 developers signed up for AppFog in 3 years. AppFog was acquired in June 2013 by CenturyLink.",
    "id": 316,
    "begin": "4 Jul 2:30 pm",
    "end": "4 Jul 3:10 pm",
    "dtstart": "20130725T143000",
    "dtend": "20130725T151000"
  },
  {
    "dtstamp": "20130724T161225",
    "location": "Portland Ballroom",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29590",
    "uid": "http://oscon.com/oscon2013--s2013-07-22-17:30--29590",
    "summary": "Ignite OSCON",
    "description": "If you had five minutes on stage what would you say? What if you only got 20 slides and they rotated automatically after 15 seconds? Would you pitch a project? Launch a web site? Teach a hack? We’ll find out at our annual Ignite event at OSCON.",
    "id": 317,
    "begin": "1 Jul 5:30 pm",
    "end": "1 Jul 7:00 pm",
    "dtstart": "20130722T173000",
    "dtend": "20130722T190000"
  },
  {
    "dtstamp": "20130724T232340",
    "location": "Portland Ballroom",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29657",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-08:45--29657",
    "summary": "Opening Welcome",
    "description": "Presented by Edd Dumbill (Silicon Valley Data Science), Sarah Novotny (Meteor Entertainment), Matthew McCullough (GitHub, Inc.). Opening remarks by OSCON program chairs, Sarah Novotny, Matthew McCullough and Edd Dumbill.",
    "id": 318,
    "begin": "3 Jul 8:45 am",
    "end": "3 Jul 8:55 am",
    "dtstart": "20130724T084500",
    "dtend": "20130724T085500"
  },
  {
    "dtstamp": "20130725T003017",
    "location": "Portland Ballroom",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29558",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-09:05--29558",
    "summary": "The Open Compute Project",
    "description": "Presented by Jay Parikh (Facebook). In this keynote, Jay Parikh will provide an overview of the Open Compute Project, a thriving consumer-led community dedicated to promoting more openness and a greater focus on scale, efficiency, and sustainability in the development of infrastructure technologies. Jay will give a brief history of the project and describe its vision for the future, focusing on two new projects within OCP.",
    "id": 319,
    "begin": "3 Jul 9:05 am",
    "end": "3 Jul 9:20 am",
    "dtstart": "20130724T090500",
    "dtend": "20130724T092000"
  },
  {
    "dtstamp": "20130725T003056",
    "location": "Portland Ballroom",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31470",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-09:20--31470",
    "summary": "Creating Communities of Inclusion",
    "description": "Presented by Mark Hinkle (Citrix). Free and open source software is equal parts technology and humanity. Beyond the coding standards, development environments and essential parts of delivering free software the ideals that drive this movement are powerful. This is a reflection on the lessons gleaned from successful F/LOSS communities and a call to action to spread their ideals to other endeavors such as medicine and government.",
    "id": 320,
    "begin": "3 Jul 9:20 am",
    "end": "3 Jul 9:30 am",
    "dtstart": "20130724T092000",
    "dtend": "20130724T093000"
  },
  {
    "dtstamp": "20130725T003119",
    "location": "Portland Ballroom",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29559",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-09:30--29559",
    "summary": "The Joy of Flying Robots with Clojure",
    "description": "Presented by Carin Meier (Neo). Experience the joy of flying the Parrot AR Drone using the power of Clojure.  We will take a journey that begins with a child's dream of having a \"real\" robot friend.  Along the way, we will discover the blessings of a functional language, the power of the Clojure language, the thrill of flying with a REPL, and maybe even gems of wisdom long lost under the snow of the AI Winter.",
    "id": 321,
    "begin": "3 Jul 9:30 am",
    "end": "3 Jul 9:45 am",
    "dtstart": "20130724T093000",
    "dtend": "20130724T094500"
  },
  {
    "dtstamp": "20130725T003144",
    "location": "Portland Ballroom",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31431",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-09:45--31431",
    "summary": "Open Source: The Secret Ingredient",
    "description": "Presented by Todd Greene (Media Temple). Russ will discuss the decisive competitive edge companies like (mt) Media Temple gains and gives with Open Source programmers.",
    "id": 322,
    "begin": "3 Jul 9:45 am",
    "end": "3 Jul 9:50 am",
    "dtstart": "20130724T094500",
    "dtend": "20130724T095000"
  },
  {
    "dtstamp": "20130725T003209",
    "location": "Portland Ballroom",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29556",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-09:55--29556",
    "summary": "Redefining What's Possible On Mobile and Cloud",
    "description": "Presented by Mark R.  Shuttleworth (Canonical Ltd.). Mark Shuttleworth, Founder, Canonical, Ltd.",
    "id": 323,
    "begin": "3 Jul 9:55 am",
    "end": "3 Jul 10:10 am",
    "dtstart": "20130724T095500",
    "dtend": "20130724T101000"
  },
  {
    "dtstamp": "20130328T184803",
    "location": "Portland Ballroom",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29659",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-09:00--29659",
    "summary": "Thursday Welcome",
    "description": "Presented by Edd Dumbill (Silicon Valley Data Science), Sarah Novotny (Meteor Entertainment), Matthew McCullough (GitHub, Inc.), Simon St. Laurent (O'Reilly Media, Inc.). Opening remarks by the OSCON program chairs, Sarah Novotny, Matthew McCullough and Edd Dumbill.",
    "id": 324,
    "begin": "4 Jul 9:00 am",
    "end": "4 Jul 9:05 am",
    "dtstart": "20130725T090000",
    "dtend": "20130725T090500"
  },
  {
    "dtstamp": "20130718T145046",
    "location": "Portland Ballroom",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29554",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-09:05--29554",
    "summary": "Diversity in the Innovation Economy: Why It Matters And What You Can Do About It",
    "description": "Presented by Laura Weidman Powers (CODE2040). The year 2040 is the year when people of color will be the majority in the United States, but minorities are vastly underrepresented in the most important part of the US economy, the tech sector. There's been a lot of discussion about the lack of diversity in Silicon Valley and the technology industry recently and, let's face it, the numbers are not good. But why does it even matter?",
    "id": 325,
    "begin": "4 Jul 9:05 am",
    "end": "4 Jul 9:20 am",
    "dtstart": "20130725T090500",
    "dtend": "20130725T092000"
  },
  {
    "dtstamp": "20130709T172444",
    "location": "Portland Ballroom",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31490",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-09:20--31490",
    "summary": "Code Is Making Government More Effective",
    "description": "Presented by Jared Smith (Bluehost), Michal Migurski (Code For America), Tim O'Reilly (O'Reilly Media, Inc.). Open Source is quietly helping shape our society, and you can see its impact on government through the work of Code for America. From making public information more accessible to making public artwork easier to find, Code for America finds innovative ways to make a government more efficient.",
    "id": 326,
    "begin": "4 Jul 9:20 am",
    "end": "4 Jul 9:30 am",
    "dtstart": "20130725T092000",
    "dtend": "20130725T093000"
  },
  {
    "dtstamp": "20130328T184740",
    "location": "Portland Ballroom",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29555",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-09:30--29555",
    "summary": "Tom Preston-Werner",
    "description": "Presented by Tom Preston-Werner (GitHub). Tom Preston-Werner, Co-founder and CEO, GitHub.",
    "id": 327,
    "begin": "4 Jul 9:30 am",
    "end": "4 Jul 9:45 am",
    "dtstart": "20130725T093000",
    "dtend": "20130725T094500"
  },
  {
    "dtstamp": "20130625T163921",
    "location": "Portland Ballroom",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31413",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-09:45--31413",
    "summary": "Licensing Models and Building an Open Source Community",
    "description": "Presented by Eileen Evans (HP). Come hear some thoughts about how licensing models affect building an open source community and how their use has evolved over time.",
    "id": 328,
    "begin": "4 Jul 9:45 am",
    "end": "4 Jul 9:55 am",
    "dtstart": "20130725T094500",
    "dtend": "20130725T095500"
  },
  {
    "dtstamp": "20130708T143138",
    "location": "Portland Ballroom",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/30226",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-09:55--30226",
    "summary": "We The People: Open Source, Open Data",
    "description": "Presented by Leigh Heyman (Executive Office of the President). Leigh will talk briefly about these achievements and more importantly what the future holds for Open Source and Open Data at The White House and the many ways citizens and developers can get involved.",
    "id": 329,
    "begin": "4 Jul 9:55 am",
    "end": "4 Jul 10:10 am",
    "dtstart": "20130725T095500",
    "dtend": "20130725T101000"
  },
  {
    "dtstamp": "20130328T185038",
    "location": "Portland Ballroom",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29660",
    "uid": "http://oscon.com/oscon2013--s2013-07-26-09:00--29660",
    "summary": "Friday Welcome",
    "description": "Presented by Edd Dumbill (Silicon Valley Data Science), Sarah Novotny (Meteor Entertainment), Matthew McCullough (GitHub, Inc.), Simon St. Laurent (O'Reilly Media, Inc.). Opening remarks by the OSCON program chairs, Sarah Novotny, Matthew McCullough and Edd Dumbill.",
    "id": 330,
    "begin": "5 Jul 9:00 am",
    "end": "5 Jul 9:05 am",
    "dtstart": "20130726T090000",
    "dtend": "20130726T090500"
  },
  {
    "dtstamp": "20130710T181532",
    "location": "Portland Ballroom",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31502",
    "uid": "http://oscon.com/oscon2013--s2013-07-26-09:25--31502",
    "summary": "Distilling Distinction",
    "description": "Presented by Robert \"r0ml\" Lefkowitz (Sharewave). “Distinction\" is the noun for the adjective “Distinguished\".  The ACM Distinguished Member Recognition Program recognizes those who have \"achieved a significant impact on the computing field.”  Curiously, the ideals and practices of Open Source software are heavily under-represented.  Why is that?  And how do we change that?",
    "id": 331,
    "begin": "5 Jul 9:25 am",
    "end": "5 Jul 9:40 am",
    "dtstart": "20130726T092500",
    "dtend": "20130726T094000"
  },
  {
    "dtstamp": "20130328T185220",
    "location": "Portland Ballroom",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29662",
    "uid": "http://oscon.com/oscon2013--s2013-07-26-09:40--29662",
    "summary": "Piers Cawley",
    "description": "Presented by Piers Cawley (Thermeon). Piers Cawley, Senior Programmer, Headforwards.",
    "id": 332,
    "begin": "5 Jul 9:40 am",
    "end": "5 Jul 9:50 am",
    "dtstart": "20130726T094000",
    "dtend": "20130726T095000"
  },
  {
    "dtstamp": "20130411T190104",
    "location": "Portland Ballroom",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29917",
    "uid": "http://oscon.com/oscon2013--s2013-07-26-09:05--29917",
    "summary": "Turing's Curse",
    "description": "Presented by John Graham-Cumming (CloudFlare). Looking back on 30 years of programming: there's nothing new since 1983. Examples and implications.",
    "id": 333,
    "begin": "5 Jul 9:05 am",
    "end": "5 Jul 9:20 am",
    "dtstart": "20130726T090500",
    "dtend": "20130726T092000"
  },
  {
    "dtstamp": "20130517T162534",
    "location": "Portland Ballroom",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29956",
    "uid": "http://oscon.com/oscon2013--s2013-07-26-12:40--29956",
    "summary": "O'Reilly Open Source Awards",
    "description": "The 9th Annual O’Reilly Open Source Award winners will be announced.",
    "id": 334,
    "begin": "5 Jul 12:40 pm",
    "end": "5 Jul 12:45 pm",
    "dtstart": "20130726T124000",
    "dtend": "20130726T124500"
  },
  {
    "dtstamp": "20130701T161447",
    "location": "Portland Ballroom",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29029",
    "uid": "http://oscon.com/oscon2013--s2013-07-26-12:45--29029",
    "summary": "Fear, Uncertainty, and Dopamine",
    "description": "Presented by Paul Fenwick (Perl Training Australia). A discussion of community building from a psychological perspective. How to recruit people into your project, external and internal motivations, what people regret, self-fulfilling prophecies, confirmation bias, and more.",
    "id": 335,
    "begin": "5 Jul 12:45 pm",
    "end": "5 Jul 1:10 pm",
    "dtstart": "20130726T124500",
    "dtend": "20130726T131000"
  },
  {
    "dtstamp": "20130725T003007",
    "location": "Portland Ballroom",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/30583",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-08:55--30583",
    "summary": "On Open Intelligence",
    "description": "Presented by Jeff  Hawkins (Numenta, Inc.). Jeff Hawkins will describe Numenta's vision for machine intelligence.  He will give a brief introduction to the technology and describe why Numenta is creating an open source project.",
    "id": 336,
    "begin": "3 Jul 8:55 am",
    "end": "3 Jul 9:05 am",
    "dtstart": "20130724T085500",
    "dtend": "20130724T090500"
  },
  {
    "dtstamp": "20130711T002059",
    "location": "Portland Ballroom",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31505",
    "uid": "http://oscon.com/oscon2013--s2013-07-26-09:20--31505",
    "summary": "Frank Willison Memorial Award 2013",
    "description": "O'Reilly Media presents the Frank Willison Award annually at OSCON, the O'Reilly Open Source Convention. The recipient is chosen by O'Reilly Media in consultation with Guido van Rossum and delegates of the Python Software Foundation. The award consists of a framed certificate and one free pass to a future OSCON.",
    "id": 337,
    "begin": "5 Jul 9:20 am",
    "end": "5 Jul 9:25 am",
    "dtstart": "20130726T092000",
    "dtend": "20130726T092500"
  },
  {
    "dtstamp": "20130725T003157",
    "location": "Portland Ballroom",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31512",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-09:50--31512",
    "summary": "inBloom Vision and Impact on Education",
    "description": "Presented by Sharren  Bates (inBloom). inBloom Chief Product Officer Sharren Bates will provide an overview of inBloom open-source technologies and its mission of vastly improving K-12 personalized learning.  Sharren will review research behind the inBloom vision and what barriers exist today to achieving personalize learning as well as a sample of early, innovative products crossing these barriers with inBloom technology.",
    "id": 338,
    "begin": "3 Jul 9:50 am",
    "end": "3 Jul 9:55 am",
    "dtstart": "20130724T095000",
    "dtend": "20130724T095500"
  },
  {
    "dtstamp": "20130722T194512",
    "location": "Portland Ballroom Foyer",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29601",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-21:00--29601",
    "summary": "Citrix Open Cloud Poker Party",
    "description": "Citrix is sponsoring a night of poker, cocktails and hors d'oeuvres. For one night only, OSCON’s Foyer will be transformed into Portland’s only poker room complete with professional dealers. You'll be playing poker above the city lights with a perfect view of the city.",
    "id": 339,
    "begin": "3 Jul 9:00 pm",
    "end": "3 Jul 11:00 pm",
    "dtstart": "20130724T210000",
    "dtend": "20130724T230000"
  },
  {
    "dtstamp": "20130716T221234",
    "location": "Portland Ballroom Foyer",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29959",
    "uid": "http://oscon.com/oscon2013--s2013-07-26-13:15--29959",
    "summary": "Closing Get-together",
    "description": "Take the opportunity to network one last time and exchange contact information with one another. Drinks and snacks provided.",
    "id": 340,
    "begin": "5 Jul 1:15 pm",
    "end": "5 Jul 2:00 pm",
    "dtstart": "20130726T131500",
    "dtend": "20130726T140000"
  },
  {
    "dtstamp": "20130724T210020",
    "location": "Exhibit Hall E",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31539",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-12:10--31539",
    "summary": "Lunch + Women in Open Source Meetup",
    "description": "Make new connections and share experiences with women attending OSCON plus others from the local tech community.",
    "id": 341,
    "begin": "3 Jul 12:10 pm",
    "end": "3 Jul 1:40 pm",
    "dtstart": "20130724T121000",
    "dtend": "20130724T134000"
  },
  {
    "dtstamp": "20130722T045107",
    "location": "Ginkoberry Concourse",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/30014",
    "uid": "http://oscon.com/oscon2013--s2013-07-26-14:00--30014",
    "summary": "Portland Walking Tour",
    "description": "Cap off your trip to Portland with one of Portland's award-winning guided walking tours. Tours will leave from the convention center right after the closing keynotes. Please register in advance. Tickets range from $20-$45 per person depending on the tour.",
    "id": 342,
    "begin": "5 Jul 2:00 pm",
    "end": "5 Jul 4:00 pm",
    "dtstart": "20130726T140000",
    "dtend": "20130726T160000"
  },
  {
    "dtstamp": "20130723T233356",
    "location": "See BoF Schedule for Locations",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29595",
    "uid": "http://oscon.com/oscon2013--s2013-07-22-19:00--29595",
    "summary": "Monday Birds of a Feather Sessions (BoFs)",
    "description": "Birds of a Feather (BoF) sessions provide face to face exposure to those interested in the same projects and concepts. BoFs can be organized for individual projects or broader topics (best practices, open data, standards). BoFs are entirely up to you. We post your topic and provide the space and time. You provide the engaging topic.",
    "id": 343,
    "begin": "1 Jul 7:00 pm",
    "end": "1 Jul 10:00 pm",
    "dtstart": "20130722T190000",
    "dtend": "20130722T220000"
  },
  {
    "dtstamp": "20130315T151700",
    "location": "See BoF Schedule for Locations",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29596",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-19:00--29596",
    "summary": "Wednesday Birds of a Feather Sessions (BoFs)",
    "description": "Birds of a Feather (BoF) sessions provide face to face exposure to those interested in the same projects and concepts. BoFs can be organized for individual projects or broader topics (best practices, open data, standards). BoFs are entirely up to you. We post your topic and provide the space and time. You provide the engaging topic.",
    "id": 344,
    "begin": "3 Jul 7:00 pm",
    "end": "3 Jul 10:00 pm",
    "dtstart": "20130724T190000",
    "dtend": "20130724T220000"
  },
  {
    "dtstamp": "20130716T221426",
    "location": "See BoF Schedule for Locations",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29597",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-19:00--29597",
    "summary": "Thursday Birds of a Feather Sessions (BoFs)",
    "description": "Birds of a Feather (BoF) sessions provide face to face exposure to those interested in the same projects and concepts. BoFs can be organized for individual projects or broader topics (best practices, open data, standards). BoFs are entirely up to you. We post your topic and provide the space and time. You provide the engaging topic.",
    "id": 345,
    "begin": "4 Jul 7:00 pm",
    "end": "4 Jul 10:00 pm",
    "dtstart": "20130725T190000",
    "dtend": "20130725T220000"
  },
  {
    "dtstamp": "20130724T173755",
    "location": "Expo Hall",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29593",
    "uid": "http://oscon.com/oscon2013--s2013-07-23-17:00--29593",
    "summary": "Expo Hall Opening Reception (Sponsored by Bluehost)",
    "description": "Grab a drink and kick off the 15th edition of OSCON by meeting and mingling with exhibitors and fellow attendees. (Sponsored by Bluehost)",
    "id": 346,
    "begin": "2 Jul 5:00 pm",
    "end": "2 Jul 6:00 pm",
    "dtstart": "20130723T170000",
    "dtend": "20130723T180000"
  },
  {
    "dtstamp": "20130315T151644",
    "location": "Expo Hall",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29600",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-17:40--29600",
    "summary": "Booth Crawl",
    "description": "Quench your thirst with vendor-hosted libations and snacks while you check out all the cool stuff in the expo hall.",
    "id": 347,
    "begin": "3 Jul 5:40 pm",
    "end": "3 Jul 7:00 pm",
    "dtstart": "20130724T174000",
    "dtend": "20130724T190000"
  },
  {
    "dtstamp": "20130724T203731",
    "location": "Puppet Labs Headquarters, 926 NW 13th Ave. #210",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29598",
    "uid": "http://oscon.com/oscon2013--s2013-07-23-20:00--29598",
    "summary": "Puppet Labs Party",
    "description": "Join Puppet Labs for our OSCON \"Open\" House Party!  We are excited to open our doors and show off our new headquarters and meet all our Puppet Labs friends.",
    "id": 348,
    "begin": "2 Jul 8:00 pm",
    "end": "2 Jul 10:00 pm",
    "dtstart": "20130723T200000",
    "dtend": "20130723T220000"
  },
  {
    "dtstamp": "20130715T202743",
    "location": "Jupiter Hotel (830 E Burnside St.)",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31419",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-19:30--31419",
    "summary": "Apache CouchDB Party hosted by Cloudant",
    "description": "Join us in celebrating the great year that the Apache CouchDB project had, welcoming new committers and pushing out many new releases. We'll be in the courtyard at the Jupiter Hotel with food trucks and signature cocktails. Drinks and distributed database clustering for all!",
    "id": 349,
    "begin": "4 Jul 7:30 pm",
    "end": "4 Jul 9:00 pm",
    "dtstart": "20130725T193000",
    "dtend": "20130725T210000"
  },
  {
    "dtstamp": "20130703T223556",
    "location": "Sandbox Studios (420 Northeast 9th Avenue)",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29599",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-19:00--29599",
    "summary": "OpenStack 3rd Birthday Bash",
    "description": "Join us to celebrate three years of the fastest growing open source cloud project! OpenStack launched at OSCON 2010, and we've made a tradition of celebrating each birthday during the conference. This year we're bringing the same laid back atmosphere to a bigger venue with some new twists to make it the best party yet.",
    "id": 350,
    "begin": "3 Jul 7:00 pm",
    "end": "3 Jul 9:00 pm",
    "dtstart": "20130724T190000",
    "dtend": "20130724T210000"
  },
  {
    "dtstamp": "20130724T183110",
    "location": "Exhibit Hall B",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29594",
    "uid": "http://oscon.com/oscon2013--s2013-07-23-18:00--29594",
    "summary": "Planet OSCON Party (hosted by O'Reilly Media and Microsoft)",
    "description": "Put a star on your calendar for the official OSCON attendee party. You'll see Exhibit Hall B transformed into an intergalactic planetary playland, complete with a planetarium, laser tag, interactive games, food, drinks, and much more. Trust us: you don't want to miss OSCON's 15th birthday party. Think legendary. With lasers.",
    "id": 351,
    "begin": "2 Jul 6:00 pm",
    "end": "2 Jul 8:00 pm",
    "dtstart": "20130723T180000",
    "dtend": "20130723T200000"
  },
  {
    "dtstamp": "20130716T195328",
    "location": "The Rose (111 SW Ash Street)",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/29962",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-18:00--29962",
    "summary": "Media Temple Party",
    "description": "Join Media Temple for free libations, food, and swag from 6:00pm - 7:30p at The Rose. Come say hi and pick up some swag!",
    "id": 352,
    "begin": "4 Jul 6:00 pm",
    "end": "4 Jul 7:30 pm",
    "dtstart": "20130725T180000",
    "dtend": "20130725T193000"
  },
  {
    "dtstamp": "20130709T220000",
    "location": "Bottom of the stairs by the E Rooms",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31494",
    "uid": "http://oscon.com/oscon2013--s2013-07-25-07:30--31494",
    "summary": "Morning Yoga",
    "description": "Programmers do a lot of sitting, so come refresh your body, mind, and spirit before you head into the day’s sessions. This will be an easy beginner’s yoga session – so don’t be shy about coming out even if this will be your first yoga experience.",
    "id": 353,
    "begin": "4 Jul 7:30 am",
    "end": "4 Jul 8:15 am",
    "dtstart": "20130725T073000",
    "dtend": "20130725T081500"
  },
  {
    "dtstamp": "20130725T000302",
    "location": "Bottom of the stairs by the E Rooms",
    "url": "http://www.oscon.com/oscon2013/public/schedule/detail/31493",
    "uid": "http://oscon.com/oscon2013--s2013-07-24-07:30--31493",
    "summary": "Morning Yoga",
    "description": "Programmers do a lot of sitting, so come refresh your body, mind, and spirit before you head into the day’s sessions. This will be an easy beginner’s yoga session – so don’t be shy about coming out even if this will be your first yoga experience.",
    "id": 354,
    "begin": "3 Jul 7:30 am",
    "end": "3 Jul 8:15 am",
    "dtstart": "20130724T073000",
    "dtend": "20130724T081500"
  }
]